-- Prove2me | solution 1 for WorkbookSource.base_40646
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:55:35.62677+00:00
-- url     : https://prove2.me/submissions/35e95304-05d0-4a19-aac0-f9d87ff97149

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3) : (a^3 + b^3) / (a * b + 1) + (b^3 + c^3) / (b * c + 1) + (c^3 + a^3) / (c * a + 1) ≥ 3  := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (17*a^7/729 + 137*a^6*b/729 + 137*a^6*c/729 + 68*a^5*b^2/243 + 160*a^5*b*c/243 + 68*a^5*c^2/243 + 46*a^4*b^3/729 + 256*a^4*b^2*c/243 + 256*a^4*b*c^2/243 + 46*a^4*c^3/729 + 46*a^3*b^4/729 - 608*a^3*b^3*c/729 - 733*a^3*b^2*c^2/243 - 608*a^3*b*c^3/729 + 46*a^3*c^4/729 + 68*a^2*b^5/243 + 256*a^2*b^4*c/243 - 733*a^2*b^3*c^2/243 - 733*a^2*b^2*c^3/243 + 256*a^2*b*c^4/243 + 68*a^2*c^5/243 + 137*a*b^6/729 + 160*a*b^5*c/243 + 256*a*b^4*c^2/243 - 608*a*b^3*c^3/729 + 256*a*b^2*c^4/243 + 160*a*b*c^5/243 + 137*a*c^6/729 + 17*b^7/729 + 137*b^6*c/729 + 68*b^5*c^2/243 + 46*b^4*c^3/729 + 46*b^3*c^4/729 + 68*b^2*c^5/243 + 137*b*c^6/729 + 17*c^7/729) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (44/3 : ℝ) * a^5 * (b - a)^2 + (44/3 : ℝ) * a^5 * (b - a)^1 * (c - b)^1 + (44/3 : ℝ) * a^5 * (c - b)^2 + (436/9 : ℝ) * a^4 * (b - a)^3 + (218/3 : ℝ) * a^4 * (b - a)^2 * (c - b)^1 + (74 : ℝ) * a^4 * (b - a)^1 * (c - b)^2 + (224/9 : ℝ) * a^4 * (c - b)^3 + (557/9 : ℝ) * a^3 * (b - a)^4 + (1114/9 : ℝ) * a^3 * (b - a)^3 * (c - b)^1 + (1271/9 : ℝ) * a^3 * (b - a)^2 * (c - b)^2 + (238/3 : ℝ) * a^3 * (b - a)^1 * (c - b)^3 + (133/9 : ℝ) * a^3 * (c - b)^4 + (1018/27 : ℝ) * a^2 * (b - a)^5 + (2545/27 : ℝ) * a^2 * (b - a)^4 * (c - b)^1 + (3340/27 : ℝ) * a^2 * (b - a)^3 * (c - b)^2 + (2465/27 : ℝ) * a^2 * (b - a)^2 * (c - b)^3 + (866/27 : ℝ) * a^2 * (b - a)^1 * (c - b)^4 + (107/27 : ℝ) * a^2 * (c - b)^5 + (2606/243 : ℝ) * a^1 * (b - a)^6 + (2606/81 : ℝ) * a^1 * (b - a)^5 * (c - b)^1 + (3973/81 : ℝ) * a^1 * (b - a)^4 * (c - b)^2 + (10808/243 : ℝ) * a^1 * (b - a)^3 * (c - b)^3 + (1819/81 : ℝ) * a^1 * (b - a)^2 * (c - b)^4 + (452/81 : ℝ) * a^1 * (b - a)^1 * (c - b)^5 + (131/243 : ℝ) * a^1 * (c - b)^6 + (808/729 : ℝ) * (b - a)^7 + (2828/729 : ℝ) * (b - a)^6 * (c - b)^1 + (1690/243 : ℝ) * (b - a)^5 * (c - b)^2 + (5605/729 : ℝ) * (b - a)^4 * (c - b)^3 + (3716/729 : ℝ) * (b - a)^3 * (c - b)^4 + (461/243 : ℝ) * (b - a)^2 * (c - b)^5 + (256/729 : ℝ) * (b - a)^1 * (c - b)^6 + (17/729 : ℝ) * (c - b)^7 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (17*a^7/729 + 137*a^6*b/729 + 137*a^6*c/729 + 68*a^5*b^2/243 + 160*a^5*b*c/243 + 68*a^5*c^2/243 + 46*a^4*b^3/729 + 256*a^4*b^2*c/243 + 256*a^4*b*c^2/243 + 46*a^4*c^3/729 + 46*a^3*b^4/729 - 608*a^3*b^3*c/729 - 733*a^3*b^2*c^2/243 - 608*a^3*b*c^3/729 + 46*a^3*c^4/729 + 68*a^2*b^5/243 + 256*a^2*b^4*c/243 - 733*a^2*b^3*c^2/243 - 733*a^2*b^2*c^3/243 + 256*a^2*b*c^4/243 + 68*a^2*c^5/243 + 137*a*b^6/729 + 160*a*b^5*c/243 + 256*a*b^4*c^2/243 - 608*a*b^3*c^3/729 + 256*a*b^2*c^4/243 + 160*a*b*c^5/243 + 137*a*c^6/729 + 17*b^7/729 + 137*b^6*c/729 + 68*b^5*c^2/243 + 46*b^4*c^3/729 + 46*b^3*c^4/729 + 68*b^2*c^5/243 + 137*b*c^6/729 + 17*c^7/729) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux0 a c b (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux0 b a c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c b a (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (a^4*b^2*c + a^4*b*c^2 + a^4*b + a^4*c + 2*a^3*b*c + 2*a^3 + a^2*b^4*c - 3*a^2*b^2*c^2 + a^2*b*c^4 - 3*a^2*b*c + a*b^4*c^2 + a*b^4 + 2*a*b^3*c + a*b^2*c^4 - 3*a*b^2*c + 2*a*b*c^3 - 3*a*b*c^2 - 3*a*b + a*c^4 - 3*a*c + b^4*c + 2*b^3 + b*c^4 - 3*b*c + 2*c^3 - 3) = (17*a^7/729 + 137*a^6*b/729 + 137*a^6*c/729 + 68*a^5*b^2/243 + 160*a^5*b*c/243 + 68*a^5*c^2/243 + 46*a^4*b^3/729 + 256*a^4*b^2*c/243 + 256*a^4*b*c^2/243 + 46*a^4*c^3/729 + 46*a^3*b^4/729 - 608*a^3*b^3*c/729 - 733*a^3*b^2*c^2/243 - 608*a^3*b*c^3/729 + 46*a^3*c^4/729 + 68*a^2*b^5/243 + 256*a^2*b^4*c/243 - 733*a^2*b^3*c^2/243 - 733*a^2*b^2*c^3/243 + 256*a^2*b*c^4/243 + 68*a^2*c^5/243 + 137*a*b^6/729 + 160*a*b^5*c/243 + 256*a*b^4*c^2/243 - 608*a*b^3*c^3/729 + 256*a*b^2*c^4/243 + 160*a*b*c^5/243 + 137*a*c^6/729 + 17*b^7/729 + 137*b^6*c/729 + 68*b^5*c^2/243 + 46*b^4*c^3/729 + 46*b^3*c^4/729 + 68*b^2*c^5/243 + 137*b*c^6/729 + 17*c^7/729) := by
    linear_combination (-17*a^6/729 - 40*a^5*b/243 - 40*a^5*c/243 - 17*a^5/243 - 28*a^4*b^2/243 - 80*a^4*b*c/243 - 103*a^4*b/243 - 28*a^4*c^2/243 - 103*a^4*c/243 - 17*a^4/81 + 38*a^3*b^3/729 + 95*a^3*b^2*c/243 + 19*a^3*b^2/243 + 95*a^3*b*c^2/243 - 34*a^3*b*c/243 - 5*a^3*b/81 + 38*a^3*c^3/729 + 19*a^3*c^2/243 - 5*a^3*c/81 - 17*a^3/27 - 28*a^2*b^4/243 + 95*a^2*b^3*c/243 + 19*a^2*b^3/243 + 181*a^2*b^2*c^2/81 + 100*a^2*b^2*c/81 + 8*a^2*b^2/27 + 95*a^2*b*c^3/243 + 100*a^2*b*c^2/81 + 46*a^2*b*c/27 + 4*a^2*b/9 - 28*a^2*c^4/243 + 19*a^2*c^3/243 + 8*a^2*c^2/27 + 4*a^2*c/9 + a^2/9 - 40*a*b^5/243 - 80*a*b^4*c/243 - 103*a*b^4/243 + 95*a*b^3*c^2/243 - 34*a*b^3*c/243 - 5*a*b^3/81 + 95*a*b^2*c^3/243 + 100*a*b^2*c^2/81 + 46*a*b^2*c/27 + 4*a*b^2/9 - 80*a*b*c^4/243 - 34*a*b*c^3/243 + 46*a*b*c^2/27 + 11*a*b*c/9 + 11*a*b/9 - 40*a*c^5/243 - 103*a*c^4/243 - 5*a*c^3/81 + 4*a*c^2/9 + 11*a*c/9 + a/3 - 17*b^6/729 - 40*b^5*c/243 - 17*b^5/243 - 28*b^4*c^2/243 - 103*b^4*c/243 - 17*b^4/81 + 38*b^3*c^3/729 + 19*b^3*c^2/243 - 5*b^3*c/81 - 17*b^3/27 - 28*b^2*c^4/243 + 19*b^2*c^3/243 + 8*b^2*c^2/27 + 4*b^2*c/9 + b^2/9 - 40*b*c^5/243 - 103*b*c^4/243 - 5*b*c^3/81 + 4*b*c^2/9 + 11*b*c/9 + b/3 - 17*c^6/729 - 17*c^5/243 - 17*c^4/81 - 17*c^3/27 + c^2/9 + c/3 + 1) * hab
  have hn : 0 ≤ (a^4*b^2*c + a^4*b*c^2 + a^4*b + a^4*c + 2*a^3*b*c + 2*a^3 + a^2*b^4*c - 3*a^2*b^2*c^2 + a^2*b*c^4 - 3*a^2*b*c + a*b^4*c^2 + a*b^4 + 2*a*b^3*c + a*b^2*c^4 - 3*a*b^2*c + 2*a*b*c^3 - 3*a*b*c^2 - 3*a*b + a*c^4 - 3*a*c + b^4*c + 2*b^3 + b*c^4 - 3*b*c + 2*c^3 - 3) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3), (a^3 + b^3) / (a * b + 1) + (b^3 + c^3) / (b * c + 1) + (c^3 + a^3) / (c * a + 1) ≥ 3) := @solution
#print axioms solution
