-- Prove2me | solution 1 for WorkbookSource.plus_40566
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:09:06.559741+00:00
-- url     : https://prove2.me/submissions/45bc548a-1a58-4aa5-adaa-0d3276dbee7e

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 6) : a / (b ^ 2 + c + 1) + b / (c ^ 2 + a + 1) + c / (a ^ 2 + b + 1) ≥ 6 / 7   := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (259*a^6/1296 + 611*a^5*b/1296 + 275*a^5*c/1296 - 1015*a^4*b^2/1296 + 163*a^4*b*c/432 + 1121*a^4*c^2/1296 - 131*a^3*b^3/648 - 217*a^3*b^2*c/324 + 401*a^3*b*c^2/324 - 131*a^3*c^3/648 + 1121*a^2*b^4/1296 + 401*a^2*b^3*c/324 - 41*a^2*b^2*c^2/8 - 217*a^2*b*c^3/324 - 1015*a^2*c^4/1296 + 275*a*b^5/1296 + 163*a*b^4*c/432 - 217*a*b^3*c^2/324 + 401*a*b^2*c^3/324 + 163*a*b*c^4/432 + 611*a*c^5/1296 + 259*b^6/1296 + 611*b^5*c/1296 - 1015*b^4*c^2/1296 - 131*b^3*c^3/648 + 1121*b^2*c^4/1296 + 275*b*c^5/1296 + 259*c^6/1296) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (413/48 : ℝ) * a^4 * (b - a)^2 + (413/48 : ℝ) * a^4 * (b - a)^1 * (c - b)^1 + (413/48 : ℝ) * a^4 * (c - b)^2 + (259/12 : ℝ) * a^3 * (b - a)^3 + (309/8 : ℝ) * a^3 * (b - a)^2 * (c - b)^1 + (1025/24 : ℝ) * a^3 * (b - a)^1 * (c - b)^2 + (77/6 : ℝ) * a^3 * (c - b)^3 + (20 : ℝ) * a^2 * (b - a)^4 + (105/2 : ℝ) * a^2 * (b - a)^3 * (c - b)^1 + (287/4 : ℝ) * a^2 * (b - a)^2 * (c - b)^2 + (157/4 : ℝ) * a^2 * (b - a)^1 * (c - b)^3 + (55/8 : ℝ) * a^2 * (c - b)^4 + (1261/162 : ℝ) * a^1 * (b - a)^5 + (4327/162 : ℝ) * a^1 * (b - a)^4 * (c - b)^1 + (14807/324 : ℝ) * a^1 * (b - a)^3 * (c - b)^2 + (23063/648 : ℝ) * a^1 * (b - a)^2 * (c - b)^3 + (8153/648 : ℝ) * a^1 * (b - a)^1 * (c - b)^4 + (305/162 : ℝ) * a^1 * (c - b)^5 + (26/27 : ℝ) * (b - a)^6 + (217/54 : ℝ) * (b - a)^5 * (c - b)^1 + (1445/162 : ℝ) * (b - a)^4 * (c - b)^2 + (1519/162 : ℝ) * (b - a)^3 * (c - b)^3 + (709/144 : ℝ) * (b - a)^2 * (c - b)^4 + (1829/1296 : ℝ) * (b - a)^1 * (c - b)^5 + (259/1296 : ℝ) * (c - b)^6 := by positivity
    convert hpos using 1 <;> ring
  have haux1 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ c) (hord2 : c ≤ b) : 0 ≤ (259*a^6/1296 + 611*a^5*b/1296 + 275*a^5*c/1296 - 1015*a^4*b^2/1296 + 163*a^4*b*c/432 + 1121*a^4*c^2/1296 - 131*a^3*b^3/648 - 217*a^3*b^2*c/324 + 401*a^3*b*c^2/324 - 131*a^3*c^3/648 + 1121*a^2*b^4/1296 + 401*a^2*b^3*c/324 - 41*a^2*b^2*c^2/8 - 217*a^2*b*c^3/324 - 1015*a^2*c^4/1296 + 275*a*b^5/1296 + 163*a*b^4*c/432 - 217*a*b^3*c^2/324 + 401*a*b^2*c^3/324 + 163*a*b*c^4/432 + 611*a*c^5/1296 + 259*b^6/1296 + 611*b^5*c/1296 - 1015*b^4*c^2/1296 - 131*b^3*c^3/648 + 1121*b^2*c^4/1296 + 275*b*c^5/1296 + 259*c^6/1296) := by
    have hdiff1 : 0 ≤ (c - a) := by linarith
    have hdiff2 : 0 ≤ (b - c) := by linarith
    have hpos : 0 ≤ (413/48 : ℝ) * a^4 * (c - a)^2 + (413/48 : ℝ) * a^4 * (c - a)^1 * (b - c)^1 + (413/48 : ℝ) * a^4 * (b - c)^2 + (259/12 : ℝ) * a^3 * (c - a)^3 + (209/8 : ℝ) * a^3 * (c - a)^2 * (b - c)^1 + (725/24 : ℝ) * a^3 * (c - a)^1 * (b - c)^2 + (77/6 : ℝ) * a^3 * (b - c)^3 + (20 : ℝ) * a^2 * (c - a)^4 + (55/2 : ℝ) * a^2 * (c - a)^3 * (b - c)^1 + (137/4 : ℝ) * a^2 * (c - a)^2 * (b - c)^2 + (107/4 : ℝ) * a^2 * (c - a)^1 * (b - c)^3 + (55/8 : ℝ) * a^2 * (b - c)^4 + (1261/162 : ℝ) * a^1 * (c - a)^5 + (989/81 : ℝ) * a^1 * (c - a)^4 * (b - c)^1 + (5411/324 : ℝ) * a^1 * (c - a)^3 * (b - c)^2 + (12371/648 : ℝ) * a^1 * (c - a)^2 * (b - c)^3 + (6857/648 : ℝ) * a^1 * (c - a)^1 * (b - c)^4 + (305/162 : ℝ) * a^1 * (b - c)^5 + (26/27 : ℝ) * (c - a)^6 + (95/54 : ℝ) * (c - a)^5 * (b - c)^1 + (265/81 : ℝ) * (c - a)^4 * (b - c)^2 + (871/162 : ℝ) * (c - a)^3 * (b - c)^3 + (1975/432 : ℝ) * (c - a)^2 * (b - c)^4 + (2165/1296 : ℝ) * (c - a)^1 * (b - c)^5 + (259/1296 : ℝ) * (b - c)^6 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (259*a^6/1296 + 611*a^5*b/1296 + 275*a^5*c/1296 - 1015*a^4*b^2/1296 + 163*a^4*b*c/432 + 1121*a^4*c^2/1296 - 131*a^3*b^3/648 - 217*a^3*b^2*c/324 + 401*a^3*b*c^2/324 - 131*a^3*c^3/648 + 1121*a^2*b^4/1296 + 401*a^2*b^3*c/324 - 41*a^2*b^2*c^2/8 - 217*a^2*b*c^3/324 - 1015*a^2*c^4/1296 + 275*a*b^5/1296 + 163*a*b^4*c/432 - 217*a*b^3*c^2/324 + 401*a*b^2*c^3/324 + 163*a*b*c^4/432 + 611*a*c^5/1296 + 259*b^6/1296 + 611*b^5*c/1296 - 1015*b^4*c^2/1296 - 131*b^3*c^3/648 + 1121*b^2*c^4/1296 + 275*b*c^5/1296 + 259*c^6/1296) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux1 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux1 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux1 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (7*a^4 - 6*a^3*b^2 + 7*a^3*c^2 - 6*a^3*c + a^3 + 7*a^2*b^3 - 6*a^2*b^2*c^2 - 6*a^2*b^2 + 7*a^2*b*c + 14*a^2*b - 6*a^2*c^3 - 6*a^2*c^2 - 6*a^2*c + a^2 - 6*a*b^3 + 7*a*b^2*c - 6*a*b^2 + 7*a*b*c^2 - 6*a*b*c + a*b + 14*a*c^2 + a*c + a + 7*b^4 - 6*b^3*c^2 + b^3 + 7*b^2*c^3 - 6*b^2*c^2 + 14*b^2*c + b^2 - 6*b*c^3 - 6*b*c^2 + b*c + b + 7*c^4 + c^3 + c^2 + c - 6) = (259*a^6/1296 + 611*a^5*b/1296 + 275*a^5*c/1296 - 1015*a^4*b^2/1296 + 163*a^4*b*c/432 + 1121*a^4*c^2/1296 - 131*a^3*b^3/648 - 217*a^3*b^2*c/324 + 401*a^3*b*c^2/324 - 131*a^3*c^3/648 + 1121*a^2*b^4/1296 + 401*a^2*b^3*c/324 - 41*a^2*b^2*c^2/8 - 217*a^2*b*c^3/324 - 1015*a^2*c^4/1296 + 275*a*b^5/1296 + 163*a*b^4*c/432 - 217*a*b^3*c^2/324 + 401*a*b^2*c^3/324 + 163*a*b*c^4/432 + 611*a*c^5/1296 + 259*b^6/1296 + 611*b^5*c/1296 - 1015*b^4*c^2/1296 - 131*b^3*c^3/648 + 1121*b^2*c^4/1296 + 275*b*c^5/1296 + 259*c^6/1296) := by
    linear_combination (-259*a^5/1296 - 22*a^4*b/81 - a^4*c/81 - 259*a^4/216 + 1367*a^3*b^2/1296 - 121*a^3*b*c/1296 - 31*a^3*b/72 - 1105*a^3*c^2/1296 + 9*a^3*c/8 - 7*a^3/36 - 1105*a^2*b^3/1296 - 7*a^2*b^2*c/24 + 41*a^2*b^2/54 - 7*a^2*b*c^2/24 - 271*a^2*b*c/216 - 43*a^2*b/18 + 1367*a^2*c^3/1296 + 41*a^2*c^2/54 + 17*a^2*c/18 - a^2/6 - a*b^4/81 - 121*a*b^3*c/1296 + 9*a*b^3/8 - 7*a*b^2*c^2/24 - 271*a*b^2*c/216 + 17*a*b^2/18 - 121*a*b*c^3/1296 - 271*a*b*c^2/216 + 11*a*b*c/12 - a*b/6 - 22*a*c^4/81 - 31*a*c^3/72 - 43*a*c^2/18 - a*c/6 - 259*b^5/1296 - 22*b^4*c/81 - 259*b^4/216 + 1367*b^3*c^2/1296 - 31*b^3*c/72 - 7*b^3/36 - 1105*b^2*c^3/1296 + 41*b^2*c^2/54 - 43*b^2*c/18 - b^2/6 - b*c^4/81 + 9*b*c^3/8 + 17*b*c^2/18 - b*c/6 - 259*c^5/1296 - 259*c^4/216 - 7*c^3/36 - c^2/6 + 1) * habc
  have hn : 0 ≤ (7*a^4 - 6*a^3*b^2 + 7*a^3*c^2 - 6*a^3*c + a^3 + 7*a^2*b^3 - 6*a^2*b^2*c^2 - 6*a^2*b^2 + 7*a^2*b*c + 14*a^2*b - 6*a^2*c^3 - 6*a^2*c^2 - 6*a^2*c + a^2 - 6*a*b^3 + 7*a*b^2*c - 6*a*b^2 + 7*a*b*c^2 - 6*a*b*c + a*b + 14*a*c^2 + a*c + a + 7*b^4 - 6*b^3*c^2 + b^3 + 7*b^2*c^3 - 6*b^2*c^2 + 14*b^2*c + b^2 - 6*b*c^3 - 6*b*c^2 + b*c + b + 7*c^4 + c^3 + c^2 + c - 6) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 6), a / (b ^ 2 + c + 1) + b / (c ^ 2 + a + 1) + c / (a ^ 2 + b + 1) ≥ 6 / 7) := @solution
#print axioms solution
