-- Prove2me | solution 1 for WorkbookSource.base_20078
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T10:47:47.350755+00:00
-- url     : https://prove2.me/submissions/dde462da-07bb-4e45-aa2a-c52b99e11853

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 1800000
set_option maxRecDepth 4096
theorem solution (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z) (h : x + y + z = 1) : x * y ^ 2 + y * z ^ 2 + z * x ^ 2 + x * y + y * z + z * x ≤ 4 / 9  := by
  have hw0 : 0 ≤ (x) := by linarith only [hx]
  have hw1 : 0 ≤ (y) := by linarith only [hy]
  have hw2 : 0 ≤ (z) := by linarith only [hz]
  have hw3 : 0 ≤ (x + y + z - 1) := by linarith only [h]
  have hw4 : 0 ≤ (-x - y - z + 1) := by linarith only [h]
  have hsum : 0 ≤ (4861/43700 : ℝ) * (1) * (-7267*x/14583 - 7267*y/14583 + z - 49/43749)^2 + (3658/43749 : ℝ) * (1) * (-7267*x/7316 + y - 49/21948)^2 + (49/43896 : ℝ) * (1) * (x - 1/3)^2 + (174751/393300 : ℝ) * ((-x - y - z + 1)) * (86940*x/174751 + 86940*y/174751 + 86940*z/174751 + 1)^2 + (2118894593/22909856100 : ℝ) * ((-x - y - z + 1)) * (-935752887*x/2118894593 - 935752887*y/2118894593 + z)^2 + (2366283412/31783418895 : ℝ) * ((-x - y - z + 1)) * (-935752887*x/1183141706 + y)^2 + (247388819/8873562795 : ℝ) * ((-x - y - z + 1)) * (x)^2 + (12/25 : ℝ) * ((z)) * (x/6 + y - 2*z/3 - 1/6)^2 + (1/92 : ℝ) * ((z) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 + (12/25 : ℝ) * ((y)) * (x - 2*y/3 + z/6 - 1/6)^2 + (1/92 : ℝ) * ((y) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 + (12/25 : ℝ) * ((x)) * (-2*x/3 + y/6 + z - 1/6)^2 + (1/92 : ℝ) * ((x) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 := by positivity
  have hid : ( 4 / 9  ) - ( x * y ^ 2 + y * z ^ 2 + z * x ^ 2 + x * y + y * z + z * x ) = (4861/43700 : ℝ) * (1) * (-7267*x/14583 - 7267*y/14583 + z - 49/43749)^2 + (3658/43749 : ℝ) * (1) * (-7267*x/7316 + y - 49/21948)^2 + (49/43896 : ℝ) * (1) * (x - 1/3)^2 + (174751/393300 : ℝ) * ((-x - y - z + 1)) * (86940*x/174751 + 86940*y/174751 + 86940*z/174751 + 1)^2 + (2118894593/22909856100 : ℝ) * ((-x - y - z + 1)) * (-935752887*x/2118894593 - 935752887*y/2118894593 + z)^2 + (2366283412/31783418895 : ℝ) * ((-x - y - z + 1)) * (-935752887*x/1183141706 + y)^2 + (247388819/8873562795 : ℝ) * ((-x - y - z + 1)) * (x)^2 + (12/25 : ℝ) * ((z)) * (x/6 + y - 2*z/3 - 1/6)^2 + (1/92 : ℝ) * ((z) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 + (12/25 : ℝ) * ((y)) * (x - 2*y/3 + z/6 - 1/6)^2 + (1/92 : ℝ) * ((y) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 + (12/25 : ℝ) * ((x)) * (-2*x/3 + y/6 + z - 1/6)^2 + (1/92 : ℝ) * ((x) * (x + y + z - 1) * (-x - y - z + 1)) * (1)^2 := by ring
  linarith only [hsum, hid]
example : (∀ (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z) (h : x + y + z = 1), x * y ^ 2 + y * z ^ 2 + z * x ^ 2 + x * y + y * z + z * x ≤ 4 / 9) := @solution
#print axioms solution
