-- Prove2me | solution 1 for WorkbookSource.base_460
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-12T23:47:37.8333+00:00
-- url     : https://prove2.me/submissions/06f83d08-0816-4661-8d86-ea3d8a042eb8

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : a ≥ 0) (hb : b ≥ 0) (hc : c ≥ 0) (habc : a + b + c = 3) : (4 - a * b) * (4 - b * c) * (4 - c * a) + a * b * c ≥ 28  := by
  have hp : 0 ≤ (4*a^6/81 + 8*a^5*b/81 + 8*a^5*c/81 - 4*a^4*b^2/81 + 5*a^4*b*c/27 - 4*a^4*c^2/81 - 16*a^3*b^3/81 + 5*a^3*b^2*c/81 + 5*a^3*b*c^2/81 - 16*a^3*c^3/81 - 4*a^2*b^4/81 + 5*a^2*b^3*c/81 - 7*a^2*b^2*c^2/9 + 5*a^2*b*c^3/81 - 4*a^2*c^4/81 + 8*a*b^5/81 + 5*a*b^4*c/27 + 5*a*b^3*c^2/81 + 5*a*b^2*c^3/81 + 5*a*b*c^4/27 + 8*a*c^5/81 + 4*b^6/81 + 8*b^5*c/81 - 4*b^4*c^2/81 - 16*b^3*c^3/81 - 4*b^2*c^4/81 + 8*b*c^5/81 + 4*c^6/81) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (b - a) := by linarith
        have hdiff2 : 0 ≤ (c - b) := by linarith
        have hpos : 0 ≤ (5/3 : ℝ) * a^4 * (b - a)^2 + (5/3 : ℝ) * a^4 * (b - a)^1 * (c - b)^1 + (5/3 : ℝ) * a^4 * (c - b)^2 + (98/27 : ℝ) * a^3 * (b - a)^3 + (49/9 : ℝ) * a^3 * (b - a)^2 * (c - b)^1 + (71/9 : ℝ) * a^3 * (b - a)^1 * (c - b)^2 + (82/27 : ℝ) * a^3 * (c - b)^3 + (73/27 : ℝ) * a^2 * (b - a)^4 + (146/27 : ℝ) * a^2 * (b - a)^3 * (c - b)^1 + (98/9 : ℝ) * a^2 * (b - a)^2 * (c - b)^2 + (221/27 : ℝ) * a^2 * (b - a)^1 * (c - b)^3 + (49/27 : ℝ) * a^2 * (c - b)^4 + (56/81 : ℝ) * a^1 * (b - a)^5 + (140/81 : ℝ) * a^1 * (b - a)^4 * (c - b)^1 + (446/81 : ℝ) * a^1 * (b - a)^3 * (c - b)^2 + (529/81 : ℝ) * a^1 * (b - a)^2 * (c - b)^3 + (247/81 : ℝ) * a^1 * (b - a)^1 * (c - b)^4 + (40/81 : ℝ) * a^1 * (c - b)^5 + (64/81 : ℝ) * (b - a)^4 * (c - b)^2 + (128/81 : ℝ) * (b - a)^3 * (c - b)^3 + (32/27 : ℝ) * (b - a)^2 * (c - b)^4 + (32/81 : ℝ) * (b - a)^1 * (c - b)^5 + (4/81 : ℝ) * (c - b)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - a) := by linarith
          have hdiff2 : 0 ≤ (b - c) := by linarith
          have hpos : 0 ≤ (5/3 : ℝ) * a^4 * (c - a)^2 + (5/3 : ℝ) * a^4 * (c - a)^1 * (b - c)^1 + (5/3 : ℝ) * a^4 * (b - c)^2 + (98/27 : ℝ) * a^3 * (c - a)^3 + (49/9 : ℝ) * a^3 * (c - a)^2 * (b - c)^1 + (71/9 : ℝ) * a^3 * (c - a)^1 * (b - c)^2 + (82/27 : ℝ) * a^3 * (b - c)^3 + (73/27 : ℝ) * a^2 * (c - a)^4 + (146/27 : ℝ) * a^2 * (c - a)^3 * (b - c)^1 + (98/9 : ℝ) * a^2 * (c - a)^2 * (b - c)^2 + (221/27 : ℝ) * a^2 * (c - a)^1 * (b - c)^3 + (49/27 : ℝ) * a^2 * (b - c)^4 + (56/81 : ℝ) * a^1 * (c - a)^5 + (140/81 : ℝ) * a^1 * (c - a)^4 * (b - c)^1 + (446/81 : ℝ) * a^1 * (c - a)^3 * (b - c)^2 + (529/81 : ℝ) * a^1 * (c - a)^2 * (b - c)^3 + (247/81 : ℝ) * a^1 * (c - a)^1 * (b - c)^4 + (40/81 : ℝ) * a^1 * (b - c)^5 + (64/81 : ℝ) * (c - a)^4 * (b - c)^2 + (128/81 : ℝ) * (c - a)^3 * (b - c)^3 + (32/27 : ℝ) * (c - a)^2 * (b - c)^4 + (32/81 : ℝ) * (c - a)^1 * (b - c)^5 + (4/81 : ℝ) * (b - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (a - c) := by linarith
          have hdiff2 : 0 ≤ (b - a) := by linarith
          have hpos : 0 ≤ (5/3 : ℝ) * c^4 * (a - c)^2 + (5/3 : ℝ) * c^4 * (a - c)^1 * (b - a)^1 + (5/3 : ℝ) * c^4 * (b - a)^2 + (98/27 : ℝ) * c^3 * (a - c)^3 + (49/9 : ℝ) * c^3 * (a - c)^2 * (b - a)^1 + (71/9 : ℝ) * c^3 * (a - c)^1 * (b - a)^2 + (82/27 : ℝ) * c^3 * (b - a)^3 + (73/27 : ℝ) * c^2 * (a - c)^4 + (146/27 : ℝ) * c^2 * (a - c)^3 * (b - a)^1 + (98/9 : ℝ) * c^2 * (a - c)^2 * (b - a)^2 + (221/27 : ℝ) * c^2 * (a - c)^1 * (b - a)^3 + (49/27 : ℝ) * c^2 * (b - a)^4 + (56/81 : ℝ) * c^1 * (a - c)^5 + (140/81 : ℝ) * c^1 * (a - c)^4 * (b - a)^1 + (446/81 : ℝ) * c^1 * (a - c)^3 * (b - a)^2 + (529/81 : ℝ) * c^1 * (a - c)^2 * (b - a)^3 + (247/81 : ℝ) * c^1 * (a - c)^1 * (b - a)^4 + (40/81 : ℝ) * c^1 * (b - a)^5 + (64/81 : ℝ) * (a - c)^4 * (b - a)^2 + (128/81 : ℝ) * (a - c)^3 * (b - a)^3 + (32/27 : ℝ) * (a - c)^2 * (b - a)^4 + (32/81 : ℝ) * (a - c)^1 * (b - a)^5 + (4/81 : ℝ) * (b - a)^6 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (a - b) := by linarith
        have hdiff2 : 0 ≤ (c - a) := by linarith
        have hpos : 0 ≤ (5/3 : ℝ) * b^4 * (a - b)^2 + (5/3 : ℝ) * b^4 * (a - b)^1 * (c - a)^1 + (5/3 : ℝ) * b^4 * (c - a)^2 + (98/27 : ℝ) * b^3 * (a - b)^3 + (49/9 : ℝ) * b^3 * (a - b)^2 * (c - a)^1 + (71/9 : ℝ) * b^3 * (a - b)^1 * (c - a)^2 + (82/27 : ℝ) * b^3 * (c - a)^3 + (73/27 : ℝ) * b^2 * (a - b)^4 + (146/27 : ℝ) * b^2 * (a - b)^3 * (c - a)^1 + (98/9 : ℝ) * b^2 * (a - b)^2 * (c - a)^2 + (221/27 : ℝ) * b^2 * (a - b)^1 * (c - a)^3 + (49/27 : ℝ) * b^2 * (c - a)^4 + (56/81 : ℝ) * b^1 * (a - b)^5 + (140/81 : ℝ) * b^1 * (a - b)^4 * (c - a)^1 + (446/81 : ℝ) * b^1 * (a - b)^3 * (c - a)^2 + (529/81 : ℝ) * b^1 * (a - b)^2 * (c - a)^3 + (247/81 : ℝ) * b^1 * (a - b)^1 * (c - a)^4 + (40/81 : ℝ) * b^1 * (c - a)^5 + (64/81 : ℝ) * (a - b)^4 * (c - a)^2 + (128/81 : ℝ) * (a - b)^3 * (c - a)^3 + (32/27 : ℝ) * (a - b)^2 * (c - a)^4 + (32/81 : ℝ) * (a - b)^1 * (c - a)^5 + (4/81 : ℝ) * (c - a)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - b) := by linarith
          have hdiff2 : 0 ≤ (a - c) := by linarith
          have hpos : 0 ≤ (5/3 : ℝ) * b^4 * (c - b)^2 + (5/3 : ℝ) * b^4 * (c - b)^1 * (a - c)^1 + (5/3 : ℝ) * b^4 * (a - c)^2 + (98/27 : ℝ) * b^3 * (c - b)^3 + (49/9 : ℝ) * b^3 * (c - b)^2 * (a - c)^1 + (71/9 : ℝ) * b^3 * (c - b)^1 * (a - c)^2 + (82/27 : ℝ) * b^3 * (a - c)^3 + (73/27 : ℝ) * b^2 * (c - b)^4 + (146/27 : ℝ) * b^2 * (c - b)^3 * (a - c)^1 + (98/9 : ℝ) * b^2 * (c - b)^2 * (a - c)^2 + (221/27 : ℝ) * b^2 * (c - b)^1 * (a - c)^3 + (49/27 : ℝ) * b^2 * (a - c)^4 + (56/81 : ℝ) * b^1 * (c - b)^5 + (140/81 : ℝ) * b^1 * (c - b)^4 * (a - c)^1 + (446/81 : ℝ) * b^1 * (c - b)^3 * (a - c)^2 + (529/81 : ℝ) * b^1 * (c - b)^2 * (a - c)^3 + (247/81 : ℝ) * b^1 * (c - b)^1 * (a - c)^4 + (40/81 : ℝ) * b^1 * (a - c)^5 + (64/81 : ℝ) * (c - b)^4 * (a - c)^2 + (128/81 : ℝ) * (c - b)^3 * (a - c)^3 + (32/27 : ℝ) * (c - b)^2 * (a - c)^4 + (32/81 : ℝ) * (c - b)^1 * (a - c)^5 + (4/81 : ℝ) * (a - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (b - c) := by linarith
          have hdiff2 : 0 ≤ (a - b) := by linarith
          have hpos : 0 ≤ (5/3 : ℝ) * c^4 * (b - c)^2 + (5/3 : ℝ) * c^4 * (b - c)^1 * (a - b)^1 + (5/3 : ℝ) * c^4 * (a - b)^2 + (98/27 : ℝ) * c^3 * (b - c)^3 + (49/9 : ℝ) * c^3 * (b - c)^2 * (a - b)^1 + (71/9 : ℝ) * c^3 * (b - c)^1 * (a - b)^2 + (82/27 : ℝ) * c^3 * (a - b)^3 + (73/27 : ℝ) * c^2 * (b - c)^4 + (146/27 : ℝ) * c^2 * (b - c)^3 * (a - b)^1 + (98/9 : ℝ) * c^2 * (b - c)^2 * (a - b)^2 + (221/27 : ℝ) * c^2 * (b - c)^1 * (a - b)^3 + (49/27 : ℝ) * c^2 * (a - b)^4 + (56/81 : ℝ) * c^1 * (b - c)^5 + (140/81 : ℝ) * c^1 * (b - c)^4 * (a - b)^1 + (446/81 : ℝ) * c^1 * (b - c)^3 * (a - b)^2 + (529/81 : ℝ) * c^1 * (b - c)^2 * (a - b)^3 + (247/81 : ℝ) * c^1 * (b - c)^1 * (a - b)^4 + (40/81 : ℝ) * c^1 * (a - b)^5 + (64/81 : ℝ) * (b - c)^4 * (a - b)^2 + (128/81 : ℝ) * (b - c)^3 * (a - b)^3 + (32/27 : ℝ) * (b - c)^2 * (a - b)^4 + (32/81 : ℝ) * (b - c)^1 * (a - b)^5 + (4/81 : ℝ) * (a - b)^6 := by positivity
          convert hpos using 1 <;> ring
  have he : (-a^2*b^2*c^2 + 4*a^2*b*c + 4*a*b^2*c + 4*a*b*c^2 + a*b*c - 16*a*b - 16*a*c - 16*b*c + 36) = (4*a^6/81 + 8*a^5*b/81 + 8*a^5*c/81 - 4*a^4*b^2/81 + 5*a^4*b*c/27 - 4*a^4*c^2/81 - 16*a^3*b^3/81 + 5*a^3*b^2*c/81 + 5*a^3*b*c^2/81 - 16*a^3*c^3/81 - 4*a^2*b^4/81 + 5*a^2*b^3*c/81 - 7*a^2*b^2*c^2/9 + 5*a^2*b*c^3/81 - 4*a^2*c^4/81 + 8*a*b^5/81 + 5*a*b^4*c/27 + 5*a*b^3*c^2/81 + 5*a*b^2*c^3/81 + 5*a*b*c^4/27 + 8*a*c^5/81 + 4*b^6/81 + 8*b^5*c/81 - 4*b^4*c^2/81 - 16*b^3*c^3/81 - 4*b^2*c^4/81 + 8*b*c^5/81 + 4*c^6/81) := by
    linear_combination (-4*a^5/81 - 4*a^4*b/81 - 4*a^4*c/81 - 4*a^4/27 + 8*a^3*b^2/81 - 7*a^3*b*c/81 + 8*a^3*c^2/81 - 4*a^3/9 + 8*a^2*b^3/81 - 2*a^2*b^2*c/27 + 8*a^2*b^2/27 - 2*a^2*b*c^2/27 - 7*a^2*b*c/27 + 4*a^2*b/9 + 8*a^2*c^3/81 + 8*a^2*c^2/27 + 4*a^2*c/9 - 4*a^2/3 - 4*a*b^4/81 - 7*a*b^3*c/81 - 2*a*b^2*c^2/27 - 7*a*b^2*c/27 + 4*a*b^2/9 - 7*a*b*c^3/81 - 7*a*b*c^2/27 + 7*a*b*c/3 + 8*a*b/3 - 4*a*c^4/81 + 4*a*c^2/9 + 8*a*c/3 - 4*a - 4*b^5/81 - 4*b^4*c/81 - 4*b^4/27 + 8*b^3*c^2/81 - 4*b^3/9 + 8*b^2*c^3/81 + 8*b^2*c^2/27 + 4*b^2*c/9 - 4*b^2/3 - 4*b*c^4/81 + 4*b*c^2/9 + 8*b*c/3 - 4*b - 4*c^5/81 - 4*c^4/27 - 4*c^3/9 - 4*c^2/3 - 4*c - 12) * habc
  nlinarith only [hp, he]
example : (∀ (a b c : ℝ) (ha : a ≥ 0) (hb : b ≥ 0) (hc : c ≥ 0) (habc : a + b + c = 3), (4 - a * b) * (4 - b * c) * (4 - c * a) + a * b * c ≥ 28) := @solution
#print axioms solution
