-- Prove2me | solution 1 for WorkbookSource.base_5622
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T00:16:29.535144+00:00
-- url     : https://prove2.me/submissions/8fed2b90-7cfe-486d-a3bd-194091ea4420

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (x y z : ℝ) (hx : 0 ≤ x) (hy : 0 ≤ y) (hz : 0 ≤ z) (h : x + y + z = 3) : 2 * x * y * z * (x ^ 2 + y ^ 2 + z ^ 2) + (x ^ 2 - x + 1) * (y ^ 2 - y + 1) * (z ^ 2 - z + 1) ≤ 7  := by
  have hp : 0 ≤ (4*x^5*y/81 + 4*x^5*z/81 + 7*x^4*y^2/81 - 11*x^4*y*z/27 + 7*x^4*z^2/81 + 2*x^3*y^3/27 - 2*x^3*y^2*z/81 - 2*x^3*y*z^2/81 + 2*x^3*z^3/27 + 7*x^2*y^4/81 - 2*x^2*y^3*z/81 + x^2*y^2*z^2/3 - 2*x^2*y*z^3/81 + 7*x^2*z^4/81 + 4*x*y^5/81 - 11*x*y^4*z/27 - 2*x*y^3*z^2/81 - 2*x*y^2*z^3/81 - 11*x*y*z^4/27 + 4*x*z^5/81 + 4*y^5*z/81 + 7*y^4*z^2/81 + 2*y^3*z^3/27 + 7*y^2*z^4/81 + 4*y*z^5/81) := by
    rcases le_total x y with hab | hba
    · rcases le_total y z with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (y - x) := by linarith
        have hdiff2 : 0 ≤ (z - y) := by linarith
        have hpos : 0 ≤ (1/3 : ℝ) * x^4 * (y - x)^2 + (1/3 : ℝ) * x^4 * (y - x)^1 * (z - y)^1 + (1/3 : ℝ) * x^4 * (z - y)^2 + (32/27 : ℝ) * x^3 * (y - x)^3 + (16/9 : ℝ) * x^3 * (y - x)^2 * (z - y)^1 + (8/9 : ℝ) * x^3 * (y - x)^1 * (z - y)^2 + (4/27 : ℝ) * x^3 * (z - y)^3 + (49/27 : ℝ) * x^2 * (y - x)^4 + (98/27 : ℝ) * x^2 * (y - x)^3 * (z - y)^1 + (23/9 : ℝ) * x^2 * (y - x)^2 * (z - y)^2 + (20/27 : ℝ) * x^2 * (y - x)^1 * (z - y)^3 + (7/27 : ℝ) * x^2 * (z - y)^4 + (106/81 : ℝ) * x^1 * (y - x)^5 + (265/81 : ℝ) * x^1 * (y - x)^4 * (z - y)^1 + (262/81 : ℝ) * x^1 * (y - x)^3 * (z - y)^2 + (128/81 : ℝ) * x^1 * (y - x)^2 * (z - y)^3 + (41/81 : ℝ) * x^1 * (y - x)^1 * (z - y)^4 + (8/81 : ℝ) * x^1 * (z - y)^5 + (28/81 : ℝ) * (y - x)^6 + (28/27 : ℝ) * (y - x)^5 * (z - y)^1 + (107/81 : ℝ) * (y - x)^4 * (z - y)^2 + (74/81 : ℝ) * (y - x)^3 * (z - y)^3 + (1/3 : ℝ) * (y - x)^2 * (z - y)^4 + (4/81 : ℝ) * (y - x)^1 * (z - y)^5 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total x z with hac | hca
        ·
          have hdiff1 : 0 ≤ (z - x) := by linarith
          have hdiff2 : 0 ≤ (y - z) := by linarith
          have hpos : 0 ≤ (1/3 : ℝ) * x^4 * (z - x)^2 + (1/3 : ℝ) * x^4 * (z - x)^1 * (y - z)^1 + (1/3 : ℝ) * x^4 * (y - z)^2 + (32/27 : ℝ) * x^3 * (z - x)^3 + (16/9 : ℝ) * x^3 * (z - x)^2 * (y - z)^1 + (8/9 : ℝ) * x^3 * (z - x)^1 * (y - z)^2 + (4/27 : ℝ) * x^3 * (y - z)^3 + (49/27 : ℝ) * x^2 * (z - x)^4 + (98/27 : ℝ) * x^2 * (z - x)^3 * (y - z)^1 + (23/9 : ℝ) * x^2 * (z - x)^2 * (y - z)^2 + (20/27 : ℝ) * x^2 * (z - x)^1 * (y - z)^3 + (7/27 : ℝ) * x^2 * (y - z)^4 + (106/81 : ℝ) * x^1 * (z - x)^5 + (265/81 : ℝ) * x^1 * (z - x)^4 * (y - z)^1 + (262/81 : ℝ) * x^1 * (z - x)^3 * (y - z)^2 + (128/81 : ℝ) * x^1 * (z - x)^2 * (y - z)^3 + (41/81 : ℝ) * x^1 * (z - x)^1 * (y - z)^4 + (8/81 : ℝ) * x^1 * (y - z)^5 + (28/81 : ℝ) * (z - x)^6 + (28/27 : ℝ) * (z - x)^5 * (y - z)^1 + (107/81 : ℝ) * (z - x)^4 * (y - z)^2 + (74/81 : ℝ) * (z - x)^3 * (y - z)^3 + (1/3 : ℝ) * (z - x)^2 * (y - z)^4 + (4/81 : ℝ) * (z - x)^1 * (y - z)^5 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (x - z) := by linarith
          have hdiff2 : 0 ≤ (y - x) := by linarith
          have hpos : 0 ≤ (1/3 : ℝ) * z^4 * (x - z)^2 + (1/3 : ℝ) * z^4 * (x - z)^1 * (y - x)^1 + (1/3 : ℝ) * z^4 * (y - x)^2 + (32/27 : ℝ) * z^3 * (x - z)^3 + (16/9 : ℝ) * z^3 * (x - z)^2 * (y - x)^1 + (8/9 : ℝ) * z^3 * (x - z)^1 * (y - x)^2 + (4/27 : ℝ) * z^3 * (y - x)^3 + (49/27 : ℝ) * z^2 * (x - z)^4 + (98/27 : ℝ) * z^2 * (x - z)^3 * (y - x)^1 + (23/9 : ℝ) * z^2 * (x - z)^2 * (y - x)^2 + (20/27 : ℝ) * z^2 * (x - z)^1 * (y - x)^3 + (7/27 : ℝ) * z^2 * (y - x)^4 + (106/81 : ℝ) * z^1 * (x - z)^5 + (265/81 : ℝ) * z^1 * (x - z)^4 * (y - x)^1 + (262/81 : ℝ) * z^1 * (x - z)^3 * (y - x)^2 + (128/81 : ℝ) * z^1 * (x - z)^2 * (y - x)^3 + (41/81 : ℝ) * z^1 * (x - z)^1 * (y - x)^4 + (8/81 : ℝ) * z^1 * (y - x)^5 + (28/81 : ℝ) * (x - z)^6 + (28/27 : ℝ) * (x - z)^5 * (y - x)^1 + (107/81 : ℝ) * (x - z)^4 * (y - x)^2 + (74/81 : ℝ) * (x - z)^3 * (y - x)^3 + (1/3 : ℝ) * (x - z)^2 * (y - x)^4 + (4/81 : ℝ) * (x - z)^1 * (y - x)^5 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total x z with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (x - y) := by linarith
        have hdiff2 : 0 ≤ (z - x) := by linarith
        have hpos : 0 ≤ (1/3 : ℝ) * y^4 * (x - y)^2 + (1/3 : ℝ) * y^4 * (x - y)^1 * (z - x)^1 + (1/3 : ℝ) * y^4 * (z - x)^2 + (32/27 : ℝ) * y^3 * (x - y)^3 + (16/9 : ℝ) * y^3 * (x - y)^2 * (z - x)^1 + (8/9 : ℝ) * y^3 * (x - y)^1 * (z - x)^2 + (4/27 : ℝ) * y^3 * (z - x)^3 + (49/27 : ℝ) * y^2 * (x - y)^4 + (98/27 : ℝ) * y^2 * (x - y)^3 * (z - x)^1 + (23/9 : ℝ) * y^2 * (x - y)^2 * (z - x)^2 + (20/27 : ℝ) * y^2 * (x - y)^1 * (z - x)^3 + (7/27 : ℝ) * y^2 * (z - x)^4 + (106/81 : ℝ) * y^1 * (x - y)^5 + (265/81 : ℝ) * y^1 * (x - y)^4 * (z - x)^1 + (262/81 : ℝ) * y^1 * (x - y)^3 * (z - x)^2 + (128/81 : ℝ) * y^1 * (x - y)^2 * (z - x)^3 + (41/81 : ℝ) * y^1 * (x - y)^1 * (z - x)^4 + (8/81 : ℝ) * y^1 * (z - x)^5 + (28/81 : ℝ) * (x - y)^6 + (28/27 : ℝ) * (x - y)^5 * (z - x)^1 + (107/81 : ℝ) * (x - y)^4 * (z - x)^2 + (74/81 : ℝ) * (x - y)^3 * (z - x)^3 + (1/3 : ℝ) * (x - y)^2 * (z - x)^4 + (4/81 : ℝ) * (x - y)^1 * (z - x)^5 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total y z with hac | hca
        ·
          have hdiff1 : 0 ≤ (z - y) := by linarith
          have hdiff2 : 0 ≤ (x - z) := by linarith
          have hpos : 0 ≤ (1/3 : ℝ) * y^4 * (z - y)^2 + (1/3 : ℝ) * y^4 * (z - y)^1 * (x - z)^1 + (1/3 : ℝ) * y^4 * (x - z)^2 + (32/27 : ℝ) * y^3 * (z - y)^3 + (16/9 : ℝ) * y^3 * (z - y)^2 * (x - z)^1 + (8/9 : ℝ) * y^3 * (z - y)^1 * (x - z)^2 + (4/27 : ℝ) * y^3 * (x - z)^3 + (49/27 : ℝ) * y^2 * (z - y)^4 + (98/27 : ℝ) * y^2 * (z - y)^3 * (x - z)^1 + (23/9 : ℝ) * y^2 * (z - y)^2 * (x - z)^2 + (20/27 : ℝ) * y^2 * (z - y)^1 * (x - z)^3 + (7/27 : ℝ) * y^2 * (x - z)^4 + (106/81 : ℝ) * y^1 * (z - y)^5 + (265/81 : ℝ) * y^1 * (z - y)^4 * (x - z)^1 + (262/81 : ℝ) * y^1 * (z - y)^3 * (x - z)^2 + (128/81 : ℝ) * y^1 * (z - y)^2 * (x - z)^3 + (41/81 : ℝ) * y^1 * (z - y)^1 * (x - z)^4 + (8/81 : ℝ) * y^1 * (x - z)^5 + (28/81 : ℝ) * (z - y)^6 + (28/27 : ℝ) * (z - y)^5 * (x - z)^1 + (107/81 : ℝ) * (z - y)^4 * (x - z)^2 + (74/81 : ℝ) * (z - y)^3 * (x - z)^3 + (1/3 : ℝ) * (z - y)^2 * (x - z)^4 + (4/81 : ℝ) * (z - y)^1 * (x - z)^5 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (y - z) := by linarith
          have hdiff2 : 0 ≤ (x - y) := by linarith
          have hpos : 0 ≤ (1/3 : ℝ) * z^4 * (y - z)^2 + (1/3 : ℝ) * z^4 * (y - z)^1 * (x - y)^1 + (1/3 : ℝ) * z^4 * (x - y)^2 + (32/27 : ℝ) * z^3 * (y - z)^3 + (16/9 : ℝ) * z^3 * (y - z)^2 * (x - y)^1 + (8/9 : ℝ) * z^3 * (y - z)^1 * (x - y)^2 + (4/27 : ℝ) * z^3 * (x - y)^3 + (49/27 : ℝ) * z^2 * (y - z)^4 + (98/27 : ℝ) * z^2 * (y - z)^3 * (x - y)^1 + (23/9 : ℝ) * z^2 * (y - z)^2 * (x - y)^2 + (20/27 : ℝ) * z^2 * (y - z)^1 * (x - y)^3 + (7/27 : ℝ) * z^2 * (x - y)^4 + (106/81 : ℝ) * z^1 * (y - z)^5 + (265/81 : ℝ) * z^1 * (y - z)^4 * (x - y)^1 + (262/81 : ℝ) * z^1 * (y - z)^3 * (x - y)^2 + (128/81 : ℝ) * z^1 * (y - z)^2 * (x - y)^3 + (41/81 : ℝ) * z^1 * (y - z)^1 * (x - y)^4 + (8/81 : ℝ) * z^1 * (x - y)^5 + (28/81 : ℝ) * (y - z)^6 + (28/27 : ℝ) * (y - z)^5 * (x - y)^1 + (107/81 : ℝ) * (y - z)^4 * (x - y)^2 + (74/81 : ℝ) * (y - z)^3 * (x - y)^3 + (1/3 : ℝ) * (y - z)^2 * (x - y)^4 + (4/81 : ℝ) * (y - z)^1 * (x - y)^5 := by positivity
          convert hpos using 1 <;> ring
  have he : (-2*x^3*y*z - x^2*y^2*z^2 + x^2*y^2*z - x^2*y^2 + x^2*y*z^2 - x^2*y*z + x^2*y - x^2*z^2 + x^2*z - x^2 - 2*x*y^3*z + x*y^2*z^2 - x*y^2*z + x*y^2 - 2*x*y*z^3 - x*y*z^2 + x*y*z - x*y + x*z^2 - x*z + x - y^2*z^2 + y^2*z - y^2 + y*z^2 - y*z + y - z^2 + z + 6) = (4*x^5*y/81 + 4*x^5*z/81 + 7*x^4*y^2/81 - 11*x^4*y*z/27 + 7*x^4*z^2/81 + 2*x^3*y^3/27 - 2*x^3*y^2*z/81 - 2*x^3*y*z^2/81 + 2*x^3*z^3/27 + 7*x^2*y^4/81 - 2*x^2*y^3*z/81 + x^2*y^2*z^2/3 - 2*x^2*y*z^3/81 + 7*x^2*z^4/81 + 4*x*y^5/81 - 11*x*y^4*z/27 - 2*x*y^3*z^2/81 - 2*x*y^2*z^3/81 - 11*x*y*z^4/27 + 4*x*z^5/81 + 4*y^5*z/81 + 7*y^4*z^2/81 + 2*y^3*z^3/27 + 7*y^2*z^4/81 + 4*y*z^5/81) := by
    linear_combination (-4*x^4*y/81 - 4*x^4*z/81 - x^3*y^2/27 + 41*x^3*y*z/81 - 4*x^3*y/27 - x^3*z^2/27 - 4*x^3*z/27 - x^2*y^3/27 - 4*x^2*y^2*z/9 + x^2*y^2/27 - 4*x^2*y*z^2/9 - 5*x^2*y*z/27 - 4*x^2*y/9 - x^2*z^3/27 + x^2*z^2/27 - 4*x^2*z/9 - 4*x*y^4/81 + 41*x*y^3*z/81 - 4*x*y^3/27 - 4*x*y^2*z^2/9 - 5*x*y^2*z/27 - 4*x*y^2/9 + 41*x*y*z^3/81 - 5*x*y*z^2/27 - 2*x*y*z/3 - x*y/3 - 4*x*z^4/81 - 4*x*z^3/27 - 4*x*z^2/9 - x*z/3 - x - 4*y^4*z/81 - y^3*z^2/27 - 4*y^3*z/27 - y^2*z^3/27 + y^2*z^2/27 - 4*y^2*z/9 - 4*y*z^4/81 - 4*y*z^3/27 - 4*y*z^2/9 - y*z/3 - y - z - 2) * h
  nlinarith only [hp, he]
example : (∀ (x y z : ℝ) (hx : 0 ≤ x) (hy : 0 ≤ y) (hz : 0 ≤ z) (h : x + y + z = 3), 2 * x * y * z * (x ^ 2 + y ^ 2 + z ^ 2) + (x ^ 2 - x + 1) * (y ^ 2 - y + 1) * (z ^ 2 - z + 1) ≤ 7) := @solution
#print axioms solution
