-- Prove2me | solution 1 for WorkbookSource.plus_2308
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T06:16:00.086562+00:00
-- url     : https://prove2.me/submissions/18f0a834-89a6-4ecb-93bc-6401543c5381

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3) : a^3 / (a^2 + 1) + b^3 / (b^2 + 1) + c^3 / (c^2 + 1) ≥ 3 / 2   := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (8*a^7/729 + 20*a^6*b/729 + 20*a^6*c/729 + 23*a^5*b^2/243 - 2*a^5*b*c/243 + 23*a^5*c^2/243 + 163*a^4*b^3/729 - 41*a^4*b^2*c/243 - 41*a^4*b*c^2/243 + 163*a^4*c^3/729 + 163*a^3*b^4/729 - 194*a^3*b^3*c/729 - 22*a^3*b^2*c^2/243 - 194*a^3*b*c^3/729 + 163*a^3*c^4/729 + 23*a^2*b^5/243 - 41*a^2*b^4*c/243 - 22*a^2*b^3*c^2/243 - 22*a^2*b^2*c^3/243 - 41*a^2*b*c^4/243 + 23*a^2*c^5/243 + 20*a*b^6/729 - 2*a*b^5*c/243 - 41*a*b^4*c^2/243 - 194*a*b^3*c^3/729 - 41*a*b^2*c^4/243 - 2*a*b*c^5/243 + 20*a*c^6/729 + 8*b^7/729 + 20*b^6*c/729 + 23*b^5*c^2/243 + 163*b^4*c^3/729 + 163*b^3*c^4/729 + 23*b^2*c^5/243 + 20*b*c^6/729 + 8*c^7/729) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (8/3 : ℝ) * a^5 * (b - a)^2 + (8/3 : ℝ) * a^5 * (b - a)^1 * (c - b)^1 + (8/3 : ℝ) * a^5 * (c - b)^2 + (88/9 : ℝ) * a^4 * (b - a)^3 + (44/3 : ℝ) * a^4 * (b - a)^2 * (c - b)^1 + (12 : ℝ) * a^4 * (b - a)^1 * (c - b)^2 + (32/9 : ℝ) * a^4 * (c - b)^3 + (44/3 : ℝ) * a^3 * (b - a)^4 + (88/3 : ℝ) * a^3 * (b - a)^3 * (c - b)^1 + (236/9 : ℝ) * a^3 * (b - a)^2 * (c - b)^2 + (104/9 : ℝ) * a^3 * (b - a)^1 * (c - b)^3 + (20/9 : ℝ) * a^3 * (c - b)^4 + (304/27 : ℝ) * a^2 * (b - a)^5 + (760/27 : ℝ) * a^2 * (b - a)^4 * (c - b)^1 + (808/27 : ℝ) * a^2 * (b - a)^3 * (c - b)^2 + (452/27 : ℝ) * a^2 * (b - a)^2 * (c - b)^3 + (140/27 : ℝ) * a^2 * (b - a)^1 * (c - b)^4 + (20/27 : ℝ) * a^2 * (c - b)^5 + (1076/243 : ℝ) * a^1 * (b - a)^6 + (1076/81 : ℝ) * a^1 * (b - a)^5 * (c - b)^1 + (1363/81 : ℝ) * a^1 * (b - a)^4 * (c - b)^2 + (2798/243 : ℝ) * a^1 * (b - a)^3 * (c - b)^3 + (379/81 : ℝ) * a^1 * (b - a)^2 * (c - b)^4 + (92/81 : ℝ) * a^1 * (b - a)^1 * (c - b)^5 + (32/243 : ℝ) * a^1 * (c - b)^6 + (520/729 : ℝ) * (b - a)^7 + (1820/729 : ℝ) * (b - a)^6 * (c - b)^1 + (898/243 : ℝ) * (b - a)^5 * (c - b)^2 + (2185/729 : ℝ) * (b - a)^4 * (c - b)^3 + (1088/729 : ℝ) * (b - a)^3 * (c - b)^4 + (119/243 : ℝ) * (b - a)^2 * (c - b)^5 + (76/729 : ℝ) * (b - a)^1 * (c - b)^6 + (8/729 : ℝ) * (c - b)^7 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (8*a^7/729 + 20*a^6*b/729 + 20*a^6*c/729 + 23*a^5*b^2/243 - 2*a^5*b*c/243 + 23*a^5*c^2/243 + 163*a^4*b^3/729 - 41*a^4*b^2*c/243 - 41*a^4*b*c^2/243 + 163*a^4*c^3/729 + 163*a^3*b^4/729 - 194*a^3*b^3*c/729 - 22*a^3*b^2*c^2/243 - 194*a^3*b*c^3/729 + 163*a^3*c^4/729 + 23*a^2*b^5/243 - 41*a^2*b^4*c/243 - 22*a^2*b^3*c^2/243 - 22*a^2*b^2*c^3/243 - 41*a^2*b*c^4/243 + 23*a^2*c^5/243 + 20*a*b^6/729 - 2*a*b^5*c/243 - 41*a*b^4*c^2/243 - 194*a*b^3*c^3/729 - 41*a*b^2*c^4/243 - 2*a*b*c^5/243 + 20*a*c^6/729 + 8*b^7/729 + 20*b^6*c/729 + 23*b^5*c^2/243 + 163*b^4*c^3/729 + 163*b^3*c^4/729 + 23*b^2*c^5/243 + 20*b*c^6/729 + 8*c^7/729) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux0 a c b (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux0 b a c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c b a (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (2*a^3*b^2*c^2 + 2*a^3*b^2 + 2*a^3*c^2 + 2*a^3 + 2*a^2*b^3*c^2 + 2*a^2*b^3 + 2*a^2*b^2*c^3 - 3*a^2*b^2*c^2 - 3*a^2*b^2 + 2*a^2*c^3 - 3*a^2*c^2 - 3*a^2 + 2*b^3*c^2 + 2*b^3 + 2*b^2*c^3 - 3*b^2*c^2 - 3*b^2 + 2*c^3 - 3*c^2 - 3) = (8*a^7/729 + 20*a^6*b/729 + 20*a^6*c/729 + 23*a^5*b^2/243 - 2*a^5*b*c/243 + 23*a^5*c^2/243 + 163*a^4*b^3/729 - 41*a^4*b^2*c/243 - 41*a^4*b*c^2/243 + 163*a^4*c^3/729 + 163*a^3*b^4/729 - 194*a^3*b^3*c/729 - 22*a^3*b^2*c^2/243 - 194*a^3*b*c^3/729 + 163*a^3*c^4/729 + 23*a^2*b^5/243 - 41*a^2*b^4*c/243 - 22*a^2*b^3*c^2/243 - 22*a^2*b^2*c^3/243 - 41*a^2*b*c^4/243 + 23*a^2*c^5/243 + 20*a*b^6/729 - 2*a*b^5*c/243 - 41*a*b^4*c^2/243 - 194*a*b^3*c^3/729 - 41*a*b^2*c^4/243 - 2*a*b*c^5/243 + 20*a*c^6/729 + 8*b^7/729 + 20*b^6*c/729 + 23*b^5*c^2/243 + 163*b^4*c^3/729 + 163*b^3*c^4/729 + 23*b^2*c^5/243 + 20*b*c^6/729 + 8*c^7/729) := by
    linear_combination (-8*a^6/729 - 4*a^5*b/243 - 4*a^5*c/243 - 8*a^5/243 - 19*a^4*b^2/243 + 10*a^4*b*c/243 - 4*a^4*b/243 - 19*a^4*c^2/243 - 4*a^4*c/243 - 8*a^4/81 - 106*a^3*b^3/729 + 50*a^3*b^2*c/243 - 53*a^3*b^2/243 + 50*a^3*b*c^2/243 + 38*a^3*b*c/243 + 4*a^3*b/81 - 106*a^3*c^3/729 - 53*a^3*c^2/243 + 4*a^3*c/81 - 8*a^3/27 - 19*a^2*b^4/243 + 50*a^2*b^3*c/243 - 53*a^2*b^3/243 + 136*a^2*b^2*c^2/81 + 55*a^2*b^2*c/81 + 35*a^2*b^2/27 + 50*a^2*b*c^3/243 + 55*a^2*b*c^2/81 + 10*a^2*b*c/27 + 4*a^2*b/9 - 19*a^2*c^4/243 - 53*a^2*c^3/243 + 35*a^2*c^2/27 + 4*a^2*c/9 + 10*a^2/9 - 4*a*b^5/243 + 10*a*b^4*c/243 - 4*a*b^4/243 + 50*a*b^3*c^2/243 + 38*a*b^3*c/243 + 4*a*b^3/81 + 50*a*b^2*c^3/243 + 55*a*b^2*c^2/81 + 10*a*b^2*c/27 + 4*a*b^2/9 + 10*a*b*c^4/243 + 38*a*b*c^3/243 + 10*a*b*c^2/27 + 2*a*b*c/9 + 2*a*b/9 - 4*a*c^5/243 - 4*a*c^4/243 + 4*a*c^3/81 + 4*a*c^2/9 + 2*a*c/9 + a/3 - 8*b^6/729 - 4*b^5*c/243 - 8*b^5/243 - 19*b^4*c^2/243 - 4*b^4*c/243 - 8*b^4/81 - 106*b^3*c^3/729 - 53*b^3*c^2/243 + 4*b^3*c/81 - 8*b^3/27 - 19*b^2*c^4/243 - 53*b^2*c^3/243 + 35*b^2*c^2/27 + 4*b^2*c/9 + 10*b^2/9 - 4*b*c^5/243 - 4*b*c^4/243 + 4*b*c^3/81 + 4*b*c^2/9 + 2*b*c/9 + b/3 - 8*c^6/729 - 8*c^5/243 - 8*c^4/81 - 8*c^3/27 + 10*c^2/9 + c/3 + 1) * hab
  have hn : 0 ≤ (2*a^3*b^2*c^2 + 2*a^3*b^2 + 2*a^3*c^2 + 2*a^3 + 2*a^2*b^3*c^2 + 2*a^2*b^3 + 2*a^2*b^2*c^3 - 3*a^2*b^2*c^2 - 3*a^2*b^2 + 2*a^2*c^3 - 3*a^2*c^2 - 3*a^2 + 2*b^3*c^2 + 2*b^3 + 2*b^2*c^3 - 3*b^2*c^2 - 3*b^2 + 2*c^3 - 3*c^2 - 3) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3), a^3 / (a^2 + 1) + b^3 / (b^2 + 1) + c^3 / (c^2 + 1) ≥ 3 / 2) := @solution
#print axioms solution
