-- Prove2me | solution 1 for WorkbookSource.base_36251
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:14:22.555347+00:00
-- url     : https://prove2.me/submissions/b9073db9-f406-46aa-879d-ddc5c866b875

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) : (a / b + b / c + c / a) ^ 2 ≥ (a + b + c) * (1 / a + 1 / b + 1 / c) + (a - b) ^ 2 / (b * c + c * a + a * b)  := by
  have hp : 0 ≤ (a^5*b*c^2 + a^5*c^3 + a^4*b^3*c - a^4*b^2*c^2 + a^3*b^5 - a^3*b^3*c^2 - 3*a^3*b^2*c^3 + a^3*b*c^4 + a^2*b^5*c - a^2*b^4*c^2 - 3*a^2*b^3*c^3 + a*b^4*c^3 + a*b^2*c^5 + b^3*c^5) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (b - a) := by linarith
        have hdiff2 : 0 ≤ (c - b) := by linarith
        have hpos : 0 ≤ (11 : ℝ) * a^6 * (b - a)^2 + (12 : ℝ) * a^6 * (b - a)^1 * (c - b)^1 + (12 : ℝ) * a^6 * (c - b)^2 + (48 : ℝ) * a^5 * (b - a)^3 + (85 : ℝ) * a^5 * (b - a)^2 * (c - b)^1 + (75 : ℝ) * a^5 * (b - a)^1 * (c - b)^2 + (20 : ℝ) * a^5 * (c - b)^3 + (85 : ℝ) * a^4 * (b - a)^4 + (206 : ℝ) * a^4 * (b - a)^3 * (c - b)^1 + (207 : ℝ) * a^4 * (b - a)^2 * (c - b)^2 + (87 : ℝ) * a^4 * (b - a)^1 * (c - b)^3 + (11 : ℝ) * a^4 * (c - b)^4 + (78 : ℝ) * a^3 * (b - a)^5 + (238 : ℝ) * a^3 * (b - a)^4 * (c - b)^1 + (286 : ℝ) * a^3 * (b - a)^3 * (c - b)^2 + (158 : ℝ) * a^3 * (b - a)^2 * (c - b)^3 + (36 : ℝ) * a^3 * (b - a)^1 * (c - b)^4 + (2 : ℝ) * a^3 * (c - b)^5 + (39 : ℝ) * a^2 * (b - a)^6 + (143 : ℝ) * a^2 * (b - a)^5 * (c - b)^1 + (205 : ℝ) * a^2 * (b - a)^4 * (c - b)^2 + (141 : ℝ) * a^2 * (b - a)^3 * (c - b)^3 + (45 : ℝ) * a^2 * (b - a)^2 * (c - b)^4 + (5 : ℝ) * a^2 * (b - a)^1 * (c - b)^5 + (10 : ℝ) * a^1 * (b - a)^7 + (43 : ℝ) * a^1 * (b - a)^6 * (c - b)^1 + (73 : ℝ) * a^1 * (b - a)^5 * (c - b)^2 + (61 : ℝ) * a^1 * (b - a)^4 * (c - b)^3 + (25 : ℝ) * a^1 * (b - a)^3 * (c - b)^4 + (4 : ℝ) * a^1 * (b - a)^2 * (c - b)^5 + (1 : ℝ) * (b - a)^8 + (5 : ℝ) * (b - a)^7 * (c - b)^1 + (10 : ℝ) * (b - a)^6 * (c - b)^2 + (10 : ℝ) * (b - a)^5 * (c - b)^3 + (5 : ℝ) * (b - a)^4 * (c - b)^4 + (1 : ℝ) * (b - a)^3 * (c - b)^5 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - a) := by linarith
          have hdiff2 : 0 ≤ (b - c) := by linarith
          have hpos : 0 ≤ (11 : ℝ) * a^6 * (c - a)^2 + (10 : ℝ) * a^6 * (c - a)^1 * (b - c)^1 + (11 : ℝ) * a^6 * (b - c)^2 + (48 : ℝ) * a^5 * (c - a)^3 + (59 : ℝ) * a^5 * (c - a)^2 * (b - c)^1 + (49 : ℝ) * a^5 * (c - a)^1 * (b - c)^2 + (18 : ℝ) * a^5 * (b - c)^3 + (85 : ℝ) * a^4 * (c - a)^4 + (134 : ℝ) * a^4 * (c - a)^3 * (b - c)^1 + (99 : ℝ) * a^4 * (c - a)^2 * (b - c)^2 + (49 : ℝ) * a^4 * (c - a)^1 * (b - c)^3 + (10 : ℝ) * a^4 * (b - c)^4 + (78 : ℝ) * a^3 * (c - a)^5 + (152 : ℝ) * a^3 * (c - a)^4 * (b - c)^1 + (114 : ℝ) * a^3 * (c - a)^3 * (b - c)^2 + (52 : ℝ) * a^3 * (c - a)^2 * (b - c)^3 + (16 : ℝ) * a^3 * (c - a)^1 * (b - c)^4 + (2 : ℝ) * a^3 * (b - c)^5 + (39 : ℝ) * a^2 * (c - a)^6 + (91 : ℝ) * a^2 * (c - a)^5 * (b - c)^1 + (75 : ℝ) * a^2 * (c - a)^4 * (b - c)^2 + (29 : ℝ) * a^2 * (c - a)^3 * (b - c)^3 + (7 : ℝ) * a^2 * (c - a)^2 * (b - c)^4 + (1 : ℝ) * a^2 * (c - a)^1 * (b - c)^5 + (10 : ℝ) * a^1 * (c - a)^7 + (27 : ℝ) * a^1 * (c - a)^6 * (b - c)^1 + (25 : ℝ) * a^1 * (c - a)^5 * (b - c)^2 + (9 : ℝ) * a^1 * (c - a)^4 * (b - c)^3 + (1 : ℝ) * a^1 * (c - a)^3 * (b - c)^4 + (1 : ℝ) * (c - a)^8 + (3 : ℝ) * (c - a)^7 * (b - c)^1 + (3 : ℝ) * (c - a)^6 * (b - c)^2 + (1 : ℝ) * (c - a)^5 * (b - c)^3 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (a - c) := by linarith
          have hdiff2 : 0 ≤ (b - a) := by linarith
          have hpos : 0 ≤ (12 : ℝ) * c^6 * (a - c)^2 + (12 : ℝ) * c^6 * (a - c)^1 * (b - a)^1 + (11 : ℝ) * c^6 * (b - a)^2 + (52 : ℝ) * c^5 * (a - c)^3 + (87 : ℝ) * c^5 * (a - c)^2 * (b - a)^1 + (71 : ℝ) * c^5 * (a - c)^1 * (b - a)^2 + (18 : ℝ) * c^5 * (b - a)^3 + (91 : ℝ) * c^4 * (a - c)^4 + (212 : ℝ) * c^4 * (a - c)^3 * (b - a)^1 + (202 : ℝ) * c^4 * (a - c)^2 * (b - a)^2 + (81 : ℝ) * c^4 * (a - c)^1 * (b - a)^3 + (10 : ℝ) * c^4 * (b - a)^4 + (82 : ℝ) * c^3 * (a - c)^5 + (244 : ℝ) * c^3 * (a - c)^4 * (b - a)^1 + (284 : ℝ) * c^3 * (a - c)^3 * (b - a)^2 + (152 : ℝ) * c^3 * (a - c)^2 * (b - a)^3 + (34 : ℝ) * c^3 * (a - c)^1 * (b - a)^4 + (2 : ℝ) * c^3 * (b - a)^5 + (40 : ℝ) * c^2 * (a - c)^6 + (145 : ℝ) * c^2 * (a - c)^5 * (b - a)^1 + (205 : ℝ) * c^2 * (a - c)^4 * (b - a)^2 + (139 : ℝ) * c^2 * (a - c)^3 * (b - a)^3 + (44 : ℝ) * c^2 * (a - c)^2 * (b - a)^4 + (5 : ℝ) * c^2 * (a - c)^1 * (b - a)^5 + (10 : ℝ) * c^1 * (a - c)^7 + (43 : ℝ) * c^1 * (a - c)^6 * (b - a)^1 + (73 : ℝ) * c^1 * (a - c)^5 * (b - a)^2 + (61 : ℝ) * c^1 * (a - c)^4 * (b - a)^3 + (25 : ℝ) * c^1 * (a - c)^3 * (b - a)^4 + (4 : ℝ) * c^1 * (a - c)^2 * (b - a)^5 + (1 : ℝ) * (a - c)^8 + (5 : ℝ) * (a - c)^7 * (b - a)^1 + (10 : ℝ) * (a - c)^6 * (b - a)^2 + (10 : ℝ) * (a - c)^5 * (b - a)^3 + (5 : ℝ) * (a - c)^4 * (b - a)^4 + (1 : ℝ) * (a - c)^3 * (b - a)^5 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (a - b) := by linarith
        have hdiff2 : 0 ≤ (c - a) := by linarith
        have hpos : 0 ≤ (11 : ℝ) * b^6 * (a - b)^2 + (12 : ℝ) * b^6 * (a - b)^1 * (c - a)^1 + (12 : ℝ) * b^6 * (c - a)^2 + (48 : ℝ) * b^5 * (a - b)^3 + (67 : ℝ) * b^5 * (a - b)^2 * (c - a)^1 + (57 : ℝ) * b^5 * (a - b)^1 * (c - a)^2 + (20 : ℝ) * b^5 * (c - a)^3 + (85 : ℝ) * b^4 * (a - b)^4 + (146 : ℝ) * b^4 * (a - b)^3 * (c - a)^1 + (117 : ℝ) * b^4 * (a - b)^2 * (c - a)^2 + (57 : ℝ) * b^4 * (a - b)^1 * (c - a)^3 + (11 : ℝ) * b^4 * (c - a)^4 + (78 : ℝ) * b^3 * (a - b)^5 + (160 : ℝ) * b^3 * (a - b)^4 * (c - a)^1 + (130 : ℝ) * b^3 * (a - b)^3 * (c - a)^2 + (62 : ℝ) * b^3 * (a - b)^2 * (c - a)^3 + (18 : ℝ) * b^3 * (a - b)^1 * (c - a)^4 + (2 : ℝ) * b^3 * (c - a)^5 + (39 : ℝ) * b^2 * (a - b)^6 + (93 : ℝ) * b^2 * (a - b)^5 * (c - a)^1 + (80 : ℝ) * b^2 * (a - b)^4 * (c - a)^2 + (33 : ℝ) * b^2 * (a - b)^3 * (c - a)^3 + (8 : ℝ) * b^2 * (a - b)^2 * (c - a)^4 + (1 : ℝ) * b^2 * (a - b)^1 * (c - a)^5 + (10 : ℝ) * b^1 * (a - b)^7 + (27 : ℝ) * b^1 * (a - b)^6 * (c - a)^1 + (25 : ℝ) * b^1 * (a - b)^5 * (c - a)^2 + (9 : ℝ) * b^1 * (a - b)^4 * (c - a)^3 + (1 : ℝ) * b^1 * (a - b)^3 * (c - a)^4 + (1 : ℝ) * (a - b)^8 + (3 : ℝ) * (a - b)^7 * (c - a)^1 + (3 : ℝ) * (a - b)^6 * (c - a)^2 + (1 : ℝ) * (a - b)^5 * (c - a)^3 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - b) := by linarith
          have hdiff2 : 0 ≤ (a - c) := by linarith
          have hpos : 0 ≤ (11 : ℝ) * b^6 * (c - b)^2 + (10 : ℝ) * b^6 * (c - b)^1 * (a - c)^1 + (11 : ℝ) * b^6 * (a - c)^2 + (48 : ℝ) * b^5 * (c - b)^3 + (77 : ℝ) * b^5 * (c - b)^2 * (a - c)^1 + (67 : ℝ) * b^5 * (c - b)^1 * (a - c)^2 + (18 : ℝ) * b^5 * (a - c)^3 + (85 : ℝ) * b^4 * (c - b)^4 + (194 : ℝ) * b^4 * (c - b)^3 * (a - c)^1 + (189 : ℝ) * b^4 * (c - b)^2 * (a - c)^2 + (79 : ℝ) * b^4 * (c - b)^1 * (a - c)^3 + (10 : ℝ) * b^4 * (a - c)^4 + (78 : ℝ) * b^3 * (c - b)^5 + (230 : ℝ) * b^3 * (c - b)^4 * (a - c)^1 + (270 : ℝ) * b^3 * (c - b)^3 * (a - c)^2 + (148 : ℝ) * b^3 * (c - b)^2 * (a - c)^3 + (34 : ℝ) * b^3 * (c - b)^1 * (a - c)^4 + (2 : ℝ) * b^3 * (a - c)^5 + (39 : ℝ) * b^2 * (c - b)^6 + (141 : ℝ) * b^2 * (c - b)^5 * (a - c)^1 + (200 : ℝ) * b^2 * (c - b)^4 * (a - c)^2 + (137 : ℝ) * b^2 * (c - b)^3 * (a - c)^3 + (44 : ℝ) * b^2 * (c - b)^2 * (a - c)^4 + (5 : ℝ) * b^2 * (c - b)^1 * (a - c)^5 + (10 : ℝ) * b^1 * (c - b)^7 + (43 : ℝ) * b^1 * (c - b)^6 * (a - c)^1 + (73 : ℝ) * b^1 * (c - b)^5 * (a - c)^2 + (61 : ℝ) * b^1 * (c - b)^4 * (a - c)^3 + (25 : ℝ) * b^1 * (c - b)^3 * (a - c)^4 + (4 : ℝ) * b^1 * (c - b)^2 * (a - c)^5 + (1 : ℝ) * (c - b)^8 + (5 : ℝ) * (c - b)^7 * (a - c)^1 + (10 : ℝ) * (c - b)^6 * (a - c)^2 + (10 : ℝ) * (c - b)^5 * (a - c)^3 + (5 : ℝ) * (c - b)^4 * (a - c)^4 + (1 : ℝ) * (c - b)^3 * (a - c)^5 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (b - c) := by linarith
          have hdiff2 : 0 ≤ (a - b) := by linarith
          have hpos : 0 ≤ (12 : ℝ) * c^6 * (b - c)^2 + (12 : ℝ) * c^6 * (b - c)^1 * (a - b)^1 + (11 : ℝ) * c^6 * (a - b)^2 + (52 : ℝ) * c^5 * (b - c)^3 + (69 : ℝ) * c^5 * (b - c)^2 * (a - b)^1 + (53 : ℝ) * c^5 * (b - c)^1 * (a - b)^2 + (18 : ℝ) * c^5 * (a - b)^3 + (91 : ℝ) * c^4 * (b - c)^4 + (152 : ℝ) * c^4 * (b - c)^3 * (a - b)^1 + (112 : ℝ) * c^4 * (b - c)^2 * (a - b)^2 + (51 : ℝ) * c^4 * (b - c)^1 * (a - b)^3 + (10 : ℝ) * c^4 * (a - b)^4 + (82 : ℝ) * c^3 * (b - c)^5 + (166 : ℝ) * c^3 * (b - c)^4 * (a - b)^1 + (128 : ℝ) * c^3 * (b - c)^3 * (a - b)^2 + (56 : ℝ) * c^3 * (b - c)^2 * (a - b)^3 + (16 : ℝ) * c^3 * (b - c)^1 * (a - b)^4 + (2 : ℝ) * c^3 * (a - b)^5 + (40 : ℝ) * c^2 * (b - c)^6 + (95 : ℝ) * c^2 * (b - c)^5 * (a - b)^1 + (80 : ℝ) * c^2 * (b - c)^4 * (a - b)^2 + (31 : ℝ) * c^2 * (b - c)^3 * (a - b)^3 + (7 : ℝ) * c^2 * (b - c)^2 * (a - b)^4 + (1 : ℝ) * c^2 * (b - c)^1 * (a - b)^5 + (10 : ℝ) * c^1 * (b - c)^7 + (27 : ℝ) * c^1 * (b - c)^6 * (a - b)^1 + (25 : ℝ) * c^1 * (b - c)^5 * (a - b)^2 + (9 : ℝ) * c^1 * (b - c)^4 * (a - b)^3 + (1 : ℝ) * c^1 * (b - c)^3 * (a - b)^4 + (1 : ℝ) * (b - c)^8 + (3 : ℝ) * (b - c)^7 * (a - b)^1 + (3 : ℝ) * (b - c)^6 * (a - b)^2 + (1 : ℝ) * (b - c)^5 * (a - b)^3 := by positivity
          convert hpos using 1 <;> ring
  have hn : 0 ≤ (a^5*b*c^2 + a^5*c^3 + a^4*b^3*c - a^4*b^2*c^2 + a^3*b^5 - a^3*b^3*c^2 - 3*a^3*b^2*c^3 + a^3*b*c^4 + a^2*b^5*c - a^2*b^4*c^2 - 3*a^2*b^3*c^3 + a*b^4*c^3 + a*b^2*c^5 + b^3*c^5) := by nlinarith only [hp]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c), (a / b + b / c + c / a) ^ 2 ≥ (a + b + c) * (1 / a + 1 / b + 1 / c) + (a - b) ^ 2 / (b * c + c * a + a * b)) := @solution
#print axioms solution
