-- Prove2me | solution 1 for WorkbookSource.base_46110
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:01:55.243686+00:00
-- url     : https://prove2.me/submissions/388cd67d-b84d-4cb7-bae8-2cf10e9b586b

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 6) : (a + 1 / b) ^ 2 + (b + 1 / c) ^ 2 + (c + 1 / a) ^ 2 ≥ 75 / 4  := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (a^6*b^2/324 + a^6*c^2/324 + a^5*b^3/81 + a^5*b^2*c/81 + 19*a^5*b*c^2/81 + a^5*c^3/81 + a^4*b^4/54 + 7*a^4*b^3*c/27 + 389*a^4*b^2*c^2/162 + 13*a^4*b*c^3/27 + a^4*c^4/54 + a^3*b^5/81 + 13*a^3*b^4*c/27 - 557*a^3*b^3*c^2/162 - 557*a^3*b^2*c^3/162 + 7*a^3*b*c^4/27 + a^3*c^5/81 + a^2*b^6/324 + 19*a^2*b^5*c/81 + 389*a^2*b^4*c^2/162 - 557*a^2*b^3*c^3/162 + 389*a^2*b^2*c^4/162 + a^2*b*c^5/81 + a^2*c^6/324 + a*b^5*c^2/81 + 7*a*b^4*c^3/27 + 13*a*b^3*c^4/27 + 19*a*b^2*c^5/81 + b^6*c^2/324 + b^5*c^3/81 + b^4*c^4/54 + b^3*c^5/81 + b^2*c^6/324) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (31/6 : ℝ) * a^6 * (b - a)^2 + (31/6 : ℝ) * a^6 * (b - a)^1 * (c - b)^1 + (31/6 : ℝ) * a^6 * (c - b)^2 + (194/9 : ℝ) * a^5 * (b - a)^3 + (100/3 : ℝ) * a^5 * (b - a)^2 * (c - b)^1 + (92/3 : ℝ) * a^5 * (b - a)^1 * (c - b)^2 + (85/9 : ℝ) * a^5 * (c - b)^3 + (1885/54 : ℝ) * a^4 * (b - a)^4 + (1975/27 : ℝ) * a^4 * (b - a)^3 * (c - b)^1 + (655/9 : ℝ) * a^4 * (b - a)^2 * (c - b)^2 + (1865/54 : ℝ) * a^4 * (b - a)^1 * (c - b)^3 + (125/27 : ℝ) * a^4 * (c - b)^4 + (2195/81 : ℝ) * a^3 * (b - a)^5 + (11641/162 : ℝ) * a^3 * (b - a)^4 * (c - b)^1 + (6581/81 : ℝ) * a^3 * (b - a)^3 * (c - b)^2 + (3781/81 : ℝ) * a^3 * (b - a)^2 * (c - b)^3 + (1751/162 : ℝ) * a^3 * (b - a)^1 * (c - b)^4 + (25/81 : ℝ) * a^3 * (c - b)^5 + (803/81 : ℝ) * a^2 * (b - a)^6 + (863/27 : ℝ) * a^2 * (b - a)^5 * (c - b)^1 + (4493/108 : ℝ) * a^2 * (b - a)^4 * (c - b)^2 + (4405/162 : ℝ) * a^2 * (b - a)^3 * (c - b)^3 + (889/108 : ℝ) * a^2 * (b - a)^2 * (c - b)^4 + (16/27 : ℝ) * a^2 * (b - a)^1 * (c - b)^5 + (1/162 : ℝ) * a^2 * (c - b)^6 + (112/81 : ℝ) * a^1 * (b - a)^7 + (428/81 : ℝ) * a^1 * (b - a)^6 * (c - b)^1 + (644/81 : ℝ) * a^1 * (b - a)^5 * (c - b)^2 + (53/9 : ℝ) * a^1 * (b - a)^4 * (c - b)^3 + (175/81 : ℝ) * a^1 * (b - a)^3 * (c - b)^4 + (53/162 : ℝ) * a^1 * (b - a)^2 * (c - b)^5 + (1/162 : ℝ) * a^1 * (b - a)^1 * (c - b)^6 + (4/81 : ℝ) * (b - a)^8 + (16/81 : ℝ) * (b - a)^7 * (c - b)^1 + (26/81 : ℝ) * (b - a)^6 * (c - b)^2 + (22/81 : ℝ) * (b - a)^5 * (c - b)^3 + (41/324 : ℝ) * (b - a)^4 * (c - b)^4 + (5/162 : ℝ) * (b - a)^3 * (c - b)^5 + (1/324 : ℝ) * (b - a)^2 * (c - b)^6 := by positivity
    convert hpos using 1 <;> ring
  have haux1 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ c) (hord2 : c ≤ b) : 0 ≤ (a^6*b^2/324 + a^6*c^2/324 + a^5*b^3/81 + a^5*b^2*c/81 + 19*a^5*b*c^2/81 + a^5*c^3/81 + a^4*b^4/54 + 7*a^4*b^3*c/27 + 389*a^4*b^2*c^2/162 + 13*a^4*b*c^3/27 + a^4*c^4/54 + a^3*b^5/81 + 13*a^3*b^4*c/27 - 557*a^3*b^3*c^2/162 - 557*a^3*b^2*c^3/162 + 7*a^3*b*c^4/27 + a^3*c^5/81 + a^2*b^6/324 + 19*a^2*b^5*c/81 + 389*a^2*b^4*c^2/162 - 557*a^2*b^3*c^3/162 + 389*a^2*b^2*c^4/162 + a^2*b*c^5/81 + a^2*c^6/324 + a*b^5*c^2/81 + 7*a*b^4*c^3/27 + 13*a*b^3*c^4/27 + 19*a*b^2*c^5/81 + b^6*c^2/324 + b^5*c^3/81 + b^4*c^4/54 + b^3*c^5/81 + b^2*c^6/324) := by
    have hdiff1 : 0 ≤ (c - a) := by linarith
    have hdiff2 : 0 ≤ (b - c) := by linarith
    have hpos : 0 ≤ (31/6 : ℝ) * a^6 * (c - a)^2 + (31/6 : ℝ) * a^6 * (c - a)^1 * (b - c)^1 + (31/6 : ℝ) * a^6 * (b - c)^2 + (194/9 : ℝ) * a^5 * (c - a)^3 + (94/3 : ℝ) * a^5 * (c - a)^2 * (b - c)^1 + (86/3 : ℝ) * a^5 * (c - a)^1 * (b - c)^2 + (85/9 : ℝ) * a^5 * (b - c)^3 + (1885/54 : ℝ) * a^4 * (c - a)^4 + (1795/27 : ℝ) * a^4 * (c - a)^3 * (b - c)^1 + (565/9 : ℝ) * a^4 * (c - a)^2 * (b - c)^2 + (1685/54 : ℝ) * a^4 * (c - a)^1 * (b - c)^3 + (125/27 : ℝ) * a^4 * (b - c)^4 + (2195/81 : ℝ) * a^3 * (c - a)^5 + (10309/162 : ℝ) * a^3 * (c - a)^4 * (b - c)^1 + (5249/81 : ℝ) * a^3 * (c - a)^3 * (b - c)^2 + (2989/81 : ℝ) * a^3 * (c - a)^2 * (b - c)^3 + (1499/162 : ℝ) * a^3 * (c - a)^1 * (b - c)^4 + (25/81 : ℝ) * a^3 * (b - c)^5 + (803/81 : ℝ) * a^2 * (c - a)^6 + (743/27 : ℝ) * a^2 * (c - a)^5 * (b - c)^1 + (3293/108 : ℝ) * a^2 * (c - a)^4 * (b - c)^2 + (2893/162 : ℝ) * a^2 * (c - a)^3 * (b - c)^3 + (577/108 : ℝ) * a^2 * (c - a)^2 * (b - c)^4 + (10/27 : ℝ) * a^2 * (c - a)^1 * (b - c)^5 + (1/162 : ℝ) * a^2 * (b - c)^6 + (112/81 : ℝ) * a^1 * (c - a)^7 + (356/81 : ℝ) * a^1 * (c - a)^6 * (b - c)^1 + (428/81 : ℝ) * a^1 * (c - a)^5 * (b - c)^2 + (3 : ℝ) * a^1 * (c - a)^4 * (b - c)^3 + (67/81 : ℝ) * a^1 * (c - a)^3 * (b - c)^4 + (17/162 : ℝ) * a^1 * (c - a)^2 * (b - c)^5 + (1/162 : ℝ) * a^1 * (c - a)^1 * (b - c)^6 + (4/81 : ℝ) * (c - a)^8 + (16/81 : ℝ) * (c - a)^7 * (b - c)^1 + (26/81 : ℝ) * (c - a)^6 * (b - c)^2 + (22/81 : ℝ) * (c - a)^5 * (b - c)^3 + (41/324 : ℝ) * (c - a)^4 * (b - c)^4 + (5/162 : ℝ) * (c - a)^3 * (b - c)^5 + (1/324 : ℝ) * (c - a)^2 * (b - c)^6 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (a^6*b^2/324 + a^6*c^2/324 + a^5*b^3/81 + a^5*b^2*c/81 + 19*a^5*b*c^2/81 + a^5*c^3/81 + a^4*b^4/54 + 7*a^4*b^3*c/27 + 389*a^4*b^2*c^2/162 + 13*a^4*b*c^3/27 + a^4*c^4/54 + a^3*b^5/81 + 13*a^3*b^4*c/27 - 557*a^3*b^3*c^2/162 - 557*a^3*b^2*c^3/162 + 7*a^3*b*c^4/27 + a^3*c^5/81 + a^2*b^6/324 + 19*a^2*b^5*c/81 + 389*a^2*b^4*c^2/162 - 557*a^2*b^3*c^3/162 + 389*a^2*b^2*c^4/162 + a^2*b*c^5/81 + a^2*c^6/324 + a*b^5*c^2/81 + 7*a*b^4*c^3/27 + 13*a*b^3*c^4/27 + 19*a*b^2*c^5/81 + b^6*c^2/324 + b^5*c^3/81 + b^4*c^4/54 + b^3*c^5/81 + b^2*c^6/324) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux1 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux1 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux1 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (4*a^4*b^2*c^2 + 8*a^3*b*c^2 + 4*a^2*b^4*c^2 + 8*a^2*b^3*c + 4*a^2*b^2*c^4 - 75*a^2*b^2*c^2 + 4*a^2*b^2 + 4*a^2*c^2 + 8*a*b^2*c^3 + 4*b^2*c^2) = (a^6*b^2/324 + a^6*c^2/324 + a^5*b^3/81 + a^5*b^2*c/81 + 19*a^5*b*c^2/81 + a^5*c^3/81 + a^4*b^4/54 + 7*a^4*b^3*c/27 + 389*a^4*b^2*c^2/162 + 13*a^4*b*c^3/27 + a^4*c^4/54 + a^3*b^5/81 + 13*a^3*b^4*c/27 - 557*a^3*b^3*c^2/162 - 557*a^3*b^2*c^3/162 + 7*a^3*b*c^4/27 + a^3*c^5/81 + a^2*b^6/324 + 19*a^2*b^5*c/81 + 389*a^2*b^4*c^2/162 - 557*a^2*b^3*c^3/162 + 389*a^2*b^2*c^4/162 + a^2*b*c^5/81 + a^2*c^6/324 + a*b^5*c^2/81 + 7*a*b^4*c^3/27 + 13*a*b^3*c^4/27 + 19*a*b^2*c^5/81 + b^6*c^2/324 + b^5*c^3/81 + b^4*c^4/54 + b^3*c^5/81 + b^2*c^6/324) := by
    linear_combination (-a^5*b^2/324 - a^5*c^2/324 - a^4*b^3/108 - a^4*b^2*c/108 - a^4*b^2/54 - 25*a^4*b*c^2/108 - a^4*c^3/108 - a^4*c^2/54 - a^3*b^4/108 - 13*a^3*b^3*c/54 - a^3*b^3/27 + 149*a^3*b^2*c^2/81 - a^3*b^2*c/27 - a^3*b^2/9 - 13*a^3*b*c^3/54 - 37*a^3*b*c^2/27 - a^3*c^4/108 - a^3*c^3/27 - a^3*c^2/9 - a^2*b^5/324 - 25*a^2*b^4*c/108 - a^2*b^4/54 + 149*a^2*b^3*c^2/81 - 37*a^2*b^3*c/27 - a^2*b^3/9 + 149*a^2*b^2*c^3/81 + 112*a^2*b^2*c^2/9 - a^2*b^2*c/9 - 2*a^2*b^2/3 - a^2*b*c^4/108 - a^2*b*c^3/27 - a^2*b*c^2/9 - a^2*c^5/324 - a^2*c^4/54 - a^2*c^3/9 - 2*a^2*c^2/3 - a*b^4*c^2/108 - 13*a*b^3*c^3/54 - a*b^3*c^2/27 - 25*a*b^2*c^4/108 - 37*a*b^2*c^3/27 - a*b^2*c^2/9 - b^5*c^2/324 - b^4*c^3/108 - b^4*c^2/54 - b^3*c^4/108 - b^3*c^3/27 - b^3*c^2/9 - b^2*c^5/324 - b^2*c^4/54 - b^2*c^3/9 - 2*b^2*c^2/3) * habc
  have hn : 0 ≤ (4*a^4*b^2*c^2 + 8*a^3*b*c^2 + 4*a^2*b^4*c^2 + 8*a^2*b^3*c + 4*a^2*b^2*c^4 - 75*a^2*b^2*c^2 + 4*a^2*b^2 + 4*a^2*c^2 + 8*a*b^2*c^3 + 4*b^2*c^2) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 6), (a + 1 / b) ^ 2 + (b + 1 / c) ^ 2 + (c + 1 / a) ^ 2 ≥ 75 / 4) := @solution
#print axioms solution
