-- Prove2me | solution 1 for WorkbookSource.base_55693
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:31:13.206066+00:00
-- url     : https://prove2.me/submissions/076a00f8-400b-4c87-b640-50f5934db215

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : a > 0) (hb : b > 0) (hc : c > 0) : (a^3 / (a + b)^3 + b^3 / (b + c)^3) ≥ (5 * a - c) / (8 * (a + c))  := by
  have hp : 0 ≤ (11*a^4*b^3 + 9*a^4*b^2*c + 9*a^4*b*c^2 + 3*a^4*c^3 + 9*a^3*b^4 - 28*a^3*b^3*c - 18*a^3*b^2*c^2 + 12*a^3*b*c^3 + 9*a^3*c^4 + 9*a^2*b^5 - 18*a^2*b^4*c - 36*a^2*b^3*c^2 - 6*a^2*b^2*c^3 + 3*a^2*b*c^4 + 3*a*b^6 + 12*a*b^5*c - 6*a*b^4*c^2 + 4*a*b^3*c^3 + 3*a*b^2*c^4 + 9*b^6*c + 3*b^5*c^2 + 3*b^4*c^3 + b^3*c^4) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (b - a) := by linarith
        have hdiff2 : 0 ≤ (c - b) := by linarith
        have hpos : 0 ≤ (96 : ℝ) * a^5 * (b - a)^2 + (96 : ℝ) * a^5 * (c - b)^2 + (368 : ℝ) * a^4 * (b - a)^3 + (144 : ℝ) * a^4 * (b - a)^2 * (c - b)^1 + (240 : ℝ) * a^4 * (b - a)^1 * (c - b)^2 + (80 : ℝ) * a^4 * (c - b)^3 + (544 : ℝ) * a^3 * (b - a)^4 + (424 : ℝ) * a^3 * (b - a)^3 * (c - b)^1 + (288 : ℝ) * a^3 * (b - a)^2 * (c - b)^2 + (136 : ℝ) * a^3 * (b - a)^1 * (c - b)^3 + (16 : ℝ) * a^3 * (c - b)^4 + (384 : ℝ) * a^2 * (b - a)^5 + (444 : ℝ) * a^2 * (b - a)^4 * (c - b)^1 + (240 : ℝ) * a^2 * (b - a)^3 * (c - b)^2 + (96 : ℝ) * a^2 * (b - a)^2 * (c - b)^3 + (12 : ℝ) * a^2 * (b - a)^1 * (c - b)^4 + (128 : ℝ) * a^1 * (b - a)^6 + (192 : ℝ) * a^1 * (b - a)^5 * (c - b)^1 + (114 : ℝ) * a^1 * (b - a)^4 * (c - b)^2 + (44 : ℝ) * a^1 * (b - a)^3 * (c - b)^3 + (6 : ℝ) * a^1 * (b - a)^2 * (c - b)^4 + (16 : ℝ) * (b - a)^7 + (28 : ℝ) * (b - a)^6 * (c - b)^1 + (18 : ℝ) * (b - a)^5 * (c - b)^2 + (7 : ℝ) * (b - a)^4 * (c - b)^3 + (1 : ℝ) * (b - a)^3 * (c - b)^4 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - a) := by linarith
          have hdiff2 : 0 ≤ (b - c) := by linarith
          have hpos : 0 ≤ (96 : ℝ) * a^5 * (c - a)^2 + (192 : ℝ) * a^5 * (c - a)^1 * (b - c)^1 + (192 : ℝ) * a^5 * (b - c)^2 + (368 : ℝ) * a^4 * (c - a)^3 + (960 : ℝ) * a^4 * (c - a)^2 * (b - c)^1 + (1056 : ℝ) * a^4 * (c - a)^1 * (b - c)^2 + (384 : ℝ) * a^4 * (b - c)^3 + (544 : ℝ) * a^3 * (c - a)^4 + (1752 : ℝ) * a^3 * (c - a)^3 * (b - c)^1 + (2280 : ℝ) * a^3 * (c - a)^2 * (b - c)^2 + (1344 : ℝ) * a^3 * (c - a)^1 * (b - c)^3 + (288 : ℝ) * a^3 * (b - c)^4 + (384 : ℝ) * a^2 * (c - a)^5 + (1476 : ℝ) * a^2 * (c - a)^4 * (b - c)^1 + (2304 : ℝ) * a^2 * (c - a)^3 * (b - c)^2 + (1800 : ℝ) * a^2 * (c - a)^2 * (b - c)^3 + (684 : ℝ) * a^2 * (c - a)^1 * (b - c)^4 + (96 : ℝ) * a^2 * (b - c)^5 + (128 : ℝ) * a^1 * (c - a)^6 + (576 : ℝ) * a^1 * (c - a)^5 * (b - c)^1 + (1074 : ℝ) * a^1 * (c - a)^4 * (b - c)^2 + (1052 : ℝ) * a^1 * (c - a)^3 * (b - c)^3 + (558 : ℝ) * a^1 * (c - a)^2 * (b - c)^4 + (144 : ℝ) * a^1 * (c - a)^1 * (b - c)^5 + (12 : ℝ) * a^1 * (b - c)^6 + (16 : ℝ) * (c - a)^7 + (84 : ℝ) * (c - a)^6 * (b - c)^1 + (186 : ℝ) * (c - a)^5 * (b - c)^2 + (223 : ℝ) * (c - a)^4 * (b - c)^3 + (153 : ℝ) * (c - a)^3 * (b - c)^4 + (57 : ℝ) * (c - a)^2 * (b - c)^5 + (9 : ℝ) * (c - a)^1 * (b - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (a - c) := by linarith
          have hdiff2 : 0 ≤ (b - a) := by linarith
          have hpos : 0 ≤ (96 : ℝ) * c^5 * (a - c)^2 + (192 : ℝ) * c^5 * (a - c)^1 * (b - a)^1 + (192 : ℝ) * c^5 * (b - a)^2 + (400 : ℝ) * c^4 * (a - c)^3 + (960 : ℝ) * c^4 * (a - c)^2 * (b - a)^1 + (1056 : ℝ) * c^4 * (a - c)^1 * (b - a)^2 + (384 : ℝ) * c^4 * (b - a)^3 + (656 : ℝ) * c^3 * (a - c)^4 + (1848 : ℝ) * c^3 * (a - c)^3 * (b - a)^1 + (2280 : ℝ) * c^3 * (a - c)^2 * (b - a)^2 + (1344 : ℝ) * c^3 * (a - c)^1 * (b - a)^3 + (288 : ℝ) * c^3 * (b - a)^4 + (528 : ℝ) * c^2 * (a - c)^5 + (1716 : ℝ) * c^2 * (a - c)^4 * (b - a)^1 + (2376 : ℝ) * c^2 * (a - c)^3 * (b - a)^2 + (1752 : ℝ) * c^2 * (a - c)^2 * (b - a)^3 + (660 : ℝ) * c^2 * (a - c)^1 * (b - a)^4 + (96 : ℝ) * c^2 * (b - a)^5 + (208 : ℝ) * c^1 * (a - c)^6 + (768 : ℝ) * c^1 * (a - c)^5 * (b - a)^1 + (1182 : ℝ) * c^1 * (a - c)^4 * (b - a)^2 + (988 : ℝ) * c^1 * (a - c)^3 * (b - a)^3 + (474 : ℝ) * c^1 * (a - c)^2 * (b - a)^4 + (120 : ℝ) * c^1 * (a - c)^1 * (b - a)^5 + (12 : ℝ) * c^1 * (b - a)^6 + (32 : ℝ) * (a - c)^7 + (132 : ℝ) * (a - c)^6 * (b - a)^1 + (222 : ℝ) * (a - c)^5 * (b - a)^2 + (197 : ℝ) * (a - c)^4 * (b - a)^3 + (99 : ℝ) * (a - c)^3 * (b - a)^4 + (27 : ℝ) * (a - c)^2 * (b - a)^5 + (3 : ℝ) * (a - c)^1 * (b - a)^6 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (a - b) := by linarith
        have hdiff2 : 0 ≤ (c - a) := by linarith
        have hpos : 0 ≤ (192 : ℝ) * b^5 * (a - b)^2 + (192 : ℝ) * b^5 * (a - b)^1 * (c - a)^1 + (96 : ℝ) * b^5 * (c - a)^2 + (576 : ℝ) * b^4 * (a - b)^3 + (864 : ℝ) * b^4 * (a - b)^2 * (c - a)^1 + (480 : ℝ) * b^4 * (a - b)^1 * (c - a)^2 + (80 : ℝ) * b^4 * (c - a)^3 + (672 : ℝ) * b^3 * (a - b)^4 + (1344 : ℝ) * b^3 * (a - b)^3 * (c - a)^1 + (936 : ℝ) * b^3 * (a - b)^2 * (c - a)^2 + (248 : ℝ) * b^3 * (a - b)^1 * (c - a)^3 + (16 : ℝ) * b^3 * (c - a)^4 + (384 : ℝ) * b^2 * (a - b)^5 + (972 : ℝ) * b^2 * (a - b)^4 * (c - a)^1 + (864 : ℝ) * b^2 * (a - b)^3 * (c - a)^2 + (312 : ℝ) * b^2 * (a - b)^2 * (c - a)^3 + (36 : ℝ) * b^2 * (a - b)^1 * (c - a)^4 + (108 : ℝ) * b^1 * (a - b)^6 + (336 : ℝ) * b^1 * (a - b)^5 * (c - a)^1 + (378 : ℝ) * b^1 * (a - b)^4 * (c - a)^2 + (180 : ℝ) * b^1 * (a - b)^3 * (c - a)^3 + (30 : ℝ) * b^1 * (a - b)^2 * (c - a)^4 + (12 : ℝ) * (a - b)^7 + (45 : ℝ) * (a - b)^6 * (c - a)^1 + (63 : ℝ) * (a - b)^5 * (c - a)^2 + (39 : ℝ) * (a - b)^4 * (c - a)^3 + (9 : ℝ) * (a - b)^3 * (c - a)^4 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - b) := by linarith
          have hdiff2 : 0 ≤ (a - c) := by linarith
          have hpos : 0 ≤ (192 : ℝ) * b^5 * (c - b)^2 + (192 : ℝ) * b^5 * (c - b)^1 * (a - c)^1 + (96 : ℝ) * b^5 * (a - c)^2 + (576 : ℝ) * b^4 * (c - b)^3 + (864 : ℝ) * b^4 * (c - b)^2 * (a - c)^1 + (480 : ℝ) * b^4 * (c - b)^1 * (a - c)^2 + (112 : ℝ) * b^4 * (a - c)^3 + (672 : ℝ) * b^3 * (c - b)^4 + (1344 : ℝ) * b^3 * (c - b)^3 * (a - c)^1 + (936 : ℝ) * b^3 * (c - b)^2 * (a - c)^2 + (280 : ℝ) * b^3 * (c - b)^1 * (a - c)^3 + (32 : ℝ) * b^3 * (a - c)^4 + (384 : ℝ) * b^2 * (c - b)^5 + (948 : ℝ) * b^2 * (c - b)^4 * (a - c)^1 + (816 : ℝ) * b^2 * (c - b)^3 * (a - c)^2 + (288 : ℝ) * b^2 * (c - b)^2 * (a - c)^3 + (36 : ℝ) * b^2 * (c - b)^1 * (a - c)^4 + (108 : ℝ) * b^1 * (c - b)^6 + (312 : ℝ) * b^1 * (c - b)^5 * (a - c)^1 + (318 : ℝ) * b^1 * (c - b)^4 * (a - c)^2 + (132 : ℝ) * b^1 * (c - b)^3 * (a - c)^3 + (18 : ℝ) * b^1 * (c - b)^2 * (a - c)^4 + (12 : ℝ) * (c - b)^7 + (39 : ℝ) * (c - b)^6 * (a - c)^1 + (45 : ℝ) * (c - b)^5 * (a - c)^2 + (21 : ℝ) * (c - b)^4 * (a - c)^3 + (3 : ℝ) * (c - b)^3 * (a - c)^4 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (b - c) := by linarith
          have hdiff2 : 0 ≤ (a - b) := by linarith
          have hpos : 0 ≤ (96 : ℝ) * c^5 * (b - c)^2 + (96 : ℝ) * c^5 * (a - b)^2 + (400 : ℝ) * c^4 * (b - c)^3 + (240 : ℝ) * c^4 * (b - c)^2 * (a - b)^1 + (336 : ℝ) * c^4 * (b - c)^1 * (a - b)^2 + (112 : ℝ) * c^4 * (a - b)^3 + (656 : ℝ) * c^3 * (b - c)^4 + (776 : ℝ) * c^3 * (b - c)^3 * (a - b)^1 + (672 : ℝ) * c^3 * (b - c)^2 * (a - b)^2 + (296 : ℝ) * c^3 * (b - c)^1 * (a - b)^3 + (32 : ℝ) * c^3 * (a - b)^4 + (528 : ℝ) * c^2 * (b - c)^5 + (924 : ℝ) * c^2 * (b - c)^4 * (a - b)^1 + (792 : ℝ) * c^2 * (b - c)^3 * (a - b)^2 + (360 : ℝ) * c^2 * (b - c)^2 * (a - b)^3 + (60 : ℝ) * c^2 * (b - c)^1 * (a - b)^4 + (208 : ℝ) * c^1 * (b - c)^6 + (480 : ℝ) * c^1 * (b - c)^5 * (a - b)^1 + (462 : ℝ) * c^1 * (b - c)^4 * (a - b)^2 + (220 : ℝ) * c^1 * (b - c)^3 * (a - b)^3 + (42 : ℝ) * c^1 * (b - c)^2 * (a - b)^4 + (32 : ℝ) * (b - c)^7 + (92 : ℝ) * (b - c)^6 * (a - b)^1 + (102 : ℝ) * (b - c)^5 * (a - b)^2 + (53 : ℝ) * (b - c)^4 * (a - b)^3 + (11 : ℝ) * (b - c)^3 * (a - b)^4 := by positivity
          convert hpos using 1 <;> ring
  have hn : 0 ≤ (11*a^4*b^3 + 9*a^4*b^2*c + 9*a^4*b*c^2 + 3*a^4*c^3 + 9*a^3*b^4 - 28*a^3*b^3*c - 18*a^3*b^2*c^2 + 12*a^3*b*c^3 + 9*a^3*c^4 + 9*a^2*b^5 - 18*a^2*b^4*c - 36*a^2*b^3*c^2 - 6*a^2*b^2*c^3 + 3*a^2*b*c^4 + 3*a*b^6 + 12*a*b^5*c - 6*a*b^4*c^2 + 4*a*b^3*c^3 + 3*a*b^2*c^4 + 9*b^6*c + 3*b^5*c^2 + 3*b^4*c^3 + b^3*c^4) := by nlinarith only [hp]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : a > 0) (hb : b > 0) (hc : c > 0), (a^3 / (a + b)^3 + b^3 / (b + c)^3) ≥ (5 * a - c) / (8 * (a + c))) := @solution
#print axioms solution
