-- Prove2me | solution 1 for WorkbookSource.base_9324
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T00:16:38.170985+00:00
-- url     : https://prove2.me/submissions/17ef8624-cb81-40ff-aa01-5c95373f625f

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 ≤ a) (hb : 0 ≤ b) (hc : 0 ≤ c) (hab : a + b + c = 2) : (a + b - a * b) * (b + c - b * c) * (c + a - c * a) ≤ 1  := by
  have hp : 0 ≤ (a^6/64 - a^5*b/32 - a^5*c/32 - a^4*b^2/64 + 7*a^4*b*c/32 - a^4*c^2/64 + a^3*b^3/16 + 5*a^3*b^2*c/16 + 5*a^3*b*c^2/16 + a^3*c^3/16 - a^2*b^4/64 + 5*a^2*b^3*c/16 + 29*a^2*b^2*c^2/32 + 5*a^2*b*c^3/16 - a^2*c^4/64 - a*b^5/32 + 7*a*b^4*c/32 + 5*a*b^3*c^2/16 + 5*a*b^2*c^3/16 + 7*a*b*c^4/32 - a*c^5/32 + b^6/64 - b^5*c/32 - b^4*c^2/64 + b^3*c^3/16 - b^2*c^4/64 - b*c^5/32 + c^6/64) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (b - a) := by linarith
        have hdiff2 : 0 ≤ (c - b) := by linarith
        have hpos : 0 ≤ (217/64 : ℝ) * a^6 + (217/16 : ℝ) * a^5 * (b - a)^1 + (217/32 : ℝ) * a^5 * (c - b)^1 + (343/16 : ℝ) * a^4 * (b - a)^2 + (343/16 : ℝ) * a^4 * (b - a)^1 * (c - b)^1 + (287/64 : ℝ) * a^4 * (c - b)^2 + (67/4 : ℝ) * a^3 * (b - a)^3 + (201/8 : ℝ) * a^3 * (b - a)^2 * (c - b)^1 + (43/4 : ℝ) * a^3 * (b - a)^1 * (c - b)^2 + (19/16 : ℝ) * a^3 * (c - b)^3 + (13/2 : ℝ) * a^2 * (b - a)^4 + (13 : ℝ) * a^2 * (b - a)^3 * (c - b)^1 + (17/2 : ℝ) * a^2 * (b - a)^2 * (c - b)^2 + (2 : ℝ) * a^2 * (b - a)^1 * (c - b)^3 + (7/64 : ℝ) * a^2 * (c - b)^4 + (1 : ℝ) * a^1 * (b - a)^5 + (5/2 : ℝ) * a^1 * (b - a)^4 * (c - b)^1 + (9/4 : ℝ) * a^1 * (b - a)^3 * (c - b)^2 + (7/8 : ℝ) * a^1 * (b - a)^2 * (c - b)^3 + (3/16 : ℝ) * a^1 * (b - a)^1 * (c - b)^4 + (1/32 : ℝ) * a^1 * (c - b)^5 + (1/16 : ℝ) * (b - a)^2 * (c - b)^4 + (1/16 : ℝ) * (b - a)^1 * (c - b)^5 + (1/64 : ℝ) * (c - b)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - a) := by linarith
          have hdiff2 : 0 ≤ (b - c) := by linarith
          have hpos : 0 ≤ (217/64 : ℝ) * a^6 + (217/16 : ℝ) * a^5 * (c - a)^1 + (217/32 : ℝ) * a^5 * (b - c)^1 + (343/16 : ℝ) * a^4 * (c - a)^2 + (343/16 : ℝ) * a^4 * (c - a)^1 * (b - c)^1 + (287/64 : ℝ) * a^4 * (b - c)^2 + (67/4 : ℝ) * a^3 * (c - a)^3 + (201/8 : ℝ) * a^3 * (c - a)^2 * (b - c)^1 + (43/4 : ℝ) * a^3 * (c - a)^1 * (b - c)^2 + (19/16 : ℝ) * a^3 * (b - c)^3 + (13/2 : ℝ) * a^2 * (c - a)^4 + (13 : ℝ) * a^2 * (c - a)^3 * (b - c)^1 + (17/2 : ℝ) * a^2 * (c - a)^2 * (b - c)^2 + (2 : ℝ) * a^2 * (c - a)^1 * (b - c)^3 + (7/64 : ℝ) * a^2 * (b - c)^4 + (1 : ℝ) * a^1 * (c - a)^5 + (5/2 : ℝ) * a^1 * (c - a)^4 * (b - c)^1 + (9/4 : ℝ) * a^1 * (c - a)^3 * (b - c)^2 + (7/8 : ℝ) * a^1 * (c - a)^2 * (b - c)^3 + (3/16 : ℝ) * a^1 * (c - a)^1 * (b - c)^4 + (1/32 : ℝ) * a^1 * (b - c)^5 + (1/16 : ℝ) * (c - a)^2 * (b - c)^4 + (1/16 : ℝ) * (c - a)^1 * (b - c)^5 + (1/64 : ℝ) * (b - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (a - c) := by linarith
          have hdiff2 : 0 ≤ (b - a) := by linarith
          have hpos : 0 ≤ (217/64 : ℝ) * c^6 + (217/16 : ℝ) * c^5 * (a - c)^1 + (217/32 : ℝ) * c^5 * (b - a)^1 + (343/16 : ℝ) * c^4 * (a - c)^2 + (343/16 : ℝ) * c^4 * (a - c)^1 * (b - a)^1 + (287/64 : ℝ) * c^4 * (b - a)^2 + (67/4 : ℝ) * c^3 * (a - c)^3 + (201/8 : ℝ) * c^3 * (a - c)^2 * (b - a)^1 + (43/4 : ℝ) * c^3 * (a - c)^1 * (b - a)^2 + (19/16 : ℝ) * c^3 * (b - a)^3 + (13/2 : ℝ) * c^2 * (a - c)^4 + (13 : ℝ) * c^2 * (a - c)^3 * (b - a)^1 + (17/2 : ℝ) * c^2 * (a - c)^2 * (b - a)^2 + (2 : ℝ) * c^2 * (a - c)^1 * (b - a)^3 + (7/64 : ℝ) * c^2 * (b - a)^4 + (1 : ℝ) * c^1 * (a - c)^5 + (5/2 : ℝ) * c^1 * (a - c)^4 * (b - a)^1 + (9/4 : ℝ) * c^1 * (a - c)^3 * (b - a)^2 + (7/8 : ℝ) * c^1 * (a - c)^2 * (b - a)^3 + (3/16 : ℝ) * c^1 * (a - c)^1 * (b - a)^4 + (1/32 : ℝ) * c^1 * (b - a)^5 + (1/16 : ℝ) * (a - c)^2 * (b - a)^4 + (1/16 : ℝ) * (a - c)^1 * (b - a)^5 + (1/64 : ℝ) * (b - a)^6 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (a - b) := by linarith
        have hdiff2 : 0 ≤ (c - a) := by linarith
        have hpos : 0 ≤ (217/64 : ℝ) * b^6 + (217/16 : ℝ) * b^5 * (a - b)^1 + (217/32 : ℝ) * b^5 * (c - a)^1 + (343/16 : ℝ) * b^4 * (a - b)^2 + (343/16 : ℝ) * b^4 * (a - b)^1 * (c - a)^1 + (287/64 : ℝ) * b^4 * (c - a)^2 + (67/4 : ℝ) * b^3 * (a - b)^3 + (201/8 : ℝ) * b^3 * (a - b)^2 * (c - a)^1 + (43/4 : ℝ) * b^3 * (a - b)^1 * (c - a)^2 + (19/16 : ℝ) * b^3 * (c - a)^3 + (13/2 : ℝ) * b^2 * (a - b)^4 + (13 : ℝ) * b^2 * (a - b)^3 * (c - a)^1 + (17/2 : ℝ) * b^2 * (a - b)^2 * (c - a)^2 + (2 : ℝ) * b^2 * (a - b)^1 * (c - a)^3 + (7/64 : ℝ) * b^2 * (c - a)^4 + (1 : ℝ) * b^1 * (a - b)^5 + (5/2 : ℝ) * b^1 * (a - b)^4 * (c - a)^1 + (9/4 : ℝ) * b^1 * (a - b)^3 * (c - a)^2 + (7/8 : ℝ) * b^1 * (a - b)^2 * (c - a)^3 + (3/16 : ℝ) * b^1 * (a - b)^1 * (c - a)^4 + (1/32 : ℝ) * b^1 * (c - a)^5 + (1/16 : ℝ) * (a - b)^2 * (c - a)^4 + (1/16 : ℝ) * (a - b)^1 * (c - a)^5 + (1/64 : ℝ) * (c - a)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - b) := by linarith
          have hdiff2 : 0 ≤ (a - c) := by linarith
          have hpos : 0 ≤ (217/64 : ℝ) * b^6 + (217/16 : ℝ) * b^5 * (c - b)^1 + (217/32 : ℝ) * b^5 * (a - c)^1 + (343/16 : ℝ) * b^4 * (c - b)^2 + (343/16 : ℝ) * b^4 * (c - b)^1 * (a - c)^1 + (287/64 : ℝ) * b^4 * (a - c)^2 + (67/4 : ℝ) * b^3 * (c - b)^3 + (201/8 : ℝ) * b^3 * (c - b)^2 * (a - c)^1 + (43/4 : ℝ) * b^3 * (c - b)^1 * (a - c)^2 + (19/16 : ℝ) * b^3 * (a - c)^3 + (13/2 : ℝ) * b^2 * (c - b)^4 + (13 : ℝ) * b^2 * (c - b)^3 * (a - c)^1 + (17/2 : ℝ) * b^2 * (c - b)^2 * (a - c)^2 + (2 : ℝ) * b^2 * (c - b)^1 * (a - c)^3 + (7/64 : ℝ) * b^2 * (a - c)^4 + (1 : ℝ) * b^1 * (c - b)^5 + (5/2 : ℝ) * b^1 * (c - b)^4 * (a - c)^1 + (9/4 : ℝ) * b^1 * (c - b)^3 * (a - c)^2 + (7/8 : ℝ) * b^1 * (c - b)^2 * (a - c)^3 + (3/16 : ℝ) * b^1 * (c - b)^1 * (a - c)^4 + (1/32 : ℝ) * b^1 * (a - c)^5 + (1/16 : ℝ) * (c - b)^2 * (a - c)^4 + (1/16 : ℝ) * (c - b)^1 * (a - c)^5 + (1/64 : ℝ) * (a - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (b - c) := by linarith
          have hdiff2 : 0 ≤ (a - b) := by linarith
          have hpos : 0 ≤ (217/64 : ℝ) * c^6 + (217/16 : ℝ) * c^5 * (b - c)^1 + (217/32 : ℝ) * c^5 * (a - b)^1 + (343/16 : ℝ) * c^4 * (b - c)^2 + (343/16 : ℝ) * c^4 * (b - c)^1 * (a - b)^1 + (287/64 : ℝ) * c^4 * (a - b)^2 + (67/4 : ℝ) * c^3 * (b - c)^3 + (201/8 : ℝ) * c^3 * (b - c)^2 * (a - b)^1 + (43/4 : ℝ) * c^3 * (b - c)^1 * (a - b)^2 + (19/16 : ℝ) * c^3 * (a - b)^3 + (13/2 : ℝ) * c^2 * (b - c)^4 + (13 : ℝ) * c^2 * (b - c)^3 * (a - b)^1 + (17/2 : ℝ) * c^2 * (b - c)^2 * (a - b)^2 + (2 : ℝ) * c^2 * (b - c)^1 * (a - b)^3 + (7/64 : ℝ) * c^2 * (a - b)^4 + (1 : ℝ) * c^1 * (b - c)^5 + (5/2 : ℝ) * c^1 * (b - c)^4 * (a - b)^1 + (9/4 : ℝ) * c^1 * (b - c)^3 * (a - b)^2 + (7/8 : ℝ) * c^1 * (b - c)^2 * (a - b)^3 + (3/16 : ℝ) * c^1 * (b - c)^1 * (a - b)^4 + (1/32 : ℝ) * c^1 * (a - b)^5 + (1/16 : ℝ) * (b - c)^2 * (a - b)^4 + (1/16 : ℝ) * (b - c)^1 * (a - b)^5 + (1/64 : ℝ) * (a - b)^6 := by positivity
          convert hpos using 1 <;> ring
  have he : (a^2*b^2*c^2 - 2*a^2*b^2*c + a^2*b^2 - 2*a^2*b*c^2 + 3*a^2*b*c - a^2*b + a^2*c^2 - a^2*c - 2*a*b^2*c^2 + 3*a*b^2*c - a*b^2 + 3*a*b*c^2 - 2*a*b*c - a*c^2 + b^2*c^2 - b^2*c - b*c^2 + 1) = (a^6/64 - a^5*b/32 - a^5*c/32 - a^4*b^2/64 + 7*a^4*b*c/32 - a^4*c^2/64 + a^3*b^3/16 + 5*a^3*b^2*c/16 + 5*a^3*b*c^2/16 + a^3*c^3/16 - a^2*b^4/64 + 5*a^2*b^3*c/16 + 29*a^2*b^2*c^2/32 + 5*a^2*b*c^3/16 - a^2*c^4/64 - a*b^5/32 + 7*a*b^4*c/32 + 5*a*b^3*c^2/16 + 5*a*b^2*c^3/16 + 7*a*b*c^4/32 - a*c^5/32 + b^6/64 - b^5*c/32 - b^4*c^2/64 + b^3*c^3/16 - b^2*c^4/64 - b*c^5/32 + c^6/64) := by
    linear_combination (-a^5/64 + 3*a^4*b/64 + 3*a^4*c/64 - a^4/32 - a^3*b^2/32 - 5*a^3*b*c/16 + a^3*b/8 - a^3*c^2/32 + a^3*c/8 - a^3/16 - a^2*b^3/32 + a^2*b^2*c/32 - 3*a^2*b^2/16 + a^2*b*c^2/32 - 7*a^2*b*c/8 + 5*a^2*b/16 - a^2*c^3/32 - 3*a^2*c^2/16 + 5*a^2*c/16 - a^2/8 + 3*a*b^4/64 - 5*a*b^3*c/16 + a*b^3/8 + a*b^2*c^2/32 - 7*a*b^2*c/8 + 5*a*b^2/16 - 5*a*b*c^3/16 - 7*a*b*c^2/8 + 5*a*b*c/8 - a*b/4 + 3*a*c^4/64 + a*c^3/8 + 5*a*c^2/16 - a*c/4 - a/4 - b^5/64 + 3*b^4*c/64 - b^4/32 - b^3*c^2/32 + b^3*c/8 - b^3/16 - b^2*c^3/32 - 3*b^2*c^2/16 + 5*b^2*c/16 - b^2/8 + 3*b*c^4/64 + b*c^3/8 + 5*b*c^2/16 - b*c/4 - b/4 - c^5/64 - c^4/32 - c^3/16 - c^2/8 - c/4 - 1/2) * hab
  nlinarith only [hp, he]
example : (∀ (a b c : ℝ) (ha : 0 ≤ a) (hb : 0 ≤ b) (hc : 0 ≤ c) (hab : a + b + c = 2), (a + b - a * b) * (b + c - b * c) * (c + a - c * a) ≤ 1) := @solution
#print axioms solution
