-- Prove2me | solution 1 for WorkbookSource.base_5407
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T00:16:28.936105+00:00
-- url     : https://prove2.me/submissions/d6d72727-4e9c-40af-9713-5fe821a4ca82

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z) : 27 * (x + y + z) ^ 6 ≥ (27 * x ^ 2 + (y - z) ^ 2) * (27 * y ^ 2 + (z - x) ^ 2) * (27 * z ^ 2 + (x - y) ^ 2)  := by
  have hp : 0 ≤ (216*x^5*y + 216*x^5*z - 352*x^4*y^2 + 704*x^4*y*z - 352*x^4*z^2 + 2000*x^3*y^3 + 1672*x^3*y^2*z + 1672*x^3*y*z^2 + 2000*x^3*z^3 - 352*x^2*y^4 + 1672*x^2*y^3*z - 17328*x^2*y^2*z^2 + 1672*x^2*y*z^3 - 352*x^2*z^4 + 216*x*y^5 + 704*x*y^4*z + 1672*x*y^3*z^2 + 1672*x*y^2*z^3 + 704*x*y*z^4 + 216*x*z^5 + 216*y^5*z - 352*y^4*z^2 + 2000*y^3*z^3 - 352*y^2*z^4 + 216*y*z^5) := by
    rcases le_total x y with hab | hba
    · rcases le_total y z with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (y - x) := by linarith
        have hdiff2 : 0 ≤ (z - y) := by linarith
        have hpos : 0 ≤ (11664 : ℝ) * x^4 * (y - x)^2 + (11664 : ℝ) * x^4 * (y - x)^1 * (z - y)^1 + (11664 : ℝ) * x^4 * (z - y)^2 + (34992 : ℝ) * x^3 * (y - x)^3 + (52488 : ℝ) * x^3 * (y - x)^2 * (z - y)^1 + (40824 : ℝ) * x^3 * (y - x)^1 * (z - y)^2 + (11664 : ℝ) * x^3 * (z - y)^3 + (37152 : ℝ) * x^2 * (y - x)^4 + (74304 : ℝ) * x^2 * (y - x)^3 * (z - y)^1 + (58968 : ℝ) * x^2 * (y - x)^2 * (z - y)^2 + (21816 : ℝ) * x^2 * (y - x)^1 * (z - y)^3 + (2160 : ℝ) * x^2 * (z - y)^4 + (15552 : ℝ) * x^1 * (y - x)^5 + (38880 : ℝ) * x^1 * (y - x)^4 * (z - y)^1 + (35856 : ℝ) * x^1 * (y - x)^3 * (z - y)^2 + (14904 : ℝ) * x^1 * (y - x)^2 * (z - y)^3 + (3240 : ℝ) * x^1 * (y - x)^1 * (z - y)^4 + (432 : ℝ) * x^1 * (z - y)^5 + (1728 : ℝ) * (y - x)^6 + (5184 : ℝ) * (y - x)^5 * (z - y)^1 + (5696 : ℝ) * (y - x)^4 * (z - y)^2 + (2752 : ℝ) * (y - x)^3 * (z - y)^3 + (728 : ℝ) * (y - x)^2 * (z - y)^4 + (216 : ℝ) * (y - x)^1 * (z - y)^5 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total x z with hac | hca
        ·
          have hdiff1 : 0 ≤ (z - x) := by linarith
          have hdiff2 : 0 ≤ (y - z) := by linarith
          have hpos : 0 ≤ (11664 : ℝ) * x^4 * (z - x)^2 + (11664 : ℝ) * x^4 * (z - x)^1 * (y - z)^1 + (11664 : ℝ) * x^4 * (y - z)^2 + (34992 : ℝ) * x^3 * (z - x)^3 + (52488 : ℝ) * x^3 * (z - x)^2 * (y - z)^1 + (40824 : ℝ) * x^3 * (z - x)^1 * (y - z)^2 + (11664 : ℝ) * x^3 * (y - z)^3 + (37152 : ℝ) * x^2 * (z - x)^4 + (74304 : ℝ) * x^2 * (z - x)^3 * (y - z)^1 + (58968 : ℝ) * x^2 * (z - x)^2 * (y - z)^2 + (21816 : ℝ) * x^2 * (z - x)^1 * (y - z)^3 + (2160 : ℝ) * x^2 * (y - z)^4 + (15552 : ℝ) * x^1 * (z - x)^5 + (38880 : ℝ) * x^1 * (z - x)^4 * (y - z)^1 + (35856 : ℝ) * x^1 * (z - x)^3 * (y - z)^2 + (14904 : ℝ) * x^1 * (z - x)^2 * (y - z)^3 + (3240 : ℝ) * x^1 * (z - x)^1 * (y - z)^4 + (432 : ℝ) * x^1 * (y - z)^5 + (1728 : ℝ) * (z - x)^6 + (5184 : ℝ) * (z - x)^5 * (y - z)^1 + (5696 : ℝ) * (z - x)^4 * (y - z)^2 + (2752 : ℝ) * (z - x)^3 * (y - z)^3 + (728 : ℝ) * (z - x)^2 * (y - z)^4 + (216 : ℝ) * (z - x)^1 * (y - z)^5 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (x - z) := by linarith
          have hdiff2 : 0 ≤ (y - x) := by linarith
          have hpos : 0 ≤ (11664 : ℝ) * z^4 * (x - z)^2 + (11664 : ℝ) * z^4 * (x - z)^1 * (y - x)^1 + (11664 : ℝ) * z^4 * (y - x)^2 + (34992 : ℝ) * z^3 * (x - z)^3 + (52488 : ℝ) * z^3 * (x - z)^2 * (y - x)^1 + (40824 : ℝ) * z^3 * (x - z)^1 * (y - x)^2 + (11664 : ℝ) * z^3 * (y - x)^3 + (37152 : ℝ) * z^2 * (x - z)^4 + (74304 : ℝ) * z^2 * (x - z)^3 * (y - x)^1 + (58968 : ℝ) * z^2 * (x - z)^2 * (y - x)^2 + (21816 : ℝ) * z^2 * (x - z)^1 * (y - x)^3 + (2160 : ℝ) * z^2 * (y - x)^4 + (15552 : ℝ) * z^1 * (x - z)^5 + (38880 : ℝ) * z^1 * (x - z)^4 * (y - x)^1 + (35856 : ℝ) * z^1 * (x - z)^3 * (y - x)^2 + (14904 : ℝ) * z^1 * (x - z)^2 * (y - x)^3 + (3240 : ℝ) * z^1 * (x - z)^1 * (y - x)^4 + (432 : ℝ) * z^1 * (y - x)^5 + (1728 : ℝ) * (x - z)^6 + (5184 : ℝ) * (x - z)^5 * (y - x)^1 + (5696 : ℝ) * (x - z)^4 * (y - x)^2 + (2752 : ℝ) * (x - z)^3 * (y - x)^3 + (728 : ℝ) * (x - z)^2 * (y - x)^4 + (216 : ℝ) * (x - z)^1 * (y - x)^5 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total x z with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (x - y) := by linarith
        have hdiff2 : 0 ≤ (z - x) := by linarith
        have hpos : 0 ≤ (11664 : ℝ) * y^4 * (x - y)^2 + (11664 : ℝ) * y^4 * (x - y)^1 * (z - x)^1 + (11664 : ℝ) * y^4 * (z - x)^2 + (34992 : ℝ) * y^3 * (x - y)^3 + (52488 : ℝ) * y^3 * (x - y)^2 * (z - x)^1 + (40824 : ℝ) * y^3 * (x - y)^1 * (z - x)^2 + (11664 : ℝ) * y^3 * (z - x)^3 + (37152 : ℝ) * y^2 * (x - y)^4 + (74304 : ℝ) * y^2 * (x - y)^3 * (z - x)^1 + (58968 : ℝ) * y^2 * (x - y)^2 * (z - x)^2 + (21816 : ℝ) * y^2 * (x - y)^1 * (z - x)^3 + (2160 : ℝ) * y^2 * (z - x)^4 + (15552 : ℝ) * y^1 * (x - y)^5 + (38880 : ℝ) * y^1 * (x - y)^4 * (z - x)^1 + (35856 : ℝ) * y^1 * (x - y)^3 * (z - x)^2 + (14904 : ℝ) * y^1 * (x - y)^2 * (z - x)^3 + (3240 : ℝ) * y^1 * (x - y)^1 * (z - x)^4 + (432 : ℝ) * y^1 * (z - x)^5 + (1728 : ℝ) * (x - y)^6 + (5184 : ℝ) * (x - y)^5 * (z - x)^1 + (5696 : ℝ) * (x - y)^4 * (z - x)^2 + (2752 : ℝ) * (x - y)^3 * (z - x)^3 + (728 : ℝ) * (x - y)^2 * (z - x)^4 + (216 : ℝ) * (x - y)^1 * (z - x)^5 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total y z with hac | hca
        ·
          have hdiff1 : 0 ≤ (z - y) := by linarith
          have hdiff2 : 0 ≤ (x - z) := by linarith
          have hpos : 0 ≤ (11664 : ℝ) * y^4 * (z - y)^2 + (11664 : ℝ) * y^4 * (z - y)^1 * (x - z)^1 + (11664 : ℝ) * y^4 * (x - z)^2 + (34992 : ℝ) * y^3 * (z - y)^3 + (52488 : ℝ) * y^3 * (z - y)^2 * (x - z)^1 + (40824 : ℝ) * y^3 * (z - y)^1 * (x - z)^2 + (11664 : ℝ) * y^3 * (x - z)^3 + (37152 : ℝ) * y^2 * (z - y)^4 + (74304 : ℝ) * y^2 * (z - y)^3 * (x - z)^1 + (58968 : ℝ) * y^2 * (z - y)^2 * (x - z)^2 + (21816 : ℝ) * y^2 * (z - y)^1 * (x - z)^3 + (2160 : ℝ) * y^2 * (x - z)^4 + (15552 : ℝ) * y^1 * (z - y)^5 + (38880 : ℝ) * y^1 * (z - y)^4 * (x - z)^1 + (35856 : ℝ) * y^1 * (z - y)^3 * (x - z)^2 + (14904 : ℝ) * y^1 * (z - y)^2 * (x - z)^3 + (3240 : ℝ) * y^1 * (z - y)^1 * (x - z)^4 + (432 : ℝ) * y^1 * (x - z)^5 + (1728 : ℝ) * (z - y)^6 + (5184 : ℝ) * (z - y)^5 * (x - z)^1 + (5696 : ℝ) * (z - y)^4 * (x - z)^2 + (2752 : ℝ) * (z - y)^3 * (x - z)^3 + (728 : ℝ) * (z - y)^2 * (x - z)^4 + (216 : ℝ) * (z - y)^1 * (x - z)^5 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (y - z) := by linarith
          have hdiff2 : 0 ≤ (x - y) := by linarith
          have hpos : 0 ≤ (11664 : ℝ) * z^4 * (y - z)^2 + (11664 : ℝ) * z^4 * (y - z)^1 * (x - y)^1 + (11664 : ℝ) * z^4 * (x - y)^2 + (34992 : ℝ) * z^3 * (y - z)^3 + (52488 : ℝ) * z^3 * (y - z)^2 * (x - y)^1 + (40824 : ℝ) * z^3 * (y - z)^1 * (x - y)^2 + (11664 : ℝ) * z^3 * (x - y)^3 + (37152 : ℝ) * z^2 * (y - z)^4 + (74304 : ℝ) * z^2 * (y - z)^3 * (x - y)^1 + (58968 : ℝ) * z^2 * (y - z)^2 * (x - y)^2 + (21816 : ℝ) * z^2 * (y - z)^1 * (x - y)^3 + (2160 : ℝ) * z^2 * (x - y)^4 + (15552 : ℝ) * z^1 * (y - z)^5 + (38880 : ℝ) * z^1 * (y - z)^4 * (x - y)^1 + (35856 : ℝ) * z^1 * (y - z)^3 * (x - y)^2 + (14904 : ℝ) * z^1 * (y - z)^2 * (x - y)^3 + (3240 : ℝ) * z^1 * (y - z)^1 * (x - y)^4 + (432 : ℝ) * z^1 * (x - y)^5 + (1728 : ℝ) * (y - z)^6 + (5184 : ℝ) * (y - z)^5 * (x - y)^1 + (5696 : ℝ) * (y - z)^4 * (x - y)^2 + (2752 : ℝ) * (y - z)^3 * (x - y)^3 + (728 : ℝ) * (y - z)^2 * (x - y)^4 + (216 : ℝ) * (y - z)^1 * (x - y)^5 := by positivity
          convert hpos using 1 <;> ring
  nlinarith only [hp]
example : (∀ (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z), 27 * (x + y + z) ^ 6 ≥ (27 * x ^ 2 + (y - z) ^ 2) * (27 * y ^ 2 + (z - x) ^ 2) * (27 * z ^ 2 + (x - y) ^ 2)) := @solution
#print axioms solution
