-- Prove2me | solution 1 for WorkbookSource.base_35373
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:01:52.523841+00:00
-- url     : https://prove2.me/submissions/b1ac9ae6-b756-4388-9dfe-f677f3ce3ea5

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3) : 1 / (a ^ 2 + b ^ 2 + a + 21) + 1 / (b ^ 2 + c ^ 2 + b + 21) + 1 / (c ^ 2 + a ^ 2 + c + 21) ≤ 1 / 8  := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (254*a^6/81 + 646*a^5*b/81 + 571*a^5*c/81 + 853*a^4*b^2/81 + 17*a^4*b*c/9 + 730*a^4*c^2/81 + 712*a^3*b^3/81 - 1367*a^3*b^2*c/81 - 1415*a^3*b*c^2/81 + 712*a^3*c^3/81 + 730*a^2*b^4/81 - 1415*a^2*b^3*c/81 - 379*a^2*b^2*c^2/9 - 1367*a^2*b*c^3/81 + 853*a^2*c^4/81 + 571*a*b^5/81 + 17*a*b^4*c/9 - 1367*a*b^3*c^2/81 - 1415*a*b^2*c^3/81 + 17*a*b*c^4/9 + 646*a*c^5/81 + 254*b^6/81 + 646*b^5*c/81 + 853*b^4*c^2/81 + 712*b^3*c^3/81 + 730*b^2*c^4/81 + 571*b*c^5/81 + 254*c^6/81) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (656/3 : ℝ) * a^4 * (b - a)^2 + (656/3 : ℝ) * a^4 * (b - a)^1 * (c - b)^1 + (656/3 : ℝ) * a^4 * (c - b)^2 + (16004/27 : ℝ) * a^3 * (b - a)^3 + (7903/9 : ℝ) * a^3 * (b - a)^2 * (c - b)^1 + (7643/9 : ℝ) * a^3 * (b - a)^1 * (c - b)^2 + (7612/27 : ℝ) * a^3 * (c - b)^3 + (16465/27 : ℝ) * a^2 * (b - a)^4 + (32336/27 : ℝ) * a^2 * (b - a)^3 * (c - b)^1 + (11582/9 : ℝ) * a^2 * (b - a)^2 * (c - b)^2 + (18875/27 : ℝ) * a^2 * (b - a)^1 * (c - b)^3 + (3877/27 : ℝ) * a^2 * (c - b)^4 + (22861/81 : ℝ) * a^1 * (b - a)^5 + (55951/81 : ℝ) * a^1 * (b - a)^4 * (c - b)^1 + (69322/81 : ℝ) * a^1 * (b - a)^3 * (c - b)^2 + (48923/81 : ℝ) * a^1 * (b - a)^2 * (c - b)^3 + (18173/81 : ℝ) * a^1 * (b - a)^1 * (c - b)^4 + (2741/81 : ℝ) * a^1 * (c - b)^5 + (1340/27 : ℝ) * (b - a)^6 + (3929/27 : ℝ) * (b - a)^5 * (c - b)^1 + (16889/81 : ℝ) * (b - a)^4 * (c - b)^2 + (14422/81 : ℝ) * (b - a)^3 * (c - b)^3 + (2465/27 : ℝ) * (b - a)^2 * (c - b)^4 + (2095/81 : ℝ) * (b - a)^1 * (c - b)^5 + (254/81 : ℝ) * (c - b)^6 := by positivity
    convert hpos using 1 <;> ring
  have haux1 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ c) (hord2 : c ≤ b) : 0 ≤ (254*a^6/81 + 646*a^5*b/81 + 571*a^5*c/81 + 853*a^4*b^2/81 + 17*a^4*b*c/9 + 730*a^4*c^2/81 + 712*a^3*b^3/81 - 1367*a^3*b^2*c/81 - 1415*a^3*b*c^2/81 + 712*a^3*c^3/81 + 730*a^2*b^4/81 - 1415*a^2*b^3*c/81 - 379*a^2*b^2*c^2/9 - 1367*a^2*b*c^3/81 + 853*a^2*c^4/81 + 571*a*b^5/81 + 17*a*b^4*c/9 - 1367*a*b^3*c^2/81 - 1415*a*b^2*c^3/81 + 17*a*b*c^4/9 + 646*a*c^5/81 + 254*b^6/81 + 646*b^5*c/81 + 853*b^4*c^2/81 + 712*b^3*c^3/81 + 730*b^2*c^4/81 + 571*b*c^5/81 + 254*c^6/81) := by
    have hdiff1 : 0 ≤ (c - a) := by linarith
    have hdiff2 : 0 ≤ (b - c) := by linarith
    have hpos : 0 ≤ (656/3 : ℝ) * a^4 * (c - a)^2 + (656/3 : ℝ) * a^4 * (c - a)^1 * (b - c)^1 + (656/3 : ℝ) * a^4 * (b - c)^2 + (16004/27 : ℝ) * a^3 * (c - a)^3 + (8101/9 : ℝ) * a^3 * (c - a)^2 * (b - c)^1 + (7841/9 : ℝ) * a^3 * (c - a)^1 * (b - c)^2 + (7612/27 : ℝ) * a^3 * (b - c)^3 + (16465/27 : ℝ) * a^2 * (c - a)^4 + (33524/27 : ℝ) * a^2 * (c - a)^3 * (b - c)^1 + (12176/9 : ℝ) * a^2 * (c - a)^2 * (b - c)^2 + (19469/27 : ℝ) * a^2 * (c - a)^1 * (b - c)^3 + (3877/27 : ℝ) * a^2 * (b - c)^4 + (22861/81 : ℝ) * a^1 * (c - a)^5 + (58354/81 : ℝ) * a^1 * (c - a)^4 * (b - c)^1 + (74128/81 : ℝ) * a^1 * (c - a)^3 * (b - c)^2 + (51947/81 : ℝ) * a^1 * (c - a)^2 * (b - c)^3 + (18794/81 : ℝ) * a^1 * (c - a)^1 * (b - c)^4 + (2741/81 : ℝ) * a^1 * (b - c)^5 + (1340/27 : ℝ) * (c - a)^6 + (4111/27 : ℝ) * (c - a)^5 * (b - c)^1 + (18254/81 : ℝ) * (c - a)^4 * (b - c)^2 + (15664/81 : ℝ) * (c - a)^3 * (b - c)^3 + (877/9 : ℝ) * (c - a)^2 * (b - c)^4 + (2170/81 : ℝ) * (c - a)^1 * (b - c)^5 + (254/81 : ℝ) * (b - c)^6 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (254*a^6/81 + 646*a^5*b/81 + 571*a^5*c/81 + 853*a^4*b^2/81 + 17*a^4*b*c/9 + 730*a^4*c^2/81 + 712*a^3*b^3/81 - 1367*a^3*b^2*c/81 - 1415*a^3*b*c^2/81 + 712*a^3*c^3/81 + 730*a^2*b^4/81 - 1415*a^2*b^3*c/81 - 379*a^2*b^2*c^2/9 - 1367*a^2*b*c^3/81 + 853*a^2*c^4/81 + 571*a*b^5/81 + 17*a*b^4*c/9 - 1367*a*b^3*c^2/81 - 1415*a*b^2*c^3/81 + 17*a*b*c^4/9 + 646*a*c^5/81 + 254*b^6/81 + 646*b^5*c/81 + 853*b^4*c^2/81 + 712*b^3*c^3/81 + 730*b^2*c^4/81 + 571*b*c^5/81 + 254*c^6/81) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux1 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux1 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux1 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (a^4*b^2 + a^4*b + a^4*c^2 + 13*a^4 + a^3*b^2 + a^3*b + a^3*c^2 + 13*a^3 + a^2*b^4 + a^2*b^3 + 2*a^2*b^2*c^2 + a^2*b^2*c + 39*a^2*b^2 + a^2*b*c^2 + a^2*b*c + 26*a^2*b + a^2*c^4 + a^2*c^3 + 39*a^2*c^2 + 13*a^2*c + 210*a^2 + a*b^2*c^2 + a*b^2*c + 13*a*b^2 + a*b*c^2 + a*b*c + 13*a*b + a*c^4 + a*c^3 + 26*a*c^2 + 13*a*c + 105*a + b^4*c^2 + b^4*c + 13*b^4 + b^3*c^2 + b^3*c + 13*b^3 + b^2*c^4 + b^2*c^3 + 39*b^2*c^2 + 26*b^2*c + 210*b^2 + 13*b*c^2 + 13*b*c + 105*b + 13*c^4 + 13*c^3 + 210*c^2 + 105*c - 1323) = (254*a^6/81 + 646*a^5*b/81 + 571*a^5*c/81 + 853*a^4*b^2/81 + 17*a^4*b*c/9 + 730*a^4*c^2/81 + 712*a^3*b^3/81 - 1367*a^3*b^2*c/81 - 1415*a^3*b*c^2/81 + 712*a^3*c^3/81 + 730*a^2*b^4/81 - 1415*a^2*b^3*c/81 - 379*a^2*b^2*c^2/9 - 1367*a^2*b*c^3/81 + 853*a^2*c^4/81 + 571*a*b^5/81 + 17*a*b^4*c/9 - 1367*a*b^3*c^2/81 - 1415*a*b^2*c^3/81 + 17*a*b*c^4/9 + 646*a*c^5/81 + 254*b^6/81 + 646*b^5*c/81 + 853*b^4*c^2/81 + 712*b^3*c^3/81 + 730*b^2*c^4/81 + 571*b*c^5/81 + 254*c^6/81) := by
    linear_combination (-254*a^5/81 - 392*a^4*b/81 - 317*a^4*c/81 - 254*a^4/27 - 380*a^3*b^2/81 + 556*a^3*b*c/81 - 37*a^3*b/9 - 332*a^3*c^2/81 - 7*a^3*c/3 - 137*a^3/9 - 332*a^2*b^3/81 + 397*a^2*b^2*c/27 - 242*a^2*b^2/27 + 397*a^2*b*c^2/27 + 730*a^2*b*c/27 + 35*a^2*b/9 - 380*a^2*c^3/81 - 242*a^2*c^2/27 + 74*a^2*c/9 - 98*a^2/3 - 317*a*b^4/81 + 556*a*b^3*c/81 - 7*a*b^3/3 + 397*a*b^2*c^2/27 + 730*a*b^2*c/27 + 74*a*b^2/9 + 556*a*b*c^3/81 + 730*a*b*c^2/27 + 70*a*b*c + 211*a*b/3 - 392*a*c^4/81 - 37*a*c^3/9 + 35*a*c^2/9 + 211*a*c/3 + 112*a - 254*b^5/81 - 392*b^4*c/81 - 254*b^4/27 - 380*b^3*c^2/81 - 37*b^3*c/9 - 137*b^3/9 - 332*b^2*c^3/81 - 242*b^2*c^2/27 + 35*b^2*c/9 - 98*b^2/3 - 317*b*c^4/81 - 7*b*c^3/3 + 74*b*c^2/9 + 211*b*c/3 + 112*b - 254*c^5/81 - 254*c^4/27 - 137*c^3/9 - 98*c^2/3 + 112*c + 441) * hab
  have hn : 0 ≤ (a^4*b^2 + a^4*b + a^4*c^2 + 13*a^4 + a^3*b^2 + a^3*b + a^3*c^2 + 13*a^3 + a^2*b^4 + a^2*b^3 + 2*a^2*b^2*c^2 + a^2*b^2*c + 39*a^2*b^2 + a^2*b*c^2 + a^2*b*c + 26*a^2*b + a^2*c^4 + a^2*c^3 + 39*a^2*c^2 + 13*a^2*c + 210*a^2 + a*b^2*c^2 + a*b^2*c + 13*a*b^2 + a*b*c^2 + a*b*c + 13*a*b + a*c^4 + a*c^3 + 26*a*c^2 + 13*a*c + 105*a + b^4*c^2 + b^4*c + 13*b^4 + b^3*c^2 + b^3*c + 13*b^3 + b^2*c^4 + b^2*c^3 + 39*b^2*c^2 + 26*b^2*c + 210*b^2 + 13*b*c^2 + 13*b*c + 105*b + 13*c^4 + 13*c^3 + 210*c^2 + 105*c - 1323) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (hab : a + b + c = 3), 1 / (a ^ 2 + b ^ 2 + a + 21) + 1 / (b ^ 2 + c ^ 2 + b + 21) + 1 / (c ^ 2 + a ^ 2 + c + 21) ≤ 1 / 8) := @solution
#print axioms solution
