-- Prove2me | solution 1 for FlexLearning.Threshold.aux_poly_bounds
-- status  : ACCEPTED   (prove)
-- author  : @tianyipeng
-- created : 2026-10-30T11:46:13.969371+00:00
-- url     : https://prove2.me/submissions/76f22616-d7be-4227-b366-9ddf6fbae969

import Mathlib

namespace FlexPolyC

lemma P12_pos (s : ℝ) (h0 : (0:ℝ) ≤ s) (h1 : s ≤ ((289:ℝ)/500)) :
    0 < (8:ℝ) + (36:ℝ) * s ^ 1 + (54:ℝ) * s ^ 2 + (-429:ℝ) * s ^ 3 + (162:ℝ) * s ^ 5 + (1314:ℝ) * s ^ 6 + (-648:ℝ) * s ^ 7 + (-486:ℝ) * s ^ 8 + (-1053:ℝ) * s ^ 9 + (972:ℝ) * s ^ 10 + (81:ℝ) * s ^ 12 := by
  rcases le_total s ((18:ℝ)/125) with h0a | h0a
  · have h0 : (0:ℝ) ≤ s := by linarith
    have h1 : s ≤ ((18:ℝ)/125) := h0a
    obtain ⟨t, rfl⟩ : ∃ t, s = (0:ℝ) + t := ⟨s - (0:ℝ), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((18:ℝ)/125) := by linarith
    have hc : (0:ℝ) < ((50053469812238250496:ℝ)/7450580596923828125) := by norm_num
    have h1 : 0 ≤ t ^ 1 := pow_nonneg ht0 1
    have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
    have h3 : t ^ 3 ≤ ((18:ℝ)/125) ^ 3 := pow_le_pow_left₀ ht0 ht1 3
    have h5 : 0 ≤ t ^ 5 := pow_nonneg ht0 5
    have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
    have h7 : t ^ 7 ≤ ((18:ℝ)/125) ^ 7 := pow_le_pow_left₀ ht0 ht1 7
    have h8 : t ^ 8 ≤ ((18:ℝ)/125) ^ 8 := pow_le_pow_left₀ ht0 ht1 8
    have h9 : t ^ 9 ≤ ((18:ℝ)/125) ^ 9 := pow_le_pow_left₀ ht0 ht1 9
    have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
    have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
    linear_combination hc + (36:ℝ) * h1 + (54:ℝ) * h2 + (429:ℝ) * h3 + (162:ℝ) * h5 + (1314:ℝ) * h6 + (648:ℝ) * h7 + (486:ℝ) * h8 + (1053:ℝ) * h9 + (972:ℝ) * h10 + (81:ℝ) * h12
  · have h0 : ((18:ℝ)/125) ≤ s := h0a
    rcases le_total s ((289:ℝ)/1000) with h1a | h1a
    · have h0 : ((18:ℝ)/125) ≤ s := by linarith
      have h1 : s ≤ ((289:ℝ)/1000) := h1a
      obtain ⟨t, rfl⟩ : ∃ t, s = ((18:ℝ)/125) + t := ⟨s - ((18:ℝ)/125), by ring⟩
      have ht0 : 0 ≤ t := by linarith
      have ht1 : t ≤ ((29:ℝ)/200) := by linarith
      have hc : (0:ℝ) < ((291007397646706854991183085606587:ℝ)/30517578125000000000000000000000) := by norm_num
      have h1 : 0 ≤ t ^ 1 := pow_nonneg ht0 1
      have h2 : t ^ 2 ≤ ((29:ℝ)/200) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
      have h3 : t ^ 3 ≤ ((29:ℝ)/200) ^ 3 := pow_le_pow_left₀ ht0 ht1 3
      have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
      have h5 : 0 ≤ t ^ 5 := pow_nonneg ht0 5
      have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
      have h7 : t ^ 7 ≤ ((29:ℝ)/200) ^ 7 := pow_le_pow_left₀ ht0 ht1 7
      have h8 : t ^ 8 ≤ ((29:ℝ)/200) ^ 8 := pow_le_pow_left₀ ht0 ht1 8
      have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
      have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
      have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
      have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
      linear_combination hc + ((2986551441014770112013504:ℝ)/116415321826934814453125) * h1 + ((110846228830040608968096:ℝ)/931322574615478515625) * h2 + ((490265435828783331573:ℝ)/1490116119384765625) * h3 + ((5204782019727546444:ℝ)/11920928955078125) * h4 + ((425364262005774114:ℝ)/476837158203125) * h5 + ((774228804174306:ℝ)/3814697265625) * h6 + ((50099944808664:ℝ)/30517578125) * h7 + ((45237072456:ℝ)/48828125) * h8 + ((156207123:ℝ)/390625) * h9 + ((16919604:ℝ)/15625) * h10 + ((17496:ℝ)/125) * h11 + (81:ℝ) * h12
    · have h0 : ((289:ℝ)/1000) ≤ s := h1a
      rcases le_total s ((217:ℝ)/500) with h2a | h2a
      · have h0 : ((289:ℝ)/1000) ≤ s := by linarith
        have h1 : s ≤ ((217:ℝ)/500) := h2a
        obtain ⟨t, rfl⟩ : ∃ t, s = ((289:ℝ)/1000) + t := ⟨s - ((289:ℝ)/1000), by ring⟩
        have ht0 : 0 ≤ t := by linarith
        have ht1 : t ≤ ((29:ℝ)/200) := by linarith
        have hc : (0:ℝ) < ((6442347557954992909247594577274026611:ℝ)/1000000000000000000000000000000000000) := by norm_num
        have h1 : t ^ 1 ≤ ((29:ℝ)/200) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
        have h2 : t ^ 2 ≤ ((29:ℝ)/200) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
        have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
        have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
        have h5 : 0 ≤ t ^ 5 := pow_nonneg ht0 5
        have h6 : t ^ 6 ≤ ((29:ℝ)/200) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
        have h7 : t ^ 7 ≤ ((29:ℝ)/200) ^ 7 := pow_le_pow_left₀ ht0 ht1 7
        have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
        have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
        have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
        have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
        have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
        linear_combination hc + ((5588955569700712194332926682766573:ℝ)/250000000000000000000000000000000) * h1 + ((90471313097447371677234150520527:ℝ)/500000000000000000000000000000) * h2 + ((4795897814543878362294989019:ℝ)/50000000000000000000000000) * h3 + ((189786291953000251282349139:ℝ)/200000000000000000000000) * h4 + ((28258999077502568049651:ℝ)/125000000000000000000) * h5 + ((450244158401963941929:ℝ)/250000000000000000) * h6 + ((249126247392299469:ℝ)/125000000000000) * h7 + ((141609706919379:ℝ)/200000000000) * h8 + ((109310573979:ℝ)/50000000) * h9 + ((709251633:ℝ)/500000) * h10 + ((70227:ℝ)/250) * h11 + (81:ℝ) * h12
      · have h0 : ((217:ℝ)/500) ≤ s := h2a
        rcases le_total s ((253:ℝ)/500) with h3a | h3a
        · have h0 : ((217:ℝ)/500) ≤ s := by linarith
          have h1 : s ≤ ((253:ℝ)/500) := h3a
          obtain ⟨t, rfl⟩ : ∃ t, s = ((217:ℝ)/500) + t := ⟨s - ((217:ℝ)/500), by ring⟩
          have ht0 : 0 ≤ t := by linarith
          have ht1 : t ≤ ((9:ℝ)/125) := by linarith
          have hc : (0:ℝ) < ((704057356017900493007069180892353:ℝ)/244140625000000000000000000000000) := by norm_num
          have h1 : t ^ 1 ≤ ((9:ℝ)/125) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
          have h2 : t ^ 2 ≤ ((9:ℝ)/125) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
          have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
          have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
          have h5 : t ^ 5 ≤ ((9:ℝ)/125) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
          have h6 : t ^ 6 ≤ ((9:ℝ)/125) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
          have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
          have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
          have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
          have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
          have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
          have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
          linear_combination hc + ((7021256573431387754998289759781:ℝ)/122070312500000000000000000000) * h1 + ((13154194046097260417666237823:ℝ)/488281250000000000000000000) * h2 + ((54460121876340591284754627:ℝ)/97656250000000000000000) * h3 + ((292703160714655865298579:ℝ)/781250000000000000000) * h4 + ((1908093504526171575813:ℝ)/976562500000000000) * h5 + ((10572281381257654041:ℝ)/3906250000000000) * h6 + ((4090225932032283:ℝ)/3906250000000) * h7 + ((63277039472499:ℝ)/12500000000) * h8 + ((28888766883:ℝ)/6250000) * h9 + ((247368897:ℝ)/125000) * h10 + ((52731:ℝ)/125) * h11 + (81:ℝ) * h12
        · have h0 : ((253:ℝ)/500) ≤ s := h3a
          rcases le_total s ((271:ℝ)/500) with h4a | h4a
          · have h0 : ((253:ℝ)/500) ≤ s := by linarith
            have h1 : s ≤ ((271:ℝ)/500) := h4a
            obtain ⟨t, rfl⟩ : ∃ t, s = ((253:ℝ)/500) + t := ⟨s - ((253:ℝ)/500), by ring⟩
            have ht0 : 0 ≤ t := by linarith
            have ht1 : t ≤ ((9:ℝ)/250) := by linarith
            have hc : (0:ℝ) < ((296028486530395587035742227007209:ℝ)/244140625000000000000000000000000) := by norm_num
            have h1 : t ^ 1 ≤ ((9:ℝ)/250) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
            have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
            have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
            have h4 : t ^ 4 ≤ ((9:ℝ)/250) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
            have h5 : t ^ 5 ≤ ((9:ℝ)/250) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
            have h6 : t ^ 6 ≤ ((9:ℝ)/250) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
            have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
            have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
            have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
            have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
            have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
            have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
            linear_combination hc + ((6403527201681775403938478396529:ℝ)/122070312500000000000000000000) * h1 + ((47290469130914839664512297977:ℝ)/488281250000000000000000000) * h2 + ((53288103228129348029952303:ℝ)/97656250000000000000000) * h3 + ((402194800468491121531341:ℝ)/781250000000000000000) * h4 + ((2818997526394695785697:ℝ)/976562500000000000) * h5 + ((5029330902348387681:ℝ)/3906250000000000) * h6 + ((19211014674497367:ℝ)/3906250000000) * h7 + ((106825720537539:ℝ)/12500000000) * h8 + ((38587350807:ℝ)/6250000) * h9 + ((292596057:ℝ)/125000) * h10 + ((61479:ℝ)/125) * h11 + (81:ℝ) * h12
          · have h0 : ((271:ℝ)/500) ≤ s := h4a
            rcases le_total s ((14:ℝ)/25) with h5a | h5a
            · have h0 : ((271:ℝ)/500) ≤ s := by linarith
              have h1 : s ≤ ((14:ℝ)/25) := h5a
              obtain ⟨t, rfl⟩ : ∃ t, s = ((271:ℝ)/500) + t := ⟨s - ((271:ℝ)/500), by ring⟩
              have ht0 : 0 ≤ t := by linarith
              have ht1 : t ≤ ((9:ℝ)/500) := by linarith
              have hc : (0:ℝ) < ((35442529677725696571249747619523:ℝ)/61035156250000000000000000000000) := by norm_num
              have h1 : t ^ 1 ≤ ((9:ℝ)/500) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
              have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
              have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
              have h4 : t ^ 4 ≤ ((9:ℝ)/500) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
              have h5 : t ^ 5 ≤ ((9:ℝ)/500) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
              have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
              have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
              have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
              have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
              have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
              have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
              have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
              linear_combination hc + ((5308053045270809407276020734547:ℝ)/122070312500000000000000000000) * h1 + ((73441235860900797307205076273:ℝ)/488281250000000000000000000) * h2 + ((42309023910581178723218421:ℝ)/97656250000000000000000) * h3 + ((820587735189245533476141:ℝ)/781250000000000000000) * h4 + ((2936753080904264653971:ℝ)/976562500000000000) * h5 + ((1121045307633419031:ℝ)/3906250000000000) * h6 + ((30002809311204669:ℝ)/3906250000000) * h7 + ((133584913877139:ℝ)/12500000000) * h8 + ((44078387301:ℝ)/6250000) * h9 + ((317807793:ℝ)/125000) * h10 + ((65853:ℝ)/125) * h11 + (81:ℝ) * h12
            · have h0 : ((14:ℝ)/25) ≤ s := h5a
              rcases le_total s ((569:ℝ)/1000) with h6a | h6a
              · have h0 : ((14:ℝ)/25) ≤ s := by linarith
                have h1 : s ≤ ((569:ℝ)/1000) := h6a
                obtain ⟨t, rfl⟩ : ∃ t, s = ((14:ℝ)/25) + t := ⟨s - ((14:ℝ)/25), by ring⟩
                have ht0 : 0 ≤ t := by linarith
                have ht1 : t ≤ ((9:ℝ)/1000) := by linarith
                have hc : (0:ℝ) < ((893785535665253308320421:ℝ)/3051757812500000000000000) := by norm_num
                have h1 : t ^ 1 ≤ ((9:ℝ)/1000) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
                have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
                have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
                have h4 : t ^ 4 ≤ ((9:ℝ)/1000) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
                have h5 : t ^ 5 ≤ ((9:ℝ)/1000) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
                have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
                have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
                have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
                have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
                have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
                have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
                have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
                linear_combination hc + ((89821475669036592:ℝ)/2384185791015625) * h1 + ((16363749417464196:ℝ)/95367431640625) * h2 + ((265455965317551:ℝ)/762939453125) * h3 + ((40220968307436:ℝ)/30517578125) * h4 + ((17824683575142:ℝ)/6103515625) * h5 + ((330864323634:ℝ)/244140625) * h6 + ((90856210248:ℝ)/9765625) * h7 + ((927100404:ℝ)/78125) * h8 + ((23498991:ℝ)/3125) * h9 + ((1655316:ℝ)/625) * h10 + ((13608:ℝ)/25) * h11 + (81:ℝ) * h12
              · have h0 : ((569:ℝ)/1000) ≤ s := h6a
                rcases le_total s ((287:ℝ)/500) with h7a | h7a
                · have h0 : ((569:ℝ)/1000) ≤ s := by linarith
                  have h1 : s ≤ ((287:ℝ)/500) := h7a
                  obtain ⟨t, rfl⟩ : ∃ t, s = ((569:ℝ)/1000) + t := ⟨s - ((569:ℝ)/1000), by ring⟩
                  have ht0 : 0 ≤ t := by linarith
                  have ht1 : t ≤ ((1:ℝ)/200) := by linarith
                  have hc : (0:ℝ) < ((33625852485345715392671732346845789:ℝ)/250000000000000000000000000000000000) := by norm_num
                  have h1 : t ^ 1 ≤ ((1:ℝ)/200) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
                  have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
                  have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
                  have h4 : t ^ 4 ≤ ((1:ℝ)/200) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
                  have h5 : t ^ 5 ≤ ((1:ℝ)/200) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
                  have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
                  have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
                  have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
                  have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
                  have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
                  have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
                  have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
                  linear_combination hc + ((8626173151235406189597970927130133:ℝ)/250000000000000000000000000000000) * h1 + ((90159506777275395848149814783073:ℝ)/500000000000000000000000000000) * h2 + ((14907413614553706005273509539:ℝ)/50000000000000000000000000) * h3 + ((289497806858692315294963821:ℝ)/200000000000000000000000) * h4 + ((353862249995004534852309:ℝ)/125000000000000000000) * h5 + ((492182521924959075591:ℝ)/250000000000000000) * h6 + ((1272531489223135131:ℝ)/125000000000000) * h7 + ((2497139711485299:ℝ)/200000000000) * h8 + ((388024028019:ℝ)/50000000) * h9 + ((1351413153:ℝ)/500000) * h10 + ((138267:ℝ)/250) * h11 + (81:ℝ) * h12
                · have h0 : ((287:ℝ)/500) ≤ s := h7a
                  obtain ⟨t, rfl⟩ : ∃ t, s = ((287:ℝ)/500) + t := ⟨s - ((287:ℝ)/500), by ring⟩
                  have ht0 : 0 ≤ t := by linarith
                  have ht1 : t ≤ ((1:ℝ)/250) := by linarith
                  have hc : (0:ℝ) < ((406678072783073142155001355093:ℝ)/48828125000000000000000000000000) := by norm_num
                  have h1 : t ^ 1 ≤ ((1:ℝ)/250) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
                  have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
                  have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
                  have h4 : t ^ 4 ≤ ((1:ℝ)/250) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
                  have h5 : t ^ 5 ≤ ((1:ℝ)/250) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
                  have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
                  have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
                  have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
                  have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
                  have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
                  have h11 : 0 ≤ t ^ 11 := pow_nonneg ht0 11
                  have h12 : 0 ≤ t ^ 12 := pow_nonneg ht0 12
                  linear_combination hc + ((3989242419679284398619813837891:ℝ)/122070312500000000000000000000) * h1 + ((90122360738125442033547775377:ℝ)/488281250000000000000000000) * h2 + ((26220304083852831651288357:ℝ)/97656250000000000000000) * h3 + ((1185529783276225159203501:ℝ)/781250000000000000000) * h4 + ((2701565871009848358723:ℝ)/976562500000000000) * h5 + ((9116643493218791799:ℝ)/3906250000000000) * h6 + ((41744941192389933:ℝ)/3906250000000) * h7 + ((160474653679059:ℝ)/12500000000) * h8 + ((49352403573:ℝ)/6250000) * h9 + ((341672337:ℝ)/125000) * h10 + ((69741:ℝ)/125) * h11 + (81:ℝ) * h12

lemma PH_pos (s : ℝ) (h0 : ((1:ℝ)/2) ≤ s) (h1 : s ≤ ((289:ℝ)/500)) :
    0 < (-1:ℝ) + (24:ℝ) * s ^ 3 + (54:ℝ) * s ^ 4 + (-558:ℝ) * s ^ 6 + (162:ℝ) * s ^ 7 + (-243:ℝ) * s ^ 8 + (972:ℝ) * s ^ 9 + (3888:ℝ) * s ^ 10 + (-2916:ℝ) * s ^ 11 + (-7290:ℝ) * s ^ 12 + (4374:ℝ) * s ^ 13 + (2187:ℝ) * s ^ 14 + (24057:ℝ) * s ^ 15 + (-65610:ℝ) * s ^ 16 + (39366:ℝ) * s ^ 17 + (-19683:ℝ) * s ^ 18 + (78732:ℝ) * s ^ 19 + (-59049:ℝ) * s ^ 20 := by
  rcases le_total s ((539:ℝ)/1000) with h0a | h0a
  · have h0 : ((1:ℝ)/2) ≤ s := by linarith
    have h1 : s ≤ ((539:ℝ)/1000) := h0a
    obtain ⟨t, rfl⟩ : ∃ t, s = ((1:ℝ)/2) + t := ⟨s - ((1:ℝ)/2), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((39:ℝ)/1000) := by linarith
    have hc : (0:ℝ) < ((69625623211087221000681740278189213240364246201701424902151:ℝ)/1000000000000000000000000000000000000000000000000000000000000) := by norm_num
    have h1 : t ^ 1 ≤ ((39:ℝ)/1000) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
    have h2 : t ^ 2 ≤ ((39:ℝ)/1000) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
    have h5 : t ^ 5 ≤ ((39:ℝ)/1000) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
    have h6 : t ^ 6 ≤ ((39:ℝ)/1000) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
    have h7 : t ^ 7 ≤ ((39:ℝ)/1000) ^ 7 := pow_le_pow_left₀ ht0 ht1 7
    have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
    have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
    have h10 : 0 ≤ t ^ 10 := pow_nonneg ht0 10
    have h11 : t ^ 11 ≤ ((39:ℝ)/1000) ^ 11 := pow_le_pow_left₀ ht0 ht1 11
    have h12 : t ^ 12 ≤ ((39:ℝ)/1000) ^ 12 := pow_le_pow_left₀ ht0 ht1 12
    have h13 : t ^ 13 ≤ ((39:ℝ)/1000) ^ 13 := pow_le_pow_left₀ ht0 ht1 13
    have h14 : t ^ 14 ≤ ((39:ℝ)/1000) ^ 14 := pow_le_pow_left₀ ht0 ht1 14
    have h15 : t ^ 15 ≤ ((39:ℝ)/1000) ^ 15 := pow_le_pow_left₀ ht0 ht1 15
    have h16 : t ^ 16 ≤ ((39:ℝ)/1000) ^ 16 := pow_le_pow_left₀ ht0 ht1 16
    have h17 : t ^ 17 ≤ ((39:ℝ)/1000) ^ 17 := pow_le_pow_left₀ ht0 ht1 17
    have h18 : t ^ 18 ≤ ((39:ℝ)/1000) ^ 18 := pow_le_pow_left₀ ht0 ht1 18
    have h19 : t ^ 19 ≤ ((39:ℝ)/1000) ^ 19 := pow_le_pow_left₀ ht0 ht1 19
    have h20 : t ^ 20 ≤ ((39:ℝ)/1000) ^ 20 := pow_le_pow_left₀ ht0 ht1 20
    linear_combination hc + ((321453:ℝ)/131072) * h1 + ((1584153:ℝ)/131072) * h2 + ((5467737:ℝ)/32768) * h3 + ((27112347:ℝ)/65536) * h4 + ((4971159:ℝ)/2048) * h5 + ((23937723:ℝ)/2048) * h6 + ((4145013:ℝ)/512) * h7 + ((142009443:ℝ)/2048) * h8 + ((66205593:ℝ)/256) * h9 + ((96509637:ℝ)/256) * h10 + ((11031957:ℝ)/64) * h11 + ((279528489:ℝ)/128) * h12 + ((45920439:ℝ)/8) * h13 + ((74850075:ℝ)/8) * h14 + ((21412917:ℝ)/2) * h15 + ((141251769:ℝ)/16) * h16 + ((10372941:ℝ)/2) * h17 + ((4153113:ℝ)/2) * h18 + (511758:ℝ) * h19 + (59049:ℝ) * h20
  · have h0 : ((539:ℝ)/1000) ≤ s := h0a
    rcases le_total s ((279:ℝ)/500) with h1a | h1a
    · have h0 : ((539:ℝ)/1000) ≤ s := by linarith
      have h1 : s ≤ ((279:ℝ)/500) := h1a
      obtain ⟨t, rfl⟩ : ∃ t, s = ((539:ℝ)/1000) + t := ⟨s - ((539:ℝ)/1000), by ring⟩
      have ht0 : 0 ≤ t := by linarith
      have ht1 : t ≤ ((19:ℝ)/1000) := by linarith
      have hc : (0:ℝ) < ((7898008912593805126046431687551632016516628980081632916899:ℝ)/250000000000000000000000000000000000000000000000000000000000) := by norm_num
      have h1 : t ^ 1 ≤ ((19:ℝ)/1000) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
      have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
      have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
      have h4 : t ^ 4 ≤ ((19:ℝ)/1000) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
      have h5 : t ^ 5 ≤ ((19:ℝ)/1000) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
      have h6 : t ^ 6 ≤ ((19:ℝ)/1000) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
      have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
      have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
      have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
      have h10 : t ^ 10 ≤ ((19:ℝ)/1000) ^ 10 := pow_le_pow_left₀ ht0 ht1 10
      have h11 : t ^ 11 ≤ ((19:ℝ)/1000) ^ 11 := pow_le_pow_left₀ ht0 ht1 11
      have h12 : t ^ 12 ≤ ((19:ℝ)/1000) ^ 12 := pow_le_pow_left₀ ht0 ht1 12
      have h13 : t ^ 13 ≤ ((19:ℝ)/1000) ^ 13 := pow_le_pow_left₀ ht0 ht1 13
      have h14 : t ^ 14 ≤ ((19:ℝ)/1000) ^ 14 := pow_le_pow_left₀ ht0 ht1 14
      have h15 : t ^ 15 ≤ ((19:ℝ)/1000) ^ 15 := pow_le_pow_left₀ ht0 ht1 15
      have h16 : t ^ 16 ≤ ((19:ℝ)/1000) ^ 16 := pow_le_pow_left₀ ht0 ht1 16
      have h17 : t ^ 17 ≤ ((19:ℝ)/1000) ^ 17 := pow_le_pow_left₀ ht0 ht1 17
      have h18 : t ^ 18 ≤ ((19:ℝ)/1000) ^ 18 := pow_le_pow_left₀ ht0 ht1 18
      have h19 : t ^ 19 ≤ ((19:ℝ)/1000) ^ 19 := pow_le_pow_left₀ ht0 ht1 19
      have h20 : t ^ 20 ≤ ((19:ℝ)/1000) ^ 20 := pow_le_pow_left₀ ht0 ht1 20
      linear_combination hc + ((128508571281642153402827183010238496083713140918095083891:ℝ)/50000000000000000000000000000000000000000000000000000000) * h1 + ((935956644467206660808015966052593558654438935190371389:ℝ)/100000000000000000000000000000000000000000000000000000) * h2 + ((9019517173414756620205286908499783892571077704012253:ℝ)/50000000000000000000000000000000000000000000000000) * h3 + ((65734200146952660372505139857521039472082958061041:ℝ)/200000000000000000000000000000000000000000000000) * h4 + ((319202903335195521054882285733260418279335518619:ℝ)/62500000000000000000000000000000000000000000) * h5 + ((237235496270629602939375219963644357382693321:ℝ)/25000000000000000000000000000000000000000) * h6 + ((375696257139642132245470131980916145680861:ℝ)/12500000000000000000000000000000000000) * h7 + ((18095433261891358587334101946765214355987:ℝ)/100000000000000000000000000000000000) * h8 + ((8783375556960691441601488750354181211:ℝ)/25000000000000000000000000000000) * h9 + ((9598629937052721234822588759000861:ℝ)/250000000000000000000000000000) * h10 + ((52873353279227468286236514042909:ℝ)/25000000000000000000000000) * h11 + ((671820804929658688737671803293:ℝ)/100000000000000000000000) * h12 + ((161024010364794475806442299:ℝ)/12500000000000000000) * h13 + ((436382964072946821366441:ℝ)/25000000000000000) * h14 + ((1087082236634354817219:ℝ)/62500000000000) * h15 + ((2556036992265830721:ℝ)/200000000000) * h16 + ((339065496123867:ℝ)/50000000) * h17 + ((247283374851:ℝ)/100000) * h18 + ((27890811:ℝ)/50) * h19 + (59049:ℝ) * h20
    · have h0 : ((279:ℝ)/500) ≤ s := h1a
      rcases le_total s ((71:ℝ)/125) with h2a | h2a
      · have h0 : ((279:ℝ)/500) ≤ s := by linarith
        have h1 : s ≤ ((71:ℝ)/125) := h2a
        obtain ⟨t, rfl⟩ : ∃ t, s = ((279:ℝ)/500) + t := ⟨s - ((279:ℝ)/500), by ring⟩
        have ht0 : 0 ≤ t := by linarith
        have ht1 : t ≤ ((1:ℝ)/100) := by linarith
        have hc : (0:ℝ) < ((3786756898166399189684818416505201806053421750941969:ℝ)/238418579101562500000000000000000000000000000000000000) := by norm_num
        have h1 : t ^ 1 ≤ ((1:ℝ)/100) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
        have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
        have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
        have h4 : t ^ 4 ≤ ((1:ℝ)/100) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
        have h5 : t ^ 5 ≤ ((1:ℝ)/100) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
        have h6 : t ^ 6 ≤ ((1:ℝ)/100) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
        have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
        have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
        have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
        have h10 : t ^ 10 ≤ ((1:ℝ)/100) ^ 10 := pow_le_pow_left₀ ht0 ht1 10
        have h11 : t ^ 11 ≤ ((1:ℝ)/100) ^ 11 := pow_le_pow_left₀ ht0 ht1 11
        have h12 : t ^ 12 ≤ ((1:ℝ)/100) ^ 12 := pow_le_pow_left₀ ht0 ht1 12
        have h13 : t ^ 13 ≤ ((1:ℝ)/100) ^ 13 := pow_le_pow_left₀ ht0 ht1 13
        have h14 : t ^ 14 ≤ ((1:ℝ)/100) ^ 14 := pow_le_pow_left₀ ht0 ht1 14
        have h15 : t ^ 15 ≤ ((1:ℝ)/100) ^ 15 := pow_le_pow_left₀ ht0 ht1 15
        have h16 : t ^ 16 ≤ ((1:ℝ)/100) ^ 16 := pow_le_pow_left₀ ht0 ht1 16
        have h17 : t ^ 17 ≤ ((1:ℝ)/100) ^ 17 := pow_le_pow_left₀ ht0 ht1 17
        have h18 : t ^ 18 ≤ ((1:ℝ)/100) ^ 18 := pow_le_pow_left₀ ht0 ht1 18
        have h19 : t ^ 19 ≤ ((1:ℝ)/100) ^ 19 := pow_le_pow_left₀ ht0 ht1 19
        have h20 : t ^ 20 ≤ ((1:ℝ)/100) ^ 20 := pow_le_pow_left₀ ht0 ht1 20
        linear_combination hc + ((193750402327964878682727336919350315297545059835331:ℝ)/95367431640625000000000000000000000000000000000000) * h1 + ((7081173318236634035128393772843373994169703733509:ℝ)/381469726562500000000000000000000000000000000000) * h2 + ((51817317772152623309204536920320039099773181013:ℝ)/381469726562500000000000000000000000000000000) * h3 + ((2613128663128801819608299268028800249498234801:ℝ)/3051757812500000000000000000000000000000000) * h4 + ((11226632432366626610466719912709325235964219:ℝ)/1907348632812500000000000000000000000000) * h5 + ((5286078453034205498805111410274790012161:ℝ)/1525878906250000000000000000000000000) * h6 + ((94589053748480250480688907630025055941:ℝ)/1525878906250000000000000000000000) * h7 + ((5799276196603465019326800076879151427:ℝ)/24414062500000000000000000000000) * h8 + ((3547599071779992683216032305559371:ℝ)/12207031250000000000000000000) * h9 + ((163126280073320323002190163923461:ℝ)/244140625000000000000000000) * h10 + ((198058167864223475005981038069:ℝ)/48828125000000000000000) * h11 + ((4113627481975944290809575933:ℝ)/390625000000000000000) * h12 + ((1780817861262790665353979:ℝ)/97656250000000000) * h13 + ((8983860276689958377601:ℝ)/390625000000000) * h14 + ((42237405374388727419:ℝ)/1953125000000) * h15 + ((188885935376462961:ℝ)/12500000000) * h16 + ((47886970856427:ℝ)/6250000) * h17 + ((66956389371:ℝ)/25000) * h18 + ((14506371:ℝ)/25) * h19 + (59049:ℝ) * h20
      · have h0 : ((71:ℝ)/125) ≤ s := h2a
        obtain ⟨t, rfl⟩ : ∃ t, s = ((71:ℝ)/125) + t := ⟨s - ((71:ℝ)/125), by ring⟩
        have ht0 : 0 ≤ t := by linarith
        have ht1 : t ≤ ((1:ℝ)/100) := by linarith
        have hc : (0:ℝ) < ((1553987503599954433681149256906118515468796203312151:ℝ)/953674316406250000000000000000000000000000000000000000) := by norm_num
        have h1 : t ^ 1 ≤ ((1:ℝ)/100) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
        have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
        have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
        have h4 : t ^ 4 ≤ ((1:ℝ)/100) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
        have h5 : t ^ 5 ≤ ((1:ℝ)/100) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
        have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
        have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
        have h8 : 0 ≤ t ^ 8 := pow_nonneg ht0 8
        have h9 : 0 ≤ t ^ 9 := pow_nonneg ht0 9
        have h10 : t ^ 10 ≤ ((1:ℝ)/100) ^ 10 := pow_le_pow_left₀ ht0 ht1 10
        have h11 : t ^ 11 ≤ ((1:ℝ)/100) ^ 11 := pow_le_pow_left₀ ht0 ht1 11
        have h12 : t ^ 12 ≤ ((1:ℝ)/100) ^ 12 := pow_le_pow_left₀ ht0 ht1 12
        have h13 : t ^ 13 ≤ ((1:ℝ)/100) ^ 13 := pow_le_pow_left₀ ht0 ht1 13
        have h14 : t ^ 14 ≤ ((1:ℝ)/100) ^ 14 := pow_le_pow_left₀ ht0 ht1 14
        have h15 : t ^ 15 ≤ ((1:ℝ)/100) ^ 15 := pow_le_pow_left₀ ht0 ht1 15
        have h16 : t ^ 16 ≤ ((1:ℝ)/100) ^ 16 := pow_le_pow_left₀ ht0 ht1 16
        have h17 : t ^ 17 ≤ ((1:ℝ)/100) ^ 17 := pow_le_pow_left₀ ht0 ht1 17
        have h18 : t ^ 18 ≤ ((1:ℝ)/100) ^ 18 := pow_le_pow_left₀ ht0 ht1 18
        have h19 : t ^ 19 ≤ ((1:ℝ)/100) ^ 19 := pow_le_pow_left₀ ht0 ht1 19
        have h20 : t ^ 20 ≤ ((1:ℝ)/100) ^ 20 := pow_le_pow_left₀ ht0 ht1 20
        linear_combination hc + ((2252827101278473515951108708791158266951:ℝ)/1387778780781445675529539585113525390625) * h1 + ((244970111641220366641946176532935637043:ℝ)/11102230246251565404236316680908203125) * h2 + ((8495689960380820535916694395757208673:ℝ)/88817841970012523233890533447265625) * h3 + ((819558770954111366874959119717298151:ℝ)/710542735760100185871124267578125) * h4 + ((169109666895740833378751727783395871:ℝ)/28421709430404007434844970703125) * h5 + ((71073654869240676462962116581012:ℝ)/45474735088646411895751953125) * h6 + ((29811325842762569341813380151269:ℝ)/363797880709171295166015625) * h7 + ((756593433941934904887132972279:ℝ)/2910383045673370361328125) * h8 + ((4634298988060448367704311857:ℝ)/23283064365386962890625) * h9 + ((1107628216570524849239039094:ℝ)/931322574615478515625) * h10 + ((8152199580947627766964023:ℝ)/1490116119384765625) * h11 + ((156413537679441082597416:ℝ)/11920928955078125) * h12 + ((2068625017909801839411:ℝ)/95367431640625) * h13 + ((20163832300643607108:ℝ)/762939453125) * h14 + ((736990405635546171:ℝ)/30517578125) * h15 + ((803464007596236:ℝ)/48828125) * h16 + ((3185152739892:ℝ)/390625) * h17 + ((8717581017:ℝ)/3125) * h18 + ((14801616:ℝ)/25) * h19 + (59049:ℝ) * h20

lemma Td_pos (w : ℝ) (h0 : (0:ℝ) ≤ w) (h1 : w ≤ (1:ℝ)) :
    0 < (432:ℝ) + (144:ℝ) * w ^ 1 + (-1116:ℝ) * w ^ 2 + (1044:ℝ) * w ^ 3 + (-1185:ℝ) * w ^ 4 + (1176:ℝ) * w ^ 5 + (-504:ℝ) * w ^ 6 + (72:ℝ) * w ^ 7 := by
  rcases le_total w ((1:ℝ)/2) with h0a | h0a
  · have h0 : (0:ℝ) ≤ w := by linarith
    have h1 : w ≤ ((1:ℝ)/2) := h0a
    obtain ⟨t, rfl⟩ : ∃ t, w = (0:ℝ) + t := ⟨w - (0:ℝ), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((1:ℝ)/2) := by linarith
    have hc : (0:ℝ) < ((1137:ℝ)/16) := by norm_num
    have h1 : 0 ≤ t ^ 1 := pow_nonneg ht0 1
    have h2 : t ^ 2 ≤ ((1:ℝ)/2) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : t ^ 4 ≤ ((1:ℝ)/2) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
    have h5 : 0 ≤ t ^ 5 := pow_nonneg ht0 5
    have h6 : t ^ 6 ≤ ((1:ℝ)/2) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
    have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
    linear_combination hc + (144:ℝ) * h1 + (1116:ℝ) * h2 + (1044:ℝ) * h3 + (1185:ℝ) * h4 + (1176:ℝ) * h5 + (504:ℝ) * h6 + (72:ℝ) * h7
  · have h0 : ((1:ℝ)/2) ≤ w := h0a
    rcases le_total w ((3:ℝ)/4) with h1a | h1a
    · have h0 : ((1:ℝ)/2) ≤ w := by linarith
      have h1 : w ≤ ((3:ℝ)/4) := h1a
      obtain ⟨t, rfl⟩ : ∃ t, w = ((1:ℝ)/2) + t := ⟨w - ((1:ℝ)/2), by ring⟩
      have ht0 : 0 ≤ t := by linarith
      have ht1 : t ≤ ((1:ℝ)/4) := by linarith
      have hc : (0:ℝ) < ((172017:ℝ)/1024) := by norm_num
      have h1 : t ^ 1 ≤ ((1:ℝ)/4) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
      have h2 : t ^ 2 ≤ ((1:ℝ)/4) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
      have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
      have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
      have h5 : 0 ≤ t ^ 5 := pow_nonneg ht0 5
      have h6 : t ^ 6 ≤ ((1:ℝ)/4) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
      have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
      linear_combination hc + ((4005:ℝ)/8) * h1 + ((1131:ℝ)/4) * h2 + ((1023:ℝ)/2) * h3 + (180:ℝ) * h4 + (42:ℝ) * h5 + (252:ℝ) * h6 + (72:ℝ) * h7
    · have h0 : ((3:ℝ)/4) ≤ w := h1a
      obtain ⟨t, rfl⟩ : ∃ t, w = ((3:ℝ)/4) + t := ⟨w - ((3:ℝ)/4), by ring⟩
      have ht0 : 0 ≤ t := by linarith
      have ht1 : t ≤ ((1:ℝ)/4) := by linarith
      have hc : (0:ℝ) < ((21819:ℝ)/512) := by norm_num
      have h1 : t ^ 1 ≤ ((1:ℝ)/4) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
      have h2 : 0 ≤ t ^ 2 := pow_nonneg ht0 2
      have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
      have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
      have h5 : t ^ 5 ≤ ((1:ℝ)/4) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
      have h6 : t ^ 6 ≤ ((1:ℝ)/4) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
      have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
      linear_combination hc + ((274113:ℝ)/512) * h1 + ((20691:ℝ)/128) * h2 + ((20763:ℝ)/32) * h3 + ((285:ℝ)/8) * h4 + ((483:ℝ)/2) * h5 + (126:ℝ) * h6 + (72:ℝ) * h7

lemma al9_pos (w : ℝ) (h0 : (0:ℝ) ≤ w) (h1 : w ≤ (1:ℝ)) :
    0 < (144:ℝ) + (-252:ℝ) * w ^ 2 + (72:ℝ) * w ^ 3 + (117:ℝ) * w ^ 4 + (-54:ℝ) * w ^ 5 + (-4:ℝ) * w ^ 6 + (3:ℝ) * w ^ 7 := by
  rcases le_total w ((1:ℝ)/2) with h0a | h0a
  · have h0 : (0:ℝ) ≤ w := by linarith
    have h1 : w ≤ ((1:ℝ)/2) := h0a
    obtain ⟨t, rfl⟩ : ∃ t, w = (0:ℝ) + t := ⟨w - (0:ℝ), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((1:ℝ)/2) := by linarith
    have hc : (0:ℝ) < ((317:ℝ)/4) := by norm_num
    have h2 : t ^ 2 ≤ ((1:ℝ)/2) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
    have h5 : t ^ 5 ≤ ((1:ℝ)/2) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
    have h6 : t ^ 6 ≤ ((1:ℝ)/2) ^ 6 := pow_le_pow_left₀ ht0 ht1 6
    have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
    linear_combination hc + (252:ℝ) * h2 + (72:ℝ) * h3 + (117:ℝ) * h4 + (54:ℝ) * h5 + (4:ℝ) * h6 + (3:ℝ) * h7
  · have h0 : ((1:ℝ)/2) ≤ w := h0a
    obtain ⟨t, rfl⟩ : ∃ t, w = ((1:ℝ)/2) + t := ⟨w - ((1:ℝ)/2), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((1:ℝ)/2) := by linarith
    have hc : (0:ℝ) < ((631:ℝ)/128) := by norm_num
    have h1 : t ^ 1 ≤ ((1:ℝ)/2) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
    have h2 : t ^ 2 ≤ ((1:ℝ)/2) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : t ^ 4 ≤ ((1:ℝ)/2) ^ 4 := pow_le_pow_left₀ ht0 ht1 4
    have h5 : t ^ 5 ≤ ((1:ℝ)/2) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
    have h6 : 0 ≤ t ^ 6 := pow_nonneg ht0 6
    have h7 : 0 ≤ t ^ 7 := pow_nonneg ht0 7
    linear_combination hc + ((10035:ℝ)/64) * h1 + ((1209:ℝ)/32) * h2 + ((2681:ℝ)/16) * h3 + ((159:ℝ)/8) * h4 + ((201:ℝ)/4) * h5 + ((13:ℝ)/2) * h6 + (3:ℝ) * h7

lemma be3n_pos (w : ℝ) (h0 : (0:ℝ) ≤ w) (h1 : w ≤ (1:ℝ)) :
    0 < (48:ℝ) + (-60:ℝ) * w ^ 2 + (16:ℝ) * w ^ 3 + (15:ℝ) * w ^ 4 + (-4:ℝ) * w ^ 5 := by
  rcases le_total w ((1:ℝ)/2) with h0a | h0a
  · have h0 : (0:ℝ) ≤ w := by linarith
    have h1 : w ≤ ((1:ℝ)/2) := h0a
    obtain ⟨t, rfl⟩ : ∃ t, w = (0:ℝ) + t := ⟨w - (0:ℝ), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((1:ℝ)/2) := by linarith
    have hc : (0:ℝ) < ((263:ℝ)/8) := by norm_num
    have h2 : t ^ 2 ≤ ((1:ℝ)/2) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
    have h5 : t ^ 5 ≤ ((1:ℝ)/2) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
    linear_combination hc + (60:ℝ) * h2 + (16:ℝ) * h3 + (15:ℝ) * h4 + (4:ℝ) * h5
  · have h0 : ((1:ℝ)/2) ≤ w := h0a
    obtain ⟨t, rfl⟩ : ∃ t, w = ((1:ℝ)/2) + t := ⟨w - ((1:ℝ)/2), by ring⟩
    have ht0 : 0 ≤ t := by linarith
    have ht1 : t ≤ ((1:ℝ)/2) := by linarith
    have hc : (0:ℝ) < ((163:ℝ)/16) := by norm_num
    have h1 : t ^ 1 ≤ ((1:ℝ)/2) ^ 1 := pow_le_pow_left₀ ht0 ht1 1
    have h2 : t ^ 2 ≤ ((1:ℝ)/2) ^ 2 := pow_le_pow_left₀ ht0 ht1 2
    have h3 : 0 ≤ t ^ 3 := pow_nonneg ht0 3
    have h4 : 0 ≤ t ^ 4 := pow_nonneg ht0 4
    have h5 : t ^ 5 ≤ ((1:ℝ)/2) ^ 5 := pow_le_pow_left₀ ht0 ht1 5
    linear_combination hc + ((167:ℝ)/4) * h1 + ((37:ℝ)/2) * h2 + (36:ℝ) * h3 + (5:ℝ) * h4 + (4:ℝ) * h5

end FlexPolyC

open FlexPolyC

theorem solution :
    (∀ s : ℝ, (0:ℝ) ≤ s → s ≤ ((289:ℝ)/500) →
      0 < (8:ℝ) + (36:ℝ) * s ^ 1 + (54:ℝ) * s ^ 2 + (-429:ℝ) * s ^ 3 + (162:ℝ) * s ^ 5 + (1314:ℝ) * s ^ 6 + (-648:ℝ) * s ^ 7 + (-486:ℝ) * s ^ 8 + (-1053:ℝ) * s ^ 9 + (972:ℝ) * s ^ 10 + (81:ℝ) * s ^ 12) ∧
    (∀ s : ℝ, ((1:ℝ)/2) ≤ s → s ≤ ((289:ℝ)/500) →
      0 < (-1:ℝ) + (24:ℝ) * s ^ 3 + (54:ℝ) * s ^ 4 + (-558:ℝ) * s ^ 6 + (162:ℝ) * s ^ 7 + (-243:ℝ) * s ^ 8 + (972:ℝ) * s ^ 9 + (3888:ℝ) * s ^ 10 + (-2916:ℝ) * s ^ 11 + (-7290:ℝ) * s ^ 12 + (4374:ℝ) * s ^ 13 + (2187:ℝ) * s ^ 14 + (24057:ℝ) * s ^ 15 + (-65610:ℝ) * s ^ 16 + (39366:ℝ) * s ^ 17 + (-19683:ℝ) * s ^ 18 + (78732:ℝ) * s ^ 19 + (-59049:ℝ) * s ^ 20) ∧
    (∀ w : ℝ, (0:ℝ) ≤ w → w ≤ (1:ℝ) →
      0 < (432:ℝ) + (144:ℝ) * w ^ 1 + (-1116:ℝ) * w ^ 2 + (1044:ℝ) * w ^ 3 + (-1185:ℝ) * w ^ 4 + (1176:ℝ) * w ^ 5 + (-504:ℝ) * w ^ 6 + (72:ℝ) * w ^ 7) ∧
    (∀ w : ℝ, (0:ℝ) ≤ w → w ≤ (1:ℝ) →
      0 < (144:ℝ) + (-252:ℝ) * w ^ 2 + (72:ℝ) * w ^ 3 + (117:ℝ) * w ^ 4 + (-54:ℝ) * w ^ 5 + (-4:ℝ) * w ^ 6 + (3:ℝ) * w ^ 7) ∧
    (∀ w : ℝ, (0:ℝ) ≤ w → w ≤ (1:ℝ) →
      0 < (48:ℝ) + (-60:ℝ) * w ^ 2 + (16:ℝ) * w ^ 3 + (15:ℝ) * w ^ 4 + (-4:ℝ) * w ^ 5) :=
  ⟨P12_pos, PH_pos, Td_pos, al9_pos, be3n_pos⟩
