-- Prove2me | solution 1 for WorkbookSource.base_31921
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T05:28:48.75596+00:00
-- url     : https://prove2.me/submissions/42a0099f-c94b-4a59-96b9-9b215d43bd1a

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) : (5 * a ^ 2 / (b ^ 2 + 3 * b * c + c ^ 2) + 9 * b ^ 2 / (2 * c ^ 2 + 5 * c * a + 2 * a ^ 2) + 13 * c ^ 2 / (3 * a ^ 2 + 7 * a * b + 3 * b ^ 2)) ≥ 3  := by
  have hp : 0 ≤ (30*a^6 + 70*a^5*b + 75*a^5*c + 12*a^4*b^2 + 121*a^4*b*c + 12*a^4*c^2 - 42*a^3*b^3 - 96*a^3*b^2*c - 107*a^3*b*c^2 - 45*a^3*c^3 + 9*a^2*b^4 - 78*a^2*b^3*c - 268*a^2*b^2*c^2 - 81*a^2*b*c^3 + 8*a^2*c^4 + 63*a*b^5 + 144*a*b^4*c - 114*a*b^3*c^2 - 106*a*b^2*c^3 + 153*a*b*c^4 + 65*a*c^5 + 27*b^6 + 81*b^5*c + 9*b^4*c^2 - 54*b^3*c^3 + 8*b^2*c^4 + 78*b*c^5 + 26*c^6) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (b - a) := by linarith
        have hdiff2 : 0 ≤ (c - b) := by linarith
        have hpos : 0 ≤ (1490 : ℝ) * a^4 * (b - a)^2 + (1495 : ℝ) * a^4 * (b - a)^1 * (c - b)^1 + (1508 : ℝ) * a^4 * (c - b)^2 + (3620 : ℝ) * a^3 * (b - a)^3 + (5440 : ℝ) * a^3 * (b - a)^2 * (c - b)^1 + (6500 : ℝ) * a^3 * (b - a)^1 * (c - b)^2 + (2340 : ℝ) * a^3 * (c - b)^3 + (3240 : ℝ) * a^2 * (b - a)^4 + (6465 : ℝ) * a^2 * (b - a)^3 * (c - b)^1 + (9335 : ℝ) * a^2 * (b - a)^2 * (c - b)^2 + (6097 : ℝ) * a^2 * (b - a)^1 * (c - b)^3 + (1274 : ℝ) * a^2 * (c - b)^4 + (1255 : ℝ) * a^1 * (b - a)^5 + (3110 : ℝ) * a^1 * (b - a)^4 * (c - b)^1 + (5396 : ℝ) * a^1 * (b - a)^3 * (c - b)^2 + (4990 : ℝ) * a^1 * (b - a)^2 * (c - b)^3 + (2054 : ℝ) * a^1 * (b - a)^1 * (c - b)^4 + (299 : ℝ) * a^1 * (c - b)^5 + (175 : ℝ) * (b - a)^6 + (515 : ℝ) * (b - a)^5 * (c - b)^1 + (1065 : ℝ) * (b - a)^4 * (c - b)^2 + (1278 : ℝ) * (b - a)^3 * (c - b)^3 + (788 : ℝ) * (b - a)^2 * (c - b)^4 + (234 : ℝ) * (b - a)^1 * (c - b)^5 + (26 : ℝ) * (c - b)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - a) := by linarith
          have hdiff2 : 0 ≤ (b - c) := by linarith
          have hpos : 0 ≤ (1490 : ℝ) * a^4 * (c - a)^2 + (1485 : ℝ) * a^4 * (c - a)^1 * (b - c)^1 + (1503 : ℝ) * a^4 * (b - c)^2 + (3620 : ℝ) * a^3 * (c - a)^3 + (5420 : ℝ) * a^3 * (c - a)^2 * (b - c)^1 + (6480 : ℝ) * a^3 * (c - a)^1 * (b - c)^2 + (2340 : ℝ) * a^3 * (b - c)^3 + (3240 : ℝ) * a^2 * (c - a)^4 + (6495 : ℝ) * a^2 * (c - a)^3 * (b - c)^1 + (9380 : ℝ) * a^2 * (c - a)^2 * (b - c)^2 + (6138 : ℝ) * a^2 * (c - a)^1 * (b - c)^3 + (1287 : ℝ) * a^2 * (b - c)^4 + (1255 : ℝ) * a^1 * (c - a)^5 + (3165 : ℝ) * a^1 * (c - a)^4 * (b - c)^1 + (5506 : ℝ) * a^1 * (c - a)^3 * (b - c)^2 + (5088 : ℝ) * a^1 * (c - a)^2 * (b - c)^3 + (2097 : ℝ) * a^1 * (c - a)^1 * (b - c)^4 + (306 : ℝ) * a^1 * (b - c)^5 + (175 : ℝ) * (c - a)^6 + (535 : ℝ) * (c - a)^5 * (b - c)^1 + (1115 : ℝ) * (c - a)^4 * (b - c)^2 + (1332 : ℝ) * (c - a)^3 * (b - c)^3 + (819 : ℝ) * (c - a)^2 * (b - c)^4 + (243 : ℝ) * (c - a)^1 * (b - c)^5 + (27 : ℝ) * (b - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (a - c) := by linarith
          have hdiff2 : 0 ≤ (b - a) := by linarith
          have hpos : 0 ≤ (1508 : ℝ) * c^4 * (a - c)^2 + (1521 : ℝ) * c^4 * (a - c)^1 * (b - a)^1 + (1503 : ℝ) * c^4 * (b - a)^2 + (3692 : ℝ) * c^3 * (a - c)^3 + (5564 : ℝ) * c^3 * (a - c)^2 * (b - a)^1 + (6552 : ℝ) * c^3 * (a - c)^1 * (b - a)^2 + (2340 : ℝ) * c^3 * (b - a)^3 + (3302 : ℝ) * c^2 * (a - c)^4 + (6565 : ℝ) * c^2 * (a - c)^3 * (b - a)^1 + (9326 : ℝ) * c^2 * (a - c)^2 * (b - a)^2 + (6030 : ℝ) * c^2 * (a - c)^1 * (b - a)^3 + (1287 : ℝ) * c^2 * (b - a)^4 + (1261 : ℝ) * c^1 * (a - c)^5 + (3081 : ℝ) * c^1 * (a - c)^4 * (b - a)^1 + (5244 : ℝ) * c^1 * (a - c)^3 * (b - a)^2 + (4800 : ℝ) * c^1 * (a - c)^2 * (b - a)^3 + (2007 : ℝ) * c^1 * (a - c)^1 * (b - a)^4 + (306 : ℝ) * c^1 * (b - a)^5 + (169 : ℝ) * (a - c)^6 + (481 : ℝ) * (a - c)^5 * (b - a)^1 + (975 : ℝ) * (a - c)^4 * (b - a)^2 + (1164 : ℝ) * (a - c)^3 * (b - a)^3 + (729 : ℝ) * (a - c)^2 * (b - a)^4 + (225 : ℝ) * (a - c)^1 * (b - a)^5 + (27 : ℝ) * (b - a)^6 := by positivity
          convert hpos using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        have hdiff1 : 0 ≤ (a - b) := by linarith
        have hdiff2 : 0 ≤ (c - a) := by linarith
        have hpos : 0 ≤ (1503 : ℝ) * b^4 * (a - b)^2 + (1521 : ℝ) * b^4 * (a - b)^1 * (c - a)^1 + (1508 : ℝ) * b^4 * (c - a)^2 + (3672 : ℝ) * b^3 * (a - b)^3 + (5544 : ℝ) * b^3 * (a - b)^2 * (c - a)^1 + (6552 : ℝ) * b^3 * (a - b)^1 * (c - a)^2 + (2340 : ℝ) * b^3 * (c - a)^3 + (3285 : ℝ) * b^2 * (a - b)^4 + (6516 : ℝ) * b^2 * (a - b)^3 * (c - a)^1 + (9296 : ℝ) * b^2 * (a - b)^2 * (c - a)^2 + (6019 : ℝ) * b^2 * (a - b)^1 * (c - a)^3 + (1274 : ℝ) * b^2 * (c - a)^4 + (1260 : ℝ) * b^1 * (a - b)^5 + (3051 : ℝ) * b^1 * (a - b)^4 * (c - a)^1 + (5208 : ℝ) * b^1 * (a - b)^3 * (c - a)^2 + (4782 : ℝ) * b^1 * (a - b)^2 * (c - a)^3 + (1989 : ℝ) * b^1 * (a - b)^1 * (c - a)^4 + (299 : ℝ) * b^1 * (c - a)^5 + (171 : ℝ) * (a - b)^6 + (477 : ℝ) * (a - b)^5 * (c - a)^1 + (965 : ℝ) * (a - b)^4 * (c - a)^2 + (1157 : ℝ) * (a - b)^3 * (c - a)^3 + (723 : ℝ) * (a - b)^2 * (c - a)^4 + (221 : ℝ) * (a - b)^1 * (c - a)^5 + (26 : ℝ) * (c - a)^6 := by positivity
        convert hpos using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          have hdiff1 : 0 ≤ (c - b) := by linarith
          have hdiff2 : 0 ≤ (a - c) := by linarith
          have hpos : 0 ≤ (1503 : ℝ) * b^4 * (c - b)^2 + (1485 : ℝ) * b^4 * (c - b)^1 * (a - c)^1 + (1490 : ℝ) * b^4 * (a - c)^2 + (3672 : ℝ) * b^3 * (c - b)^3 + (5472 : ℝ) * b^3 * (c - b)^2 * (a - c)^1 + (6480 : ℝ) * b^3 * (c - b)^1 * (a - c)^2 + (2340 : ℝ) * b^3 * (a - c)^3 + (3285 : ℝ) * b^2 * (c - b)^4 + (6624 : ℝ) * b^2 * (c - b)^3 * (a - c)^1 + (9458 : ℝ) * b^2 * (c - b)^2 * (a - c)^2 + (6165 : ℝ) * b^2 * (c - b)^1 * (a - c)^3 + (1320 : ℝ) * b^2 * (a - c)^4 + (1260 : ℝ) * b^1 * (c - b)^5 + (3249 : ℝ) * b^1 * (c - b)^4 * (a - c)^1 + (5604 : ℝ) * b^1 * (c - b)^3 * (a - c)^2 + (5136 : ℝ) * b^1 * (c - b)^2 * (a - c)^3 + (2145 : ℝ) * b^1 * (c - b)^1 * (a - c)^4 + (325 : ℝ) * b^1 * (a - c)^5 + (171 : ℝ) * (c - b)^6 + (549 : ℝ) * (c - b)^5 * (a - c)^1 + (1145 : ℝ) * (c - b)^4 * (a - c)^2 + (1353 : ℝ) * (c - b)^3 * (a - c)^3 + (837 : ℝ) * (c - b)^2 * (a - c)^4 + (255 : ℝ) * (c - b)^1 * (a - c)^5 + (30 : ℝ) * (a - c)^6 := by positivity
          convert hpos using 1 <;> ring
        ·
          have hdiff1 : 0 ≤ (b - c) := by linarith
          have hdiff2 : 0 ≤ (a - b) := by linarith
          have hpos : 0 ≤ (1508 : ℝ) * c^4 * (b - c)^2 + (1495 : ℝ) * c^4 * (b - c)^1 * (a - b)^1 + (1490 : ℝ) * c^4 * (a - b)^2 + (3692 : ℝ) * c^3 * (b - c)^3 + (5512 : ℝ) * c^3 * (b - c)^2 * (a - b)^1 + (6500 : ℝ) * c^3 * (b - c)^1 * (a - b)^2 + (2340 : ℝ) * c^3 * (a - b)^3 + (3302 : ℝ) * c^2 * (b - c)^4 + (6643 : ℝ) * c^2 * (b - c)^3 * (a - b)^1 + (9443 : ℝ) * c^2 * (b - c)^2 * (a - b)^2 + (6135 : ℝ) * c^2 * (b - c)^1 * (a - b)^3 + (1320 : ℝ) * c^2 * (a - b)^4 + (1261 : ℝ) * c^1 * (b - c)^5 + (3224 : ℝ) * c^1 * (b - c)^4 * (a - b)^1 + (5530 : ℝ) * c^1 * (b - c)^3 * (a - b)^2 + (5056 : ℝ) * c^1 * (b - c)^2 * (a - b)^3 + (2120 : ℝ) * c^1 * (b - c)^1 * (a - b)^4 + (325 : ℝ) * c^1 * (a - b)^5 + (169 : ℝ) * (b - c)^6 + (533 : ℝ) * (b - c)^5 * (a - b)^1 + (1105 : ℝ) * (b - c)^4 * (a - b)^2 + (1306 : ℝ) * (b - c)^3 * (a - b)^3 + (812 : ℝ) * (b - c)^2 * (a - b)^4 + (250 : ℝ) * (b - c)^1 * (a - b)^5 + (30 : ℝ) * (a - b)^6 := by positivity
          convert hpos using 1 <;> ring
  have hn : 0 ≤ (30*a^6 + 70*a^5*b + 75*a^5*c + 12*a^4*b^2 + 121*a^4*b*c + 12*a^4*c^2 - 42*a^3*b^3 - 96*a^3*b^2*c - 107*a^3*b*c^2 - 45*a^3*c^3 + 9*a^2*b^4 - 78*a^2*b^3*c - 268*a^2*b^2*c^2 - 81*a^2*b*c^3 + 8*a^2*c^4 + 63*a*b^5 + 144*a*b^4*c - 114*a*b^3*c^2 - 106*a*b^2*c^3 + 153*a*b*c^4 + 65*a*c^5 + 27*b^6 + 81*b^5*c + 9*b^4*c^2 - 54*b^3*c^3 + 8*b^2*c^4 + 78*b*c^5 + 26*c^6) := by nlinarith only [hp]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c), (5 * a ^ 2 / (b ^ 2 + 3 * b * c + c ^ 2) + 9 * b ^ 2 / (2 * c ^ 2 + 5 * c * a + 2 * a ^ 2) + 13 * c ^ 2 / (3 * a ^ 2 + 7 * a * b + 3 * b ^ 2)) ≥ 3) := @solution
#print axioms solution
