-- Prove2me | solution 1 for WorkbookSource.base_53020
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T01:17:28.504583+00:00
-- url     : https://prove2.me/submissions/25615ed1-1b98-4c1d-92f1-ca8815429303

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 ≤ a) (hb : 0 ≤ b) (hc : 0 ≤ c) (hab : a + b + c = 2) : (a^2 + b^2 + c^2) * (a^2 + b^2) * (b^2 + c^2) * (c^2 + a^2) ≤ 4  := by
  have haux0 (a b c : ℝ) (hlow : 0 ≤ a) (hord1 : a ≤ b) (hord2 : b ≤ c) : 0 ≤ (a^8/64 + a^7*b/8 + a^7*c/8 - 9*a^6*b^2/16 + 7*a^6*b*c/8 - 9*a^6*c^2/16 + 7*a^5*b^3/8 + 21*a^5*b^2*c/8 + 21*a^5*b*c^2/8 + 7*a^5*c^3/8 - 29*a^4*b^4/32 + 35*a^4*b^3*c/8 + 41*a^4*b^2*c^2/16 + 35*a^4*b*c^3/8 - 29*a^4*c^4/32 + 7*a^3*b^5/8 + 35*a^3*b^4*c/8 + 35*a^3*b^3*c^2/4 + 35*a^3*b^2*c^3/4 + 35*a^3*b*c^4/8 + 7*a^3*c^5/8 - 9*a^2*b^6/16 + 21*a^2*b^5*c/8 + 41*a^2*b^4*c^2/16 + 35*a^2*b^3*c^3/4 + 41*a^2*b^2*c^4/16 + 21*a^2*b*c^5/8 - 9*a^2*c^6/16 + a*b^7/8 + 7*a*b^6*c/8 + 21*a*b^5*c^2/8 + 35*a*b^4*c^3/8 + 35*a*b^3*c^4/8 + 21*a*b^2*c^5/8 + 7*a*b*c^6/8 + a*c^7/8 + b^8/64 + b^7*c/8 - 9*b^6*c^2/16 + 7*b^5*c^3/8 - 29*b^4*c^4/32 + 7*b^3*c^5/8 - 9*b^2*c^6/16 + b*c^7/8 + c^8/64) := by
    have hdiff1 : 0 ≤ (b - a) := by linarith
    have hdiff2 : 0 ≤ (c - b) := by linarith
    have hpos : 0 ≤ (5025/64 : ℝ) * a^8 + (1675/4 : ℝ) * a^7 * (b - a)^1 + (1675/8 : ℝ) * a^7 * (c - b)^1 + (3855/4 : ℝ) * a^6 * (b - a)^2 + (3855/4 : ℝ) * a^6 * (b - a)^1 * (c - b)^1 + (3695/16 : ℝ) * a^6 * (c - b)^2 + (1245 : ℝ) * a^5 * (b - a)^3 + (3735/2 : ℝ) * a^5 * (b - a)^2 * (c - b)^1 + (3615/4 : ℝ) * a^5 * (b - a)^1 * (c - b)^2 + (1125/8 : ℝ) * a^5 * (c - b)^3 + (1959/2 : ℝ) * a^4 * (b - a)^4 + (1959 : ℝ) * a^4 * (b - a)^3 * (c - b)^1 + (5729/4 : ℝ) * a^4 * (b - a)^2 * (c - b)^2 + (1811/4 : ℝ) * a^4 * (b - a)^1 * (c - b)^3 + (1619/32 : ℝ) * a^4 * (c - b)^4 + (472 : ℝ) * a^3 * (b - a)^5 + (1180 : ℝ) * a^3 * (b - a)^4 * (c - b)^1 + (1158 : ℝ) * a^3 * (b - a)^3 * (c - b)^2 + (557 : ℝ) * a^3 * (b - a)^2 * (c - b)^3 + (521/4 : ℝ) * a^3 * (b - a)^1 * (c - b)^4 + (93/8 : ℝ) * a^3 * (c - b)^5 + (130 : ℝ) * a^2 * (b - a)^6 + (390 : ℝ) * a^2 * (b - a)^5 * (c - b)^1 + (482 : ℝ) * a^2 * (b - a)^4 * (c - b)^2 + (314 : ℝ) * a^2 * (b - a)^3 * (c - b)^3 + (461/4 : ℝ) * a^2 * (b - a)^2 * (c - b)^4 + (93/4 : ℝ) * a^2 * (b - a)^1 * (c - b)^5 + (31/16 : ℝ) * a^2 * (c - b)^6 + (16 : ℝ) * a^1 * (b - a)^7 + (56 : ℝ) * a^1 * (b - a)^6 * (c - b)^1 + (84 : ℝ) * a^1 * (b - a)^5 * (c - b)^2 + (70 : ℝ) * a^1 * (b - a)^4 * (c - b)^3 + (37 : ℝ) * a^1 * (b - a)^3 * (c - b)^4 + (27/2 : ℝ) * a^1 * (b - a)^2 * (c - b)^5 + (13/4 : ℝ) * a^1 * (b - a)^1 * (c - b)^6 + (3/8 : ℝ) * a^1 * (c - b)^7 + (1/2 : ℝ) * (b - a)^4 * (c - b)^4 + (1 : ℝ) * (b - a)^3 * (c - b)^5 + (3/4 : ℝ) * (b - a)^2 * (c - b)^6 + (1/4 : ℝ) * (b - a)^1 * (c - b)^7 + (1/64 : ℝ) * (c - b)^8 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (a^8/64 + a^7*b/8 + a^7*c/8 - 9*a^6*b^2/16 + 7*a^6*b*c/8 - 9*a^6*c^2/16 + 7*a^5*b^3/8 + 21*a^5*b^2*c/8 + 21*a^5*b*c^2/8 + 7*a^5*c^3/8 - 29*a^4*b^4/32 + 35*a^4*b^3*c/8 + 41*a^4*b^2*c^2/16 + 35*a^4*b*c^3/8 - 29*a^4*c^4/32 + 7*a^3*b^5/8 + 35*a^3*b^4*c/8 + 35*a^3*b^3*c^2/4 + 35*a^3*b^2*c^3/4 + 35*a^3*b*c^4/8 + 7*a^3*c^5/8 - 9*a^2*b^6/16 + 21*a^2*b^5*c/8 + 41*a^2*b^4*c^2/16 + 35*a^2*b^3*c^3/4 + 41*a^2*b^2*c^4/16 + 21*a^2*b*c^5/8 - 9*a^2*c^6/16 + a*b^7/8 + 7*a*b^6*c/8 + 21*a*b^5*c^2/8 + 35*a*b^4*c^3/8 + 35*a*b^3*c^4/8 + 21*a*b^2*c^5/8 + 7*a*b*c^6/8 + a*c^7/8 + b^8/64 + b^7*c/8 - 9*b^6*c^2/16 + 7*b^5*c^3/8 - 29*b^4*c^4/32 + 7*b^3*c^5/8 - 9*b^2*c^6/16 + b*c^7/8 + c^8/64) := by
    rcases le_total a b with hab | hba
    · rcases le_total b c with hbc | hcb
      ·
        convert haux0 a b c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total a c with hac | hca
        ·
          convert haux0 a c b (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c a b (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total a c with hbc | hcb
      ·
        convert haux0 b a c (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total b c with hac | hca
        ·
          convert haux0 b c a (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 c b a (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (-a^6*b^2 - a^6*c^2 - 2*a^4*b^4 - 4*a^4*b^2*c^2 - 2*a^4*c^4 - a^2*b^6 - 4*a^2*b^4*c^2 - 4*a^2*b^2*c^4 - a^2*c^6 - b^6*c^2 - 2*b^4*c^4 - b^2*c^6 + 4) = (a^8/64 + a^7*b/8 + a^7*c/8 - 9*a^6*b^2/16 + 7*a^6*b*c/8 - 9*a^6*c^2/16 + 7*a^5*b^3/8 + 21*a^5*b^2*c/8 + 21*a^5*b*c^2/8 + 7*a^5*c^3/8 - 29*a^4*b^4/32 + 35*a^4*b^3*c/8 + 41*a^4*b^2*c^2/16 + 35*a^4*b*c^3/8 - 29*a^4*c^4/32 + 7*a^3*b^5/8 + 35*a^3*b^4*c/8 + 35*a^3*b^3*c^2/4 + 35*a^3*b^2*c^3/4 + 35*a^3*b*c^4/8 + 7*a^3*c^5/8 - 9*a^2*b^6/16 + 21*a^2*b^5*c/8 + 41*a^2*b^4*c^2/16 + 35*a^2*b^3*c^3/4 + 41*a^2*b^2*c^4/16 + 21*a^2*b*c^5/8 - 9*a^2*c^6/16 + a*b^7/8 + 7*a*b^6*c/8 + 21*a*b^5*c^2/8 + 35*a*b^4*c^3/8 + 35*a*b^3*c^4/8 + 21*a*b^2*c^5/8 + 7*a*b*c^6/8 + a*c^7/8 + b^8/64 + b^7*c/8 - 9*b^6*c^2/16 + 7*b^5*c^3/8 - 29*b^4*c^4/32 + 7*b^3*c^5/8 - 9*b^2*c^6/16 + b*c^7/8 + c^8/64) := by
    linear_combination (-a^7/64 - 7*a^6*b/64 - 7*a^6*c/64 - a^6/32 - 21*a^5*b^2/64 - 21*a^5*b*c/32 - 3*a^5*b/16 - 21*a^5*c^2/64 - 3*a^5*c/16 - a^5/16 - 35*a^4*b^3/64 - 105*a^4*b^2*c/64 - 15*a^4*b^2/32 - 105*a^4*b*c^2/64 - 15*a^4*b*c/16 - 5*a^4*b/16 - 35*a^4*c^3/64 - 15*a^4*c^2/32 - 5*a^4*c/16 - a^4/8 - 35*a^3*b^4/64 - 35*a^3*b^3*c/16 - 5*a^3*b^3/8 - 105*a^3*b^2*c^2/32 - 15*a^3*b^2*c/8 - 5*a^3*b^2/8 - 35*a^3*b*c^3/16 - 15*a^3*b*c^2/8 - 5*a^3*b*c/4 - a^3*b/2 - 35*a^3*c^4/64 - 5*a^3*c^3/8 - 5*a^3*c^2/8 - a^3*c/2 - a^3/4 - 21*a^2*b^5/64 - 105*a^2*b^4*c/64 - 15*a^2*b^4/32 - 105*a^2*b^3*c^2/32 - 15*a^2*b^3*c/8 - 5*a^2*b^3/8 - 105*a^2*b^2*c^3/32 - 45*a^2*b^2*c^2/16 - 15*a^2*b^2*c/8 - 3*a^2*b^2/4 - 105*a^2*b*c^4/64 - 15*a^2*b*c^3/8 - 15*a^2*b*c^2/8 - 3*a^2*b*c/2 - 3*a^2*b/4 - 21*a^2*c^5/64 - 15*a^2*c^4/32 - 5*a^2*c^3/8 - 3*a^2*c^2/4 - 3*a^2*c/4 - a^2/2 - 7*a*b^6/64 - 21*a*b^5*c/32 - 3*a*b^5/16 - 105*a*b^4*c^2/64 - 15*a*b^4*c/16 - 5*a*b^4/16 - 35*a*b^3*c^3/16 - 15*a*b^3*c^2/8 - 5*a*b^3*c/4 - a*b^3/2 - 105*a*b^2*c^4/64 - 15*a*b^2*c^3/8 - 15*a*b^2*c^2/8 - 3*a*b^2*c/2 - 3*a*b^2/4 - 21*a*b*c^5/32 - 15*a*b*c^4/16 - 5*a*b*c^3/4 - 3*a*b*c^2/2 - 3*a*b*c/2 - a*b - 7*a*c^6/64 - 3*a*c^5/16 - 5*a*c^4/16 - a*c^3/2 - 3*a*c^2/4 - a*c - a - b^7/64 - 7*b^6*c/64 - b^6/32 - 21*b^5*c^2/64 - 3*b^5*c/16 - b^5/16 - 35*b^4*c^3/64 - 15*b^4*c^2/32 - 5*b^4*c/16 - b^4/8 - 35*b^3*c^4/64 - 5*b^3*c^3/8 - 5*b^3*c^2/8 - b^3*c/2 - b^3/4 - 21*b^2*c^5/64 - 15*b^2*c^4/32 - 5*b^2*c^3/8 - 3*b^2*c^2/4 - 3*b^2*c/4 - b^2/2 - 7*b*c^6/64 - 3*b*c^5/16 - 5*b*c^4/16 - b*c^3/2 - 3*b*c^2/4 - b*c - b - c^7/64 - c^6/32 - c^5/16 - c^4/8 - c^3/4 - c^2/2 - c - 2) * hab
  nlinarith only [hp, he]
example : (∀ (a b c : ℝ) (ha : 0 ≤ a) (hb : 0 ≤ b) (hc : 0 ≤ c) (hab : a + b + c = 2), (a^2 + b^2 + c^2) * (a^2 + b^2) * (b^2 + c^2) * (c^2 + a^2) ≤ 4) := @solution
#print axioms solution
