-- Prove2me | solution 1 for WorkbookSource.plus_17559
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T06:46:59.871402+00:00
-- url     : https://prove2.me/submissions/02c687e6-6845-4425-9f79-cf339fa4feaf

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 3) : 1 / (a ^ 2 + 7 * b ^ 2 + 7 * c ^ 2) + 1 / (b ^ 2 + 7 * c ^ 2 + 7 * a ^ 2) + 1 / (c ^ 2 + 7 * a ^ 2 + 7 * b ^ 2) ≤ 1 / 5   := by
  have hhom : 0 ≤ (14*a^6 - 70*a^5*b - 70*a^5*c + 274*a^4*b^2 - 70*a^4*b*c + 274*a^4*c^2 - 180*a^3*b^3 - 180*a^3*b^2*c - 180*a^3*b*c^2 - 180*a^3*c^3 + 274*a^2*b^4 - 180*a^2*b^3*c + 564*a^2*b^2*c^2 - 180*a^2*b*c^3 + 274*a^2*c^4 - 70*a*b^5 - 70*a*b^4*c - 180*a*b^3*c^2 - 180*a*b^2*c^3 - 70*a*b*c^4 - 70*a*c^5 + 14*b^6 - 70*b^5*c + 274*b^4*c^2 - 180*b^3*c^3 + 274*b^2*c^4 - 70*b*c^5 + 14*c^6) := by
    have hs0 : 0 ≤ (218 : ℝ) * (1) * (7*a^3/218 + 47*a^2*b/109 - 97*a^2*c/218 - 97*a*b^2/218 - 35*a*c^2/218 + 14*b^3/109 - 83*b^2*c/218 + b*c^2 - 35*c^3/218)^2 := by positivity
    have hs1 : 0 ≤ (46299/218 : ℝ) * (1) * (6349*a^3/46299 - 5952*a^2*b/15433 - 7163*a^2*c/15433 + 5699*a*b^2/15433 + a*c^2 + 2506*b^3/46299 - 8017*b^2*c/15433 - 35*c^3/183)^2 := by positivity
    have hs2 : 0 ≤ (2251344/15433 : ℝ) * (1) * (1267*a^3/9078 - 7027*a^2*b/93806 - 33361*a^2*c/46903 + a*b^2 - 25837*b^3/140709 - 647*b^2*c/3026 + 12397*c^3/281418)^2 := by positivity
    have hs3 : 0 ≤ (6803748/46903 : ℝ) * (1) * (-2015*a^3/11571 + a^2*b - 148*a^2*c/551 + 488*b^3/3857 - 403*b^2*c/551 + c^3/21)^2 := by positivity
    have hs4 : 0 ≤ (24696/551 : ℝ) * (1) * (5*a^3/21 - a^2*c - 5*b^3/21 + b^2*c)^2 := by positivity
    nlinarith only [hs0, hs1, hs2, hs3, hs4]
  have hehom : (49*a^6 + 399*a^4*b^2 + 399*a^4*c^2 - 315*a^4 + 399*a^2*b^4 + 834*a^2*b^2*c^2 - 810*a^2*b^2 + 399*a^2*c^4 - 810*a^2*c^2 + 49*b^6 + 399*b^4*c^2 - 315*b^4 + 399*b^2*c^4 - 810*b^2*c^2 + 49*c^6 - 315*c^4) = (14*a^6 - 70*a^5*b - 70*a^5*c + 274*a^4*b^2 - 70*a^4*b*c + 274*a^4*c^2 - 180*a^3*b^3 - 180*a^3*b^2*c - 180*a^3*b*c^2 - 180*a^3*c^3 + 274*a^2*b^4 - 180*a^2*b^3*c + 564*a^2*b^2*c^2 - 180*a^2*b*c^3 + 274*a^2*c^4 - 70*a*b^5 - 70*a*b^4*c - 180*a*b^3*c^2 - 180*a*b^2*c^3 - 70*a*b*c^4 - 70*a*c^5 + 14*b^6 - 70*b^5*c + 274*b^4*c^2 - 180*b^3*c^3 + 274*b^2*c^4 - 70*b*c^5 + 14*c^6) := by
    linear_combination (35*a^5 + 35*a^4*b + 35*a^4*c + 105*a^4 + 90*a^3*b^2 + 90*a^3*c^2 + 90*a^2*b^3 + 90*a^2*b^2*c + 270*a^2*b^2 + 90*a^2*b*c^2 + 90*a^2*c^3 + 270*a^2*c^2 + 35*a*b^4 + 90*a*b^2*c^2 + 35*a*c^4 + 35*b^5 + 35*b^4*c + 105*b^4 + 90*b^3*c^2 + 90*b^2*c^3 + 270*b^2*c^2 + 35*b*c^4 + 35*c^5 + 105*c^4) * habc
  have hn : 0 ≤ (49*a^6 + 399*a^4*b^2 + 399*a^4*c^2 - 315*a^4 + 399*a^2*b^4 + 834*a^2*b^2*c^2 - 810*a^2*b^2 + 399*a^2*c^4 - 810*a^2*c^2 + 49*b^6 + 399*b^4*c^2 - 315*b^4 + 399*b^2*c^4 - 810*b^2*c^2 + 49*c^6 - 315*c^4) := by linarith only [hhom, hehom]
  have hd : (0 : ℝ) < (5*(a^2 + 7*b^2 + 7*c^2)*(7*a^2 + b^2 + 7*c^2)*(7*a^2 + 7*b^2 + c^2)) := by positivity
  have heqrat : ( 1 / 5   ) - ( 1 / (a ^ 2 + 7 * b ^ 2 + 7 * c ^ 2) + 1 / (b ^ 2 + 7 * c ^ 2 + 7 * a ^ 2) + 1 / (c ^ 2 + 7 * a ^ 2 + 7 * b ^ 2) ) = (49*a^6 + 399*a^4*b^2 + 399*a^4*c^2 - 315*a^4 + 399*a^2*b^4 + 834*a^2*b^2*c^2 - 810*a^2*b^2 + 399*a^2*c^4 - 810*a^2*c^2 + 49*b^6 + 399*b^4*c^2 - 315*b^4 + 399*b^2*c^4 - 810*b^2*c^2 + 49*c^6 - 315*c^4) / (5*(a^2 + 7*b^2 + 7*c^2)*(7*a^2 + b^2 + 7*c^2)*(7*a^2 + 7*b^2 + c^2)) := by
    field_simp (disch := positivity)
    <;> ring
  have hp := div_nonneg hn (le_of_lt hd)
  linarith only [heqrat, hp]
example : (∀ (a b c : ℝ) (ha : 0 < a) (hb : 0 < b) (hc : 0 < c) (habc : a + b + c = 3), 1 / (a ^ 2 + 7 * b ^ 2 + 7 * c ^ 2) + 1 / (b ^ 2 + 7 * c ^ 2 + 7 * a ^ 2) + 1 / (c ^ 2 + 7 * a ^ 2 + 7 * b ^ 2) ≤ 1 / 5) := @solution
#print axioms solution
