-- Prove2me | solution 1 for WorkbookSource.base_51586
-- status  : ACCEPTED   (prove)
-- author  : @wamlart
-- created : 2026-09-13T04:42:57.904451+00:00
-- url     : https://prove2.me/submissions/296f7ede-358b-4a07-af00-cc18285e2a06

import Mathlib
set_option autoImplicit false
set_option maxHeartbeats 600000
theorem solution (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z) (h : x + y + z = 3) : (2 * y ^ 3 * z ^ 3 + x ^ 4 + 5) / (2 * y * z) + (2 * z ^ 3 * x ^ 3 + y ^ 4 + 5) / (2 * z * x) + (2 * x ^ 3 * y ^ 3 + z ^ 4 + 5) / (2 * x * y) ≥ (x ^ 2 + 3) / x + (y ^ 2 + 3) / y + (z ^ 2 + 3) / z  := by
  have haux0 (x y z : ℝ) (hlow : 0 ≤ x) (hord1 : x ≤ y) (hord2 : y ≤ z) : 0 ≤ (86*x^7/729 + 179*x^6*y/729 + 179*x^6*z/729 + 32*x^5*y^2/243 + 40*x^5*y*z/243 + 32*x^5*z^2/243 - 5*x^4*y^3/729 - 107*x^4*y^2*z/243 - 107*x^4*y*z^2/243 - 5*x^4*z^3/729 - 5*x^3*y^4/729 + 934*x^3*y^3*z/729 - 346*x^3*y^2*z^2/243 + 934*x^3*y*z^3/729 - 5*x^3*z^4/729 + 32*x^2*y^5/243 - 107*x^2*y^4*z/243 - 346*x^2*y^3*z^2/243 - 346*x^2*y^2*z^3/243 - 107*x^2*y*z^4/243 + 32*x^2*z^5/243 + 179*x*y^6/729 + 40*x*y^5*z/243 - 107*x*y^4*z^2/243 + 934*x*y^3*z^3/729 - 107*x*y^2*z^4/243 + 40*x*y*z^5/243 + 179*x*z^6/729 + 86*y^7/729 + 179*y^6*z/729 + 32*y^5*z^2/243 - 5*y^4*z^3/729 - 5*y^3*z^4/729 + 32*y^2*z^5/243 + 179*y*z^6/729 + 86*z^7/729) := by
    have hdiff1 : 0 ≤ (y - x) := by linarith
    have hdiff2 : 0 ≤ (z - y) := by linarith
    have hpos : 0 ≤ (26/3 : ℝ) * x^5 * (y - x)^2 + (26/3 : ℝ) * x^5 * (y - x)^1 * (z - y)^1 + (26/3 : ℝ) * x^5 * (z - y)^2 + (248/9 : ℝ) * x^4 * (y - x)^3 + (124/3 : ℝ) * x^4 * (y - x)^2 * (z - y)^1 + (136/3 : ℝ) * x^4 * (y - x)^1 * (z - y)^2 + (142/9 : ℝ) * x^4 * (z - y)^3 + (980/27 : ℝ) * x^3 * (y - x)^4 + (1960/27 : ℝ) * x^3 * (y - x)^3 * (z - y)^1 + (280/3 : ℝ) * x^3 * (y - x)^2 * (z - y)^2 + (1540/27 : ℝ) * x^3 * (y - x)^1 * (z - y)^3 + (344/27 : ℝ) * x^3 * (z - y)^4 + (658/27 : ℝ) * x^2 * (y - x)^5 + (1645/27 : ℝ) * x^2 * (y - x)^4 * (z - y)^1 + (2506/27 : ℝ) * x^2 * (y - x)^3 * (z - y)^2 + (2114/27 : ℝ) * x^2 * (y - x)^2 * (z - y)^3 + (911/27 : ℝ) * x^2 * (y - x)^1 * (z - y)^4 + (158/27 : ℝ) * x^2 * (z - y)^5 + (1958/243 : ℝ) * x^1 * (y - x)^6 + (1958/81 : ℝ) * x^1 * (y - x)^5 * (z - y)^1 + (3550/81 : ℝ) * x^1 * (y - x)^4 * (z - y)^2 + (11510/243 : ℝ) * x^1 * (y - x)^3 * (z - y)^3 + (2386/81 : ℝ) * x^1 * (y - x)^2 * (z - y)^4 + (794/81 : ℝ) * x^1 * (y - x)^1 * (z - y)^5 + (320/243 : ℝ) * x^1 * (z - y)^6 + (712/729 : ℝ) * (y - x)^7 + (2492/729 : ℝ) * (y - x)^6 * (z - y)^1 + (1834/243 : ℝ) * (y - x)^5 * (z - y)^2 + (7525/729 : ℝ) * (y - x)^4 * (z - y)^3 + (6170/729 : ℝ) * (y - x)^3 * (z - y)^4 + (992/243 : ℝ) * (y - x)^2 * (z - y)^5 + (781/729 : ℝ) * (y - x)^1 * (z - y)^6 + (86/729 : ℝ) * (z - y)^7 := by positivity
    convert hpos using 1 <;> ring
  have hp : 0 ≤ (86*x^7/729 + 179*x^6*y/729 + 179*x^6*z/729 + 32*x^5*y^2/243 + 40*x^5*y*z/243 + 32*x^5*z^2/243 - 5*x^4*y^3/729 - 107*x^4*y^2*z/243 - 107*x^4*y*z^2/243 - 5*x^4*z^3/729 - 5*x^3*y^4/729 + 934*x^3*y^3*z/729 - 346*x^3*y^2*z^2/243 + 934*x^3*y*z^3/729 - 5*x^3*z^4/729 + 32*x^2*y^5/243 - 107*x^2*y^4*z/243 - 346*x^2*y^3*z^2/243 - 346*x^2*y^2*z^3/243 - 107*x^2*y*z^4/243 + 32*x^2*z^5/243 + 179*x*y^6/729 + 40*x*y^5*z/243 - 107*x*y^4*z^2/243 + 934*x*y^3*z^3/729 - 107*x*y^2*z^4/243 + 40*x*y*z^5/243 + 179*x*z^6/729 + 86*y^7/729 + 179*y^6*z/729 + 32*y^5*z^2/243 - 5*y^4*z^3/729 - 5*y^3*z^4/729 + 32*y^2*z^5/243 + 179*y*z^6/729 + 86*z^7/729) := by
    rcases le_total x y with hab | hba
    · rcases le_total y z with hbc | hcb
      ·
        convert haux0 x y z (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total x z with hac | hca
        ·
          convert haux0 x z y (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 z x y (by positivity) (by linarith) (by linarith) using 1 <;> ring
    · rcases le_total x z with hbc | hcb
      ·
        convert haux0 y x z (by positivity) (by linarith) (by linarith) using 1 <;> ring
      · rcases le_total y z with hac | hca
        ·
          convert haux0 y z x (by positivity) (by linarith) (by linarith) using 1 <;> ring
        ·
          convert haux0 z y x (by positivity) (by linarith) (by linarith) using 1 <;> ring
  have he : (x^5 + 2*x^3*y^3*z + 2*x^3*y*z^3 - 2*x^2*y*z + 2*x*y^3*z^3 - 2*x*y^2*z - 2*x*y*z^2 - 6*x*y - 6*x*z + 5*x + y^5 - 6*y*z + 5*y + z^5 + 5*z) = (86*x^7/729 + 179*x^6*y/729 + 179*x^6*z/729 + 32*x^5*y^2/243 + 40*x^5*y*z/243 + 32*x^5*z^2/243 - 5*x^4*y^3/729 - 107*x^4*y^2*z/243 - 107*x^4*y*z^2/243 - 5*x^4*z^3/729 - 5*x^3*y^4/729 + 934*x^3*y^3*z/729 - 346*x^3*y^2*z^2/243 + 934*x^3*y*z^3/729 - 5*x^3*z^4/729 + 32*x^2*y^5/243 - 107*x^2*y^4*z/243 - 346*x^2*y^3*z^2/243 - 346*x^2*y^2*z^3/243 - 107*x^2*y*z^4/243 + 32*x^2*z^5/243 + 179*x*y^6/729 + 40*x*y^5*z/243 - 107*x*y^4*z^2/243 + 934*x*y^3*z^3/729 - 107*x*y^2*z^4/243 + 40*x*y*z^5/243 + 179*x*z^6/729 + 86*y^7/729 + 179*y^6*z/729 + 32*y^5*z^2/243 - 5*y^4*z^3/729 - 5*y^3*z^4/729 + 32*y^2*z^5/243 + 179*y*z^6/729 + 86*z^7/729) := by
    linear_combination (-86*x^6/729 - 31*x^5*y/243 - 31*x^5*z/243 - 86*x^5/243 - x^4*y^2/243 + 22*x^4*y*z/243 - 7*x^4*y/243 - x^4*z^2/243 - 7*x^4*z/243 - 5*x^4/81 + 8*x^3*y^3/729 + 86*x^3*y^2*z/243 + 4*x^3*y^2/243 + 86*x^3*y*z^2/243 + 80*x^3*y*z/243 - 2*x^3*y/81 + 8*x^3*z^3/729 + 4*x^3*z^2/243 - 2*x^3*z/81 - 5*x^3/27 - x^2*y^4/243 + 86*x^2*y^3*z/243 + 4*x^2*y^3/243 + 58*x^2*y^2*z^2/81 + 58*x^2*y^2*z/81 + 2*x^2*y^2/27 + 86*x^2*y*z^3/243 + 58*x^2*y*z^2/81 + 28*x^2*y*z/27 + x^2*y/9 - x^2*z^4/243 + 4*x^2*z^3/243 + 2*x^2*z^2/27 + x^2*z/9 - 5*x^2/9 - 31*x*y^5/243 + 22*x*y^4*z/243 - 7*x*y^4/243 + 86*x*y^3*z^2/243 + 80*x*y^3*z/243 - 2*x*y^3/81 + 86*x*y^2*z^3/243 + 58*x*y^2*z^2/81 + 28*x*y^2*z/27 + x*y^2/9 + 22*x*y*z^4/243 + 80*x*y*z^3/243 + 28*x*y*z^2/27 + 8*x*y*z/9 + 8*x*y/9 - 31*x*z^5/243 - 7*x*z^4/243 - 2*x*z^3/81 + x*z^2/9 + 8*x*z/9 - 5*x/3 - 86*y^6/729 - 31*y^5*z/243 - 86*y^5/243 - y^4*z^2/243 - 7*y^4*z/243 - 5*y^4/81 + 8*y^3*z^3/729 + 4*y^3*z^2/243 - 2*y^3*z/81 - 5*y^3/27 - y^2*z^4/243 + 4*y^2*z^3/243 + 2*y^2*z^2/27 + y^2*z/9 - 5*y^2/9 - 31*y*z^5/243 - 7*y*z^4/243 - 2*y*z^3/81 + y*z^2/9 + 8*y*z/9 - 5*y/3 - 86*z^6/729 - 86*z^5/243 - 5*z^4/81 - 5*z^3/27 - 5*z^2/9 - 5*z/3) * h
  have hn : 0 ≤ (x^5 + 2*x^3*y^3*z + 2*x^3*y*z^3 - 2*x^2*y*z + 2*x*y^3*z^3 - 2*x*y^2*z - 2*x*y*z^2 - 6*x*y - 6*x*z + 5*x + y^5 - 6*y*z + 5*y + z^5 + 5*z) := by nlinarith only [hp, he]
  field_simp (disch := positivity)
  nlinarith only [hn]
example : (∀ (x y z : ℝ) (hx : 0 < x) (hy : 0 < y) (hz : 0 < z) (h : x + y + z = 3), (2 * y ^ 3 * z ^ 3 + x ^ 4 + 5) / (2 * y * z) + (2 * z ^ 3 * x ^ 3 + y ^ 4 + 5) / (2 * z * x) + (2 * x ^ 3 * y ^ 3 + z ^ 4 + 5) / (2 * x * y) ≥ (x ^ 2 + 3) / x + (y ^ 2 + 3) / y + (z ^ 2 + 3) / z) := @solution
#print axioms solution
